// Copyright © 2025-2026 Rouven Spreckels <rs@qu1x.dev>
//
// This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of
// the MPL was not distributed with this file, You can obtain one at https://mozilla.org/MPL/2.0/.

use super::{BasisBlade, Multivector, Pga, Symbol};

#[rustfmt::skip]
basis!(TAB6, LUT6, 6, [
    // 1
    ('v', e),
    // 1
    ('W', e0),
    // 6
    ('x', e1),
    ('y', e2),
    ('z', e3),
    ('ð', e4),
    ('ø', e5),
    ('þ', e6),
    // 6
    ('X', e01),
    ('Y', e02),
    ('Z', e03),
    ('Ð', e04),
    ('Ø', e05),
    ('Þ', e06),
    // 15
    ('α', e12),
    ('β', e13),
    ('γ', e14),
    ('δ', e15),
    ('ε', e16),
    ('ζ', e23),
    ('η', e24),
    ('θ', e25),
    ('ι', e26),
    ('κ', e34),
    ('λ', e35),
    ('μ', e36),
    ('ν', e45),
    ('ξ', e46),
    ('ο', e56),
    // 15
    ('Α', e012),
    ('Β', e013),
    ('Γ', e014),
    ('Δ', e015),
    ('Ε', e016),
    ('Ζ', e023),
    ('Η', e024),
    ('Θ', e025),
    ('Ι', e026),
    ('Κ', e034),
    ('Λ', e035),
    ('Μ', e036),
    ('Ν', e045),
    ('Ξ', e046),
    ('Ο', e056),
    // 20
    ('a', e123),
    ('b', e124),
    ('c', e125),
    ('d', e126),
    ('e', e134),
    ('f', e135),
    ('g', e136),
    ('h', e145),
    ('i', e146),
    ('j', e156),
    ('k', e234),
    ('l', e235),
    ('m', e236),
    ('n', e245),
    ('o', e246),
    ('p', e256),
    ('q', e345),
    ('r', e346),
    ('s', e356),
    ('t', e456),
    // 20
    ('T', e0123),
    ('S', e0142),
    ('R', e0125),
    ('Q', e0162),
    ('P', e0134),
    ('O', e0153),
    ('N', e0136),
    ('M', e0145),
    ('L', e0164),
    ('K', e0156),
    ('J', e0243),
    ('I', e0235),
    ('H', e0263),
    ('G', e0254),
    ('F', e0246),
    ('E', e0265),
    ('D', e0345),
    ('C', e0364),
    ('B', e0356),
    ('A', e0465),
    // 15
    ('ο', e1234),
    ('ξ', e1253),
    ('ν', e1236),
    ('μ', e1245),
    ('λ', e1264),
    ('κ', e1256),
    ('ι', e1354),
    ('θ', e1346),
    ('η', e1365),
    ('ζ', e1456),
    ('ε', e2345),
    ('δ', e2364),
    ('γ', e2356),
    ('β', e2465),
    ('α', e3456),
    // 15
    ('Ο', e01234),
    ('Ξ', e01253),
    ('Ν', e01236),
    ('Μ', e01245),
    ('Λ', e01264),
    ('Κ', e01256),
    ('Ι', e01354),
    ('Θ', e01346),
    ('Η', e01365),
    ('Ζ', e01456),
    ('Ε', e02345),
    ('Δ', e02364),
    ('Γ', e02356),
    ('Β', e02465),
    ('Α', e03456),
    // 6
    ('þ', e12354),
    ('ø', e12346),
    ('ð', e12365),
    ('z', e12456),
    ('y', e13465),
    ('x', e23456),
    // 6
    ('Þ', e012345),
    ('Ø', e012364),
    ('Ð', e012356),
    ('Z', e012465),
    ('Y', e013456),
    ('X', e023465),
    // 1
    ('w', e123456),
    // 1
    ('V', e0123456),
]);

/// The named entities of the PGA with embedded dimension $`N = 6`$.
impl<const M: i8> Multivector<Pga<M, 6>> {
    /// The multivector of scalar $`s \equiv v\e`$ where $`\e \equiv 1`$.
    #[must_use]
    #[inline]
    pub fn scalar() -> Self {
        Self::e()
    }
    /// The multivector of pseudoscalar $`S \equiv V\I`$ where $`\I \equiv \e_{0123456}`$.
    #[must_use]
    #[inline]
    pub fn pseudoscalar() -> Self {
        Self::e0123456()
    }
    /// The multivector of norm $`n \equiv s + p`$.
    ///
    /// Quadvector $`p`$ does not square to a scalar, therefore $`n`$ is **not** a generalized
    /// complex number.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let quadvector_norm_squared = Vee::plane().norm_squared();
    ///
    /// assert_eq!(quadvector_norm_squared.basis_blades(), Vee::norm().basis_blades());
    /// format_eq!(quadvector_norm_squared, [
    ///     "+α̇α̇+β̇β̇+γ̇γ̇+δ̇δ̇+ε̇ε̇+ζ̇ζ̇+η̇η̇+θ̇θ̇+ι̇ι̇+κ̇κ̇+λ̇λ̇+μ̇μ̇+ν̇ν̇+ξ̇ξ̇+ο̇ο̇",
    ///     "+2(-κ̇ο̇+λ̇ξ̇-μ̇ν̇)e3456",
    ///     "+2(+η̇ο̇-θ̇ξ̇+ι̇ν̇)e2465",
    ///     "+2(-ζ̇ο̇+θ̇μ̇-ι̇λ̇)e2356",
    ///     "+2(+ζ̇ξ̇-η̇μ̇+ι̇κ̇)e2364",
    ///     "+2(-ζ̇ν̇+η̇λ̇-θ̇κ̇)e2345",
    ///     "+2(-γ̇ο̇+δ̇ξ̇-ε̇ν̇)e1456",
    ///     "+2(+β̇ο̇-δ̇μ̇+ε̇λ̇)e1365",
    ///     "+2(-β̇ξ̇+γ̇μ̇-ε̇κ̇)e1346",
    ///     "+2(+β̇ν̇-γ̇λ̇+δ̇κ̇)e1354",
    ///     "+2(-α̇ο̇+δ̇ι̇-ε̇θ̇)e1256",
    ///     "+2(+α̇ξ̇-γ̇ι̇+ε̇η̇)e1264",
    ///     "+2(-α̇ν̇+γ̇θ̇-δ̇η̇)e1245",
    ///     "+2(-α̇μ̇+β̇ι̇-ε̇ζ̇)e1236",
    ///     "+2(+α̇λ̇-β̇θ̇+δ̇ζ̇)e1253",
    ///     "+2(-α̇κ̇+β̇η̇-γ̇ζ̇)e1234",
    ///     "+2(-Ḣε̇+İδ̇-J̇γ̇-Ṅι̇+Ȯθ̇-Ṗη̇-Q̇μ̇+Ṙλ̇-Ṡκ̇)e0465",
    ///     "+2(+Ḟε̇-Ġδ̇+J̇β̇+L̇ι̇-Ṁθ̇+Ṗζ̇-Q̇ξ̇+Ṙν̇-Ṫκ̇)e0356",
    ///     "+2(-Ėε̇+Ġγ̇-İβ̇-K̇ι̇+Ṁη̇-Ȯζ̇-Q̇ο̇+Ṡν̇-Ṫλ̇)e0364",
    ///     "+2(+Ėδ̇-Ḟγ̇+Ḣβ̇+K̇θ̇-L̇η̇+Ṅζ̇-Ṙο̇+Ṡξ̇-Ṫμ̇)e0345",
    ///     "+2(-Ċε̇+Ḋδ̇-J̇α̇+L̇μ̇-Ṁλ̇+Ṅξ̇-Ȯν̇+Ṡζ̇+Ṫη̇)e0265",
    ///     "+2(+Ḃε̇-Ḋγ̇+İα̇-K̇μ̇+Ṁκ̇+Ṅο̇-Ṗν̇-Ṙζ̇+Ṫθ̇)e0246",
    ///     "+2(-Ḃδ̇+Ċγ̇-Ḣα̇+K̇λ̇-L̇κ̇+Ȯο̇-Ṗξ̇+Q̇ζ̇+Ṫι̇)e0254",
    ///     "+2(-Ȧε̇+Ḋβ̇-Ġα̇-K̇ξ̇-L̇ο̇+Ȯκ̇+Ṗλ̇-Ṙη̇-Ṡθ̇)e0263",
    ///     "+2(+Ȧδ̇-Ċβ̇+Ḟα̇+K̇ν̇-Ṁο̇-Ṅκ̇+Ṗμ̇+Q̇η̇-Ṡι̇)e0235",
    ///     "+2(-Ȧγ̇+Ḃβ̇-Ėα̇+L̇ν̇+Ṁξ̇-Ṅλ̇-Ȯμ̇+Q̇θ̇+Ṙι̇)e0243",
    ///     "+2(-Ċι̇+Ḋθ̇-Ḟμ̇+Ġλ̇-Ḣξ̇+İν̇-Ṗα̇-Ṡβ̇-Ṫγ̇)e0156",
    ///     "+2(+Ḃι̇-Ḋη̇+Ėμ̇-Ġκ̇-Ḣο̇+J̇ν̇+Ȯα̇+Ṙβ̇-Ṫδ̇)e0164",
    ///     "+2(-Ḃθ̇+Ċη̇-Ėλ̇+Ḟκ̇-İο̇+J̇ξ̇-Ṅα̇-Q̇β̇-Ṫε̇)e0145",
    ///     "+2(-Ȧι̇+Ḋζ̇+Ėξ̇+Ḟο̇-İκ̇-J̇λ̇-Ṁα̇+Ṙγ̇+Ṡδ̇)e0136",
    ///     "+2(+Ȧθ̇-Ċζ̇-Ėν̇+Ġο̇+Ḣκ̇-J̇μ̇+L̇α̇-Q̇γ̇+Ṡε̇)e0153",
    ///     "+2(-Ȧη̇+Ḃζ̇-Ḟν̇-Ġξ̇+Ḣλ̇+İμ̇-K̇α̇-Q̇δ̇-Ṙε̇)e0134",
    ///     "+2(-Ȧμ̇-Ḃξ̇-Ċο̇+Ġζ̇+İη̇+J̇θ̇-Ṁβ̇-Ȯγ̇-Ṗδ̇)e0162",
    ///     "+2(+Ȧλ̇+Ḃν̇-Ḋο̇-Ḟζ̇-Ḣη̇+J̇ι̇+L̇β̇+Ṅγ̇-Ṗε̇)e0125",
    ///     "+2(-Ȧκ̇+Ċν̇+Ḋξ̇+Ėζ̇-Ḣθ̇-İι̇-K̇β̇+Ṅδ̇+Ȯε̇)e0142",
    ///     "+2(-Ḃκ̇-Ċλ̇-Ḋμ̇+Ėη̇+Ḟθ̇+Ġι̇-K̇γ̇-L̇δ̇-Ṁε̇)e0123",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn norm() -> Self {
        Self::scalar() + Self::plane()
    }
    /// The multivector of bias $`v^5_\infty \equiv W\e_0`$.
    #[must_use]
    #[inline]
    pub fn bias() -> Self {
        Self::e0()
    }
    /// The multivector of normal $`v^5_0 \equiv x\e_1 + y\e_2 + z\e_3 + ð\e_4 + ø\e_5 + þ\e_6`$.
    #[must_use]
    #[inline]
    pub fn normal() -> Self {
        Self::e1() + Self::e2() + Self::e3() + Self::e4() + Self::e5() + Self::e6()
    }
    /// The multivector of $`5`$-volume $`v^5 \equiv v^5_0 + v^5_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume5() -> Self {
        Self::bias() + Self::normal()
    }
    /// The multivector of $`4`$-volume moment $`v^4_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume4_moment() -> Self {
        Self::e01() + Self::e02() + Self::e03() + Self::e04() + Self::e05() + Self::e06()
    }
    /// The multivector of $`4`$-volume displacement $`v^4_0`$.
    #[must_use]
    #[inline]
    pub fn volume4_displacement() -> Self {
        Self::e12()
            + Self::e13()
            + Self::e14()
            + Self::e15()
            + Self::e16()
            + Self::e23()
            + Self::e24()
            + Self::e25()
            + Self::e26()
            + Self::e34()
            + Self::e35()
            + Self::e36()
            + Self::e45()
            + Self::e46()
            + Self::e56()
    }
    /// The multivector of $`4`$-volume $`v^4 \equiv v^4_0 + v^4_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume4() -> Self {
        Self::volume4_moment() + Self::volume4_displacement()
    }
    /// The multivector of volume moment $`v_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume_moment() -> Self {
        Self::e012()
            + Self::e013()
            + Self::e014()
            + Self::e015()
            + Self::e016()
            + Self::e023()
            + Self::e024()
            + Self::e025()
            + Self::e026()
            + Self::e034()
            + Self::e035()
            + Self::e036()
            + Self::e045()
            + Self::e046()
            + Self::e056()
    }
    /// The multivector of volume displacement $`v_0`$.
    #[must_use]
    #[inline]
    pub fn volume_displacement() -> Self {
        Self::e123()
            + Self::e124()
            + Self::e125()
            + Self::e126()
            + Self::e134()
            + Self::e135()
            + Self::e136()
            + Self::e145()
            + Self::e146()
            + Self::e156()
            + Self::e234()
            + Self::e235()
            + Self::e236()
            + Self::e245()
            + Self::e246()
            + Self::e256()
            + Self::e345()
            + Self::e346()
            + Self::e356()
            + Self::e456()
    }
    /// The multivector of volume $`v \equiv v_0 + v_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume() -> Self {
        Self::volume_moment() + Self::volume_displacement()
    }
    /// The multivector of plane moment $`p_\infty`$.
    #[must_use]
    #[inline]
    pub fn plane_moment() -> Self {
        (Self::e0123()
            + Self::e0142()
            + Self::e0125()
            + Self::e0162()
            + Self::e0134()
            + Self::e0153()
            + Self::e0136()
            + Self::e0145()
            + Self::e0164()
            + Self::e0156()
            + Self::e0243()
            + Self::e0235()
            + Self::e0263()
            + Self::e0254()
            + Self::e0246()
            + Self::e0265()
            + Self::e0345()
            + Self::e0364()
            + Self::e0356()
            + Self::e0465())
        .alt()
    }
    /// The multivector of plane displacement $`p_0`$.
    #[must_use]
    #[inline]
    pub fn plane_displacement() -> Self {
        (Self::e1234()
            + Self::e1253()
            + Self::e1236()
            + Self::e1245()
            + Self::e1264()
            + Self::e1256()
            + Self::e1354()
            + Self::e1346()
            + Self::e1365()
            + Self::e1456()
            + Self::e2345()
            + Self::e2364()
            + Self::e2356()
            + Self::e2465()
            + Self::e3456())
        .alt()
    }
    /// The multivector of plane $`p \equiv p_0 + p_\infty`$.
    #[must_use]
    #[inline]
    pub fn plane() -> Self {
        Self::plane_moment() + Self::plane_displacement()
    }
    /// The multivector of line moment $`\ell_\infty`$.
    #[must_use]
    #[inline]
    pub fn line_moment() -> Self {
        (Self::e01234()
            + Self::e01253()
            + Self::e01236()
            + Self::e01245()
            + Self::e01264()
            + Self::e01256()
            + Self::e01354()
            + Self::e01346()
            + Self::e01365()
            + Self::e01456()
            + Self::e02345()
            + Self::e02364()
            + Self::e02356()
            + Self::e02465()
            + Self::e03456())
        .alt()
    }
    /// The multivector of line displacement $`\ell_0`$.
    #[must_use]
    #[inline]
    pub fn line_displacement() -> Self {
        (Self::e12354()
            + Self::e12346()
            + Self::e12365()
            + Self::e12456()
            + Self::e13465()
            + Self::e23456())
        .alt()
    }
    /// The multivector of line $`\ell \equiv \ell_0 + \ell_\infty`$.
    #[must_use]
    #[inline]
    pub fn line() -> Self {
        Self::line_moment() + Self::line_displacement()
    }
    /// The multivector of direction $`P_\infty`$.
    #[must_use]
    #[inline]
    pub fn direction() -> Self {
        (Self::e012345()
            + Self::e012364()
            + Self::e012356()
            + Self::e012465()
            + Self::e013456()
            + Self::e023465())
        .alt()
    }
    /// The multivector of weight $`P_0`$.
    #[must_use]
    #[inline]
    pub fn weight() -> Self {
        Self::e123456().alt()
    }
    /// The multivector of point $`P \equiv P_0 + P_\infty`$.
    #[must_use]
    #[inline]
    pub fn point() -> Self {
        Self::direction() + Self::weight()
    }
    /// The multivector of single rotator $`r_1 \equiv s + v^4_0`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let single_rotator = Vee::normal().lhs() * Vee::normal().rhs();
    ///
    /// assert_eq!(
    ///     single_rotator.basis_blades(),
    ///     Vee::single_rotator().basis_blades()
    /// );
    /// format_eq!(single_rotator, [
    ///     "+x͔x͕+y͔y͕+z͔z͕+ð͔ð͕+ø͔ø͕+þ͔þ͕",
    ///     "+(+x͔y͕-x͕y͔)e12",
    ///     "+(+x͔z͕-x͕z͔)e13",
    ///     "+(+x͔ð͕-x͕ð͔)e14",
    ///     "+(+x͔ø͕-x͕ø͔)e15",
    ///     "+(+x͔þ͕-x͕þ͔)e16",
    ///     "+(+y͔z͕-y͕z͔)e23",
    ///     "+(+y͔ð͕-y͕ð͔)e24",
    ///     "+(+y͔ø͕-y͕ø͔)e25",
    ///     "+(+y͔þ͕-y͕þ͔)e26",
    ///     "+(+z͔ð͕-z͕ð͔)e34",
    ///     "+(+z͔ø͕-z͕ø͔)e35",
    ///     "+(+z͔þ͕-z͕þ͔)e36",
    ///     "+(+ð͔ø͕-ð͕ø͔)e45",
    ///     "+(+ð͔þ͕-ð͕þ͔)e46",
    ///     "+(+ø͔þ͕-ø͕þ͔)e56",
    /// ]);
    ///
    /// let single_rotator = Vee::line_displacement().lhs() * Vee::line_displacement().rhs();
    ///
    /// assert_eq!(
    ///     single_rotator.basis_blades(),
    ///     Vee::single_rotator().basis_blades()
    /// );
    /// format_eq!(single_rotator, [
    ///     "+ẋ͔ẋ͕+ẏ͔ẏ͕+ż͔ż͕+ð͔̇ð͕̇+ø͔̇ø͕̇+þ͔̇þ͕̇",
    ///     "+(+ẋ͔ẏ͕-ẋ͕ẏ͔)e12",
    ///     "+(+ẋ͔ż͕-ẋ͕ż͔)e13",
    ///     "+(+ẋ͔ð͕̇-ẋ͕ð͔̇)e14",
    ///     "+(+ẋ͔ø͕̇-ẋ͕ø͔̇)e15",
    ///     "+(+ẋ͔þ͕̇-ẋ͕þ͔̇)e16",
    ///     "+(+ẏ͔ż͕-ẏ͕ż͔)e23",
    ///     "+(+ẏ͔ð͕̇-ẏ͕ð͔̇)e24",
    ///     "+(+ẏ͔ø͕̇-ẏ͕ø͔̇)e25",
    ///     "+(+ẏ͔þ͕̇-ẏ͕þ͔̇)e26",
    ///     "+(+ż͔ð͕̇-ż͕ð͔̇)e34",
    ///     "+(+ż͔ø͕̇-ż͕ø͔̇)e35",
    ///     "+(+ż͔þ͕̇-ż͕þ͔̇)e36",
    ///     "+(+ð͔̇ø͕̇-ð͕̇ø͔̇)e45",
    ///     "+(+ð͔̇þ͕̇-ð͕̇þ͔̇)e46",
    ///     "+(+ø͔̇þ͕̇-ø͕̇þ͔̇)e56",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_rotator() -> Self {
        Self::scalar() + Self::volume4_displacement()
    }
    /// The multivector of double rotator $`r_2 \equiv s + v^4_0 + p_0`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let double_rotator = Vee::single_rotator().lhs() * Vee::single_rotator().rhs();
    ///
    /// assert_eq!(double_rotator.basis_blades(), Vee::double_rotator().basis_blades());
    /// format_eq!(double_rotator, [
    ///     "+v͔v͕-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕",
    ///     "+(+v͔α͕+v͕α͔-β͔ζ͕+β͕ζ͔-γ͔η͕+γ͕η͔-δ͔θ͕+δ͕θ͔-ε͔ι͕+ε͕ι͔)e12",
    ///     "+(+v͔β͕+v͕β͔+α͔ζ͕-α͕ζ͔-γ͔κ͕+γ͕κ͔-δ͔λ͕+δ͕λ͔-ε͔μ͕+ε͕μ͔)e13",
    ///     "+(+v͔γ͕+v͕γ͔+α͔η͕-α͕η͔+β͔κ͕-β͕κ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔)e14",
    ///     "+(+v͔δ͕+v͕δ͔+α͔θ͕-α͕θ͔+β͔λ͕-β͕λ͔+γ͔ν͕-γ͕ν͔-ε͔ο͕+ε͕ο͔)e15",
    ///     "+(+v͔ε͕+v͕ε͔+α͔ι͕-α͕ι͔+β͔μ͕-β͕μ͔+γ͔ξ͕-γ͕ξ͔+δ͔ο͕-δ͕ο͔)e16",
    ///     "+(+v͔ζ͕+v͕ζ͔-α͔β͕+α͕β͔-η͔κ͕+η͕κ͔-θ͔λ͕+θ͕λ͔-ι͔μ͕+ι͕μ͔)e23",
    ///     "+(+v͔η͕+v͕η͔-α͔γ͕+α͕γ͔+ζ͔κ͕-ζ͕κ͔-θ͔ν͕+θ͕ν͔-ι͔ξ͕+ι͕ξ͔)e24",
    ///     "+(+v͔θ͕+v͕θ͔-α͔δ͕+α͕δ͔+ζ͔λ͕-ζ͕λ͔+η͔ν͕-η͕ν͔-ι͔ο͕+ι͕ο͔)e25",
    ///     "+(+v͔ι͕+v͕ι͔-α͔ε͕+α͕ε͔+ζ͔μ͕-ζ͕μ͔+η͔ξ͕-η͕ξ͔+θ͔ο͕-θ͕ο͔)e26",
    ///     "+(+v͔κ͕+v͕κ͔-β͔γ͕+β͕γ͔-ζ͔η͕+ζ͕η͔-λ͔ν͕+λ͕ν͔-μ͔ξ͕+μ͕ξ͔)e34",
    ///     "+(+v͔λ͕+v͕λ͔-β͔δ͕+β͕δ͔-ζ͔θ͕+ζ͕θ͔+κ͔ν͕-κ͕ν͔-μ͔ο͕+μ͕ο͔)e35",
    ///     "+(+v͔μ͕+v͕μ͔-β͔ε͕+β͕ε͔-ζ͔ι͕+ζ͕ι͔+κ͔ξ͕-κ͕ξ͔+λ͔ο͕-λ͕ο͔)e36",
    ///     "+(+v͔ν͕+v͕ν͔-γ͔δ͕+γ͕δ͔-η͔θ͕+η͕θ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔)e45",
    ///     "+(+v͔ξ͕+v͕ξ͔-γ͔ε͕+γ͕ε͔-η͔ι͕+η͕ι͔-κ͔μ͕+κ͕μ͔+ν͔ο͕-ν͕ο͔)e46",
    ///     "+(+v͔ο͕+v͕ο͔-δ͔ε͕+δ͕ε͔-θ͔ι͕+θ͕ι͔-λ͔μ͕+λ͕μ͔-ν͔ξ͕+ν͕ξ͔)e56",
    ///     "+(+κ͔ο͕+κ͕ο͔-λ͔ξ͕-λ͕ξ͔+μ͔ν͕+μ͕ν͔)e3456",
    ///     "+(-η͔ο͕-η͕ο͔+θ͔ξ͕+θ͕ξ͔-ι͔ν͕-ι͕ν͔)e2465",
    ///     "+(+ζ͔ο͕+ζ͕ο͔-θ͔μ͕-θ͕μ͔+ι͔λ͕+ι͕λ͔)e2356",
    ///     "+(-ζ͔ξ͕-ζ͕ξ͔+η͔μ͕+η͕μ͔-ι͔κ͕-ι͕κ͔)e2364",
    ///     "+(+ζ͔ν͕+ζ͕ν͔-η͔λ͕-η͕λ͔+θ͔κ͕+θ͕κ͔)e2345",
    ///     "+(+γ͔ο͕+γ͕ο͔-δ͔ξ͕-δ͕ξ͔+ε͔ν͕+ε͕ν͔)e1456",
    ///     "+(-β͔ο͕-β͕ο͔+δ͔μ͕+δ͕μ͔-ε͔λ͕-ε͕λ͔)e1365",
    ///     "+(+β͔ξ͕+β͕ξ͔-γ͔μ͕-γ͕μ͔+ε͔κ͕+ε͕κ͔)e1346",
    ///     "+(-β͔ν͕-β͕ν͔+γ͔λ͕+γ͕λ͔-δ͔κ͕-δ͕κ͔)e1354",
    ///     "+(+α͔ο͕+α͕ο͔-δ͔ι͕-δ͕ι͔+ε͔θ͕+ε͕θ͔)e1256",
    ///     "+(-α͔ξ͕-α͕ξ͔+γ͔ι͕+γ͕ι͔-ε͔η͕-ε͕η͔)e1264",
    ///     "+(+α͔ν͕+α͕ν͔-γ͔θ͕-γ͕θ͔+δ͔η͕+δ͕η͔)e1245",
    ///     "+(+α͔μ͕+α͕μ͔-β͔ι͕-β͕ι͔+ε͔ζ͕+ε͕ζ͔)e1236",
    ///     "+(-α͔λ͕-α͕λ͔+β͔θ͕+β͕θ͔-δ͔ζ͕-δ͕ζ͔)e1253",
    ///     "+(+α͔κ͕+α͕κ͔-β͔η͕-β͕η͔+γ͔ζ͕+γ͕ζ͔)e1234",
    /// ]);
    ///
    /// let double_rotator = Vee::volume4_displacement().lhs() * Vee::volume4_displacement().rhs();
    ///
    /// assert_eq!(double_rotator.basis_blades(), Vee::double_rotator().basis_blades());
    /// format_eq!(double_rotator, [
    ///     "-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕",
    ///     "+(-β͔ζ͕+β͕ζ͔-γ͔η͕+γ͕η͔-δ͔θ͕+δ͕θ͔-ε͔ι͕+ε͕ι͔)e12",
    ///     "+(+α͔ζ͕-α͕ζ͔-γ͔κ͕+γ͕κ͔-δ͔λ͕+δ͕λ͔-ε͔μ͕+ε͕μ͔)e13",
    ///     "+(+α͔η͕-α͕η͔+β͔κ͕-β͕κ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔)e14",
    ///     "+(+α͔θ͕-α͕θ͔+β͔λ͕-β͕λ͔+γ͔ν͕-γ͕ν͔-ε͔ο͕+ε͕ο͔)e15",
    ///     "+(+α͔ι͕-α͕ι͔+β͔μ͕-β͕μ͔+γ͔ξ͕-γ͕ξ͔+δ͔ο͕-δ͕ο͔)e16",
    ///     "+(-α͔β͕+α͕β͔-η͔κ͕+η͕κ͔-θ͔λ͕+θ͕λ͔-ι͔μ͕+ι͕μ͔)e23",
    ///     "+(-α͔γ͕+α͕γ͔+ζ͔κ͕-ζ͕κ͔-θ͔ν͕+θ͕ν͔-ι͔ξ͕+ι͕ξ͔)e24",
    ///     "+(-α͔δ͕+α͕δ͔+ζ͔λ͕-ζ͕λ͔+η͔ν͕-η͕ν͔-ι͔ο͕+ι͕ο͔)e25",
    ///     "+(-α͔ε͕+α͕ε͔+ζ͔μ͕-ζ͕μ͔+η͔ξ͕-η͕ξ͔+θ͔ο͕-θ͕ο͔)e26",
    ///     "+(-β͔γ͕+β͕γ͔-ζ͔η͕+ζ͕η͔-λ͔ν͕+λ͕ν͔-μ͔ξ͕+μ͕ξ͔)e34",
    ///     "+(-β͔δ͕+β͕δ͔-ζ͔θ͕+ζ͕θ͔+κ͔ν͕-κ͕ν͔-μ͔ο͕+μ͕ο͔)e35",
    ///     "+(-β͔ε͕+β͕ε͔-ζ͔ι͕+ζ͕ι͔+κ͔ξ͕-κ͕ξ͔+λ͔ο͕-λ͕ο͔)e36",
    ///     "+(-γ͔δ͕+γ͕δ͔-η͔θ͕+η͕θ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔)e45",
    ///     "+(-γ͔ε͕+γ͕ε͔-η͔ι͕+η͕ι͔-κ͔μ͕+κ͕μ͔+ν͔ο͕-ν͕ο͔)e46",
    ///     "+(-δ͔ε͕+δ͕ε͔-θ͔ι͕+θ͕ι͔-λ͔μ͕+λ͕μ͔-ν͔ξ͕+ν͕ξ͔)e56",
    ///     "+(+κ͔ο͕+κ͕ο͔-λ͔ξ͕-λ͕ξ͔+μ͔ν͕+μ͕ν͔)e3456",
    ///     "+(-η͔ο͕-η͕ο͔+θ͔ξ͕+θ͕ξ͔-ι͔ν͕-ι͕ν͔)e2465",
    ///     "+(+ζ͔ο͕+ζ͕ο͔-θ͔μ͕-θ͕μ͔+ι͔λ͕+ι͕λ͔)e2356",
    ///     "+(-ζ͔ξ͕-ζ͕ξ͔+η͔μ͕+η͕μ͔-ι͔κ͕-ι͕κ͔)e2364",
    ///     "+(+ζ͔ν͕+ζ͕ν͔-η͔λ͕-η͕λ͔+θ͔κ͕+θ͕κ͔)e2345",
    ///     "+(+γ͔ο͕+γ͕ο͔-δ͔ξ͕-δ͕ξ͔+ε͔ν͕+ε͕ν͔)e1456",
    ///     "+(-β͔ο͕-β͕ο͔+δ͔μ͕+δ͕μ͔-ε͔λ͕-ε͕λ͔)e1365",
    ///     "+(+β͔ξ͕+β͕ξ͔-γ͔μ͕-γ͕μ͔+ε͔κ͕+ε͕κ͔)e1346",
    ///     "+(-β͔ν͕-β͕ν͔+γ͔λ͕+γ͕λ͔-δ͔κ͕-δ͕κ͔)e1354",
    ///     "+(+α͔ο͕+α͕ο͔-δ͔ι͕-δ͕ι͔+ε͔θ͕+ε͕θ͔)e1256",
    ///     "+(-α͔ξ͕-α͕ξ͔+γ͔ι͕+γ͕ι͔-ε͔η͕-ε͕η͔)e1264",
    ///     "+(+α͔ν͕+α͕ν͔-γ͔θ͕-γ͕θ͔+δ͔η͕+δ͕η͔)e1245",
    ///     "+(+α͔μ͕+α͕μ͔-β͔ι͕-β͕ι͔+ε͔ζ͕+ε͕ζ͔)e1236",
    ///     "+(-α͔λ͕-α͕λ͔+β͔θ͕+β͕θ͔-δ͔ζ͕-δ͕ζ͔)e1253",
    ///     "+(+α͔κ͕+α͕κ͔-β͔η͕-β͕η͔+γ͔ζ͕+γ͕ζ͔)e1234",
    /// ]);
    ///
    /// let double_rotator = Vee::plane_displacement().lhs() * Vee::plane_displacement().rhs();
    ///
    /// assert_eq!(double_rotator.basis_blades(), Vee::double_rotator().basis_blades());
    /// format_eq!(double_rotator, [
    ///     "+α͔̇α͕̇+β͔̇β͕̇+γ͔̇γ͕̇+δ͔̇δ͕̇+ε͔̇ε͕̇+ζ͔̇ζ͕̇+η͔̇η͕̇+θ͔̇θ͕̇+ι͔̇ι͕̇+κ͔̇κ͕̇+λ͔̇λ͕̇+μ͔̇μ͕̇+ν͔̇ν͕̇+ξ͔̇ξ͕̇+ο͔̇ο͕̇",
    ///     "+(+β͔̇ζ͕̇-β͕̇ζ͔̇+γ͔̇η͕̇-γ͕̇η͔̇+δ͔̇θ͕̇-δ͕̇θ͔̇+ε͔̇ι͕̇-ε͕̇ι͔̇)e12",
    ///     "+(-α͔̇ζ͕̇+α͕̇ζ͔̇+γ͔̇κ͕̇-γ͕̇κ͔̇+δ͔̇λ͕̇-δ͕̇λ͔̇+ε͔̇μ͕̇-ε͕̇μ͔̇)e13",
    ///     "+(-α͔̇η͕̇+α͕̇η͔̇-β͔̇κ͕̇+β͕̇κ͔̇+δ͔̇ν͕̇-δ͕̇ν͔̇+ε͔̇ξ͕̇-ε͕̇ξ͔̇)e14",
    ///     "+(-α͔̇θ͕̇+α͕̇θ͔̇-β͔̇λ͕̇+β͕̇λ͔̇-γ͔̇ν͕̇+γ͕̇ν͔̇+ε͔̇ο͕̇-ε͕̇ο͔̇)e15",
    ///     "+(-α͔̇ι͕̇+α͕̇ι͔̇-β͔̇μ͕̇+β͕̇μ͔̇-γ͔̇ξ͕̇+γ͕̇ξ͔̇-δ͔̇ο͕̇+δ͕̇ο͔̇)e16",
    ///     "+(+α͔̇β͕̇-α͕̇β͔̇+η͔̇κ͕̇-η͕̇κ͔̇+θ͔̇λ͕̇-θ͕̇λ͔̇+ι͔̇μ͕̇-ι͕̇μ͔̇)e23",
    ///     "+(+α͔̇γ͕̇-α͕̇γ͔̇-ζ͔̇κ͕̇+ζ͕̇κ͔̇+θ͔̇ν͕̇-θ͕̇ν͔̇+ι͔̇ξ͕̇-ι͕̇ξ͔̇)e24",
    ///     "+(+α͔̇δ͕̇-α͕̇δ͔̇-ζ͔̇λ͕̇+ζ͕̇λ͔̇-η͔̇ν͕̇+η͕̇ν͔̇+ι͔̇ο͕̇-ι͕̇ο͔̇)e25",
    ///     "+(+α͔̇ε͕̇-α͕̇ε͔̇-ζ͔̇μ͕̇+ζ͕̇μ͔̇-η͔̇ξ͕̇+η͕̇ξ͔̇-θ͔̇ο͕̇+θ͕̇ο͔̇)e26",
    ///     "+(+β͔̇γ͕̇-β͕̇γ͔̇+ζ͔̇η͕̇-ζ͕̇η͔̇+λ͔̇ν͕̇-λ͕̇ν͔̇+μ͔̇ξ͕̇-μ͕̇ξ͔̇)e34",
    ///     "+(+β͔̇δ͕̇-β͕̇δ͔̇+ζ͔̇θ͕̇-ζ͕̇θ͔̇-κ͔̇ν͕̇+κ͕̇ν͔̇+μ͔̇ο͕̇-μ͕̇ο͔̇)e35",
    ///     "+(+β͔̇ε͕̇-β͕̇ε͔̇+ζ͔̇ι͕̇-ζ͕̇ι͔̇-κ͔̇ξ͕̇+κ͕̇ξ͔̇-λ͔̇ο͕̇+λ͕̇ο͔̇)e36",
    ///     "+(+γ͔̇δ͕̇-γ͕̇δ͔̇+η͔̇θ͕̇-η͕̇θ͔̇+κ͔̇λ͕̇-κ͕̇λ͔̇+ξ͔̇ο͕̇-ξ͕̇ο͔̇)e45",
    ///     "+(+γ͔̇ε͕̇-γ͕̇ε͔̇+η͔̇ι͕̇-η͕̇ι͔̇+κ͔̇μ͕̇-κ͕̇μ͔̇-ν͔̇ο͕̇+ν͕̇ο͔̇)e46",
    ///     "+(+δ͔̇ε͕̇-δ͕̇ε͔̇+θ͔̇ι͕̇-θ͕̇ι͔̇+λ͔̇μ͕̇-λ͕̇μ͔̇+ν͔̇ξ͕̇-ν͕̇ξ͔̇)e56",
    ///     "+(-κ͔̇ο͕̇-κ͕̇ο͔̇+λ͔̇ξ͕̇+λ͕̇ξ͔̇-μ͔̇ν͕̇-μ͕̇ν͔̇)e3456",
    ///     "+(+η͔̇ο͕̇+η͕̇ο͔̇-θ͔̇ξ͕̇-θ͕̇ξ͔̇+ι͔̇ν͕̇+ι͕̇ν͔̇)e2465",
    ///     "+(-ζ͔̇ο͕̇-ζ͕̇ο͔̇+θ͔̇μ͕̇+θ͕̇μ͔̇-ι͔̇λ͕̇-ι͕̇λ͔̇)e2356",
    ///     "+(+ζ͔̇ξ͕̇+ζ͕̇ξ͔̇-η͔̇μ͕̇-η͕̇μ͔̇+ι͔̇κ͕̇+ι͕̇κ͔̇)e2364",
    ///     "+(-ζ͔̇ν͕̇-ζ͕̇ν͔̇+η͔̇λ͕̇+η͕̇λ͔̇-θ͔̇κ͕̇-θ͕̇κ͔̇)e2345",
    ///     "+(-γ͔̇ο͕̇-γ͕̇ο͔̇+δ͔̇ξ͕̇+δ͕̇ξ͔̇-ε͔̇ν͕̇-ε͕̇ν͔̇)e1456",
    ///     "+(+β͔̇ο͕̇+β͕̇ο͔̇-δ͔̇μ͕̇-δ͕̇μ͔̇+ε͔̇λ͕̇+ε͕̇λ͔̇)e1365",
    ///     "+(-β͔̇ξ͕̇-β͕̇ξ͔̇+γ͔̇μ͕̇+γ͕̇μ͔̇-ε͔̇κ͕̇-ε͕̇κ͔̇)e1346",
    ///     "+(+β͔̇ν͕̇+β͕̇ν͔̇-γ͔̇λ͕̇-γ͕̇λ͔̇+δ͔̇κ͕̇+δ͕̇κ͔̇)e1354",
    ///     "+(-α͔̇ο͕̇-α͕̇ο͔̇+δ͔̇ι͕̇+δ͕̇ι͔̇-ε͔̇θ͕̇-ε͕̇θ͔̇)e1256",
    ///     "+(+α͔̇ξ͕̇+α͕̇ξ͔̇-γ͔̇ι͕̇-γ͕̇ι͔̇+ε͔̇η͕̇+ε͕̇η͔̇)e1264",
    ///     "+(-α͔̇ν͕̇-α͕̇ν͔̇+γ͔̇θ͕̇+γ͕̇θ͔̇-δ͔̇η͕̇-δ͕̇η͔̇)e1245",
    ///     "+(-α͔̇μ͕̇-α͕̇μ͔̇+β͔̇ι͕̇+β͕̇ι͔̇-ε͔̇ζ͕̇-ε͕̇ζ͔̇)e1236",
    ///     "+(+α͔̇λ͕̇+α͕̇λ͔̇-β͔̇θ͕̇-β͕̇θ͔̇+δ͔̇ζ͕̇+δ͕̇ζ͔̇)e1253",
    ///     "+(-α͔̇κ͕̇-α͕̇κ͔̇+β͔̇η͕̇+β͕̇η͔̇-γ͔̇ζ͕̇-γ͕̇ζ͔̇)e1234",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_rotator() -> Self {
        Self::scalar() + Self::volume4_displacement() + Self::plane_displacement()
    }
    /// The multivector of triple rotator $`r_3 \equiv s + v^4_0 + p_0 + P_0`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let triple_rotator = Vee::single_rotator().lhs() * Vee::double_rotator().rhs();
    ///
    /// assert_eq!(triple_rotator.basis_blades(), Vee::triple_rotator().basis_blades());
    /// format_eq!(triple_rotator, [
    ///     "+v͔v͕-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕",
    ///     "+(+v͔α͕+v͕α͔-β͔ζ͕+β͕ζ͔-γ͔η͕+γ͕η͔-δ͔θ͕+δ͕θ͔-ε͔ι͕+ε͕ι͔-κ͔ο͕̇-κ͕̇ο͔+λ͔ξ͕̇+λ͕̇ξ͔-μ͔ν͕̇-μ͕̇ν͔)e12",
    ///     "+(+v͔β͕+v͕β͔+α͔ζ͕-α͕ζ͔-γ͔κ͕+γ͕κ͔-δ͔λ͕+δ͕λ͔-ε͔μ͕+ε͕μ͔+η͔ο͕̇+η͕̇ο͔-θ͔ξ͕̇-θ͕̇ξ͔+ι͔ν͕̇+ι͕̇ν͔)e13",
    ///     "+(+v͔γ͕+v͕γ͔+α͔η͕-α͕η͔+β͔κ͕-β͕κ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔-ζ͔ο͕̇-ζ͕̇ο͔+θ͔μ͕̇+θ͕̇μ͔-ι͔λ͕̇-ι͕̇λ͔)e14",
    ///     "+(+v͔δ͕+v͕δ͔+α͔θ͕-α͕θ͔+β͔λ͕-β͕λ͔+γ͔ν͕-γ͕ν͔-ε͔ο͕+ε͕ο͔+ζ͔ξ͕̇+ζ͕̇ξ͔-η͔μ͕̇-η͕̇μ͔+ι͔κ͕̇+ι͕̇κ͔)e15",
    ///     "+(+v͔ε͕+v͕ε͔+α͔ι͕-α͕ι͔+β͔μ͕-β͕μ͔+γ͔ξ͕-γ͕ξ͔+δ͔ο͕-δ͕ο͔-ζ͔ν͕̇-ζ͕̇ν͔+η͔λ͕̇+η͕̇λ͔-θ͔κ͕̇-θ͕̇κ͔)e16",
    ///     "+(+v͔ζ͕+v͕ζ͔-α͔β͕+α͕β͔-γ͔ο͕̇-γ͕̇ο͔+δ͔ξ͕̇+δ͕̇ξ͔-ε͔ν͕̇-ε͕̇ν͔-η͔κ͕+η͕κ͔-θ͔λ͕+θ͕λ͔-ι͔μ͕+ι͕μ͔)e23",
    ///     "+(+v͔η͕+v͕η͔-α͔γ͕+α͕γ͔+β͔ο͕̇+β͕̇ο͔-δ͔μ͕̇-δ͕̇μ͔+ε͔λ͕̇+ε͕̇λ͔+ζ͔κ͕-ζ͕κ͔-θ͔ν͕+θ͕ν͔-ι͔ξ͕+ι͕ξ͔)e24",
    ///     "+(+v͔θ͕+v͕θ͔-α͔δ͕+α͕δ͔-β͔ξ͕̇-β͕̇ξ͔+γ͔μ͕̇+γ͕̇μ͔-ε͔κ͕̇-ε͕̇κ͔+ζ͔λ͕-ζ͕λ͔+η͔ν͕-η͕ν͔-ι͔ο͕+ι͕ο͔)e25",
    ///     "+(+v͔ι͕+v͕ι͔-α͔ε͕+α͕ε͔+β͔ν͕̇+β͕̇ν͔-γ͔λ͕̇-γ͕̇λ͔+δ͔κ͕̇+δ͕̇κ͔+ζ͔μ͕-ζ͕μ͔+η͔ξ͕-η͕ξ͔+θ͔ο͕-θ͕ο͔)e26",
    ///     "+(+v͔κ͕+v͕κ͔-α͔ο͕̇-α͕̇ο͔-β͔γ͕+β͕γ͔+δ͔ι͕̇+δ͕̇ι͔-ε͔θ͕̇-ε͕̇θ͔-ζ͔η͕+ζ͕η͔-λ͔ν͕+λ͕ν͔-μ͔ξ͕+μ͕ξ͔)e34",
    ///     "+(+v͔λ͕+v͕λ͔+α͔ξ͕̇+α͕̇ξ͔-β͔δ͕+β͕δ͔-γ͔ι͕̇-γ͕̇ι͔+ε͔η͕̇+ε͕̇η͔-ζ͔θ͕+ζ͕θ͔+κ͔ν͕-κ͕ν͔-μ͔ο͕+μ͕ο͔)e35",
    ///     "+(+v͔μ͕+v͕μ͔-α͔ν͕̇-α͕̇ν͔-β͔ε͕+β͕ε͔+γ͔θ͕̇+γ͕̇θ͔-δ͔η͕̇-δ͕̇η͔-ζ͔ι͕+ζ͕ι͔+κ͔ξ͕-κ͕ξ͔+λ͔ο͕-λ͕ο͔)e36",
    ///     "+(+v͔ν͕+v͕ν͔-α͔μ͕̇-α͕̇μ͔+β͔ι͕̇+β͕̇ι͔-γ͔δ͕+γ͕δ͔-ε͔ζ͕̇-ε͕̇ζ͔-η͔θ͕+η͕θ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔)e45",
    ///     "+(+v͔ξ͕+v͕ξ͔+α͔λ͕̇+α͕̇λ͔-β͔θ͕̇-β͕̇θ͔-γ͔ε͕+γ͕ε͔+δ͔ζ͕̇+δ͕̇ζ͔-η͔ι͕+η͕ι͔-κ͔μ͕+κ͕μ͔+ν͔ο͕-ν͕ο͔)e46",
    ///     "+(+v͔ο͕+v͕ο͔-α͔κ͕̇-α͕̇κ͔+β͔η͕̇+β͕̇η͔-γ͔ζ͕̇-γ͕̇ζ͔-δ͔ε͕+δ͕ε͔-θ͔ι͕+θ͕ι͔-λ͔μ͕+λ͕μ͔-ν͔ξ͕+ν͕ξ͔)e56",
    ///     "+(+v͔α͕̇-β͔ζ͕̇+β͕̇ζ͔-γ͔η͕̇+γ͕̇η͔-δ͔θ͕̇+δ͕̇θ͔-ε͔ι͕̇+ε͕̇ι͔+κ͔ο͕+κ͕ο͔-λ͔ξ͕-λ͕ξ͔+μ͔ν͕+μ͕ν͔)e3456",
    ///     "+(+v͔β͕̇+α͔ζ͕̇-α͕̇ζ͔-γ͔κ͕̇+γ͕̇κ͔-δ͔λ͕̇+δ͕̇λ͔-ε͔μ͕̇+ε͕̇μ͔-η͔ο͕-η͕ο͔+θ͔ξ͕+θ͕ξ͔-ι͔ν͕-ι͕ν͔)e2465",
    ///     "+(+v͔γ͕̇+α͔η͕̇-α͕̇η͔+β͔κ͕̇-β͕̇κ͔-δ͔ν͕̇+δ͕̇ν͔-ε͔ξ͕̇+ε͕̇ξ͔+ζ͔ο͕+ζ͕ο͔-θ͔μ͕-θ͕μ͔+ι͔λ͕+ι͕λ͔)e2356",
    ///     "+(+v͔δ͕̇+α͔θ͕̇-α͕̇θ͔+β͔λ͕̇-β͕̇λ͔+γ͔ν͕̇-γ͕̇ν͔-ε͔ο͕̇+ε͕̇ο͔-ζ͔ξ͕-ζ͕ξ͔+η͔μ͕+η͕μ͔-ι͔κ͕-ι͕κ͔)e2364",
    ///     "+(+v͔ε͕̇+α͔ι͕̇-α͕̇ι͔+β͔μ͕̇-β͕̇μ͔+γ͔ξ͕̇-γ͕̇ξ͔+δ͔ο͕̇-δ͕̇ο͔+ζ͔ν͕+ζ͕ν͔-η͔λ͕-η͕λ͔+θ͔κ͕+θ͕κ͔)e2345",
    ///     "+(+v͔ζ͕̇-α͔β͕̇+α͕̇β͔+γ͔ο͕+γ͕ο͔-δ͔ξ͕-δ͕ξ͔+ε͔ν͕+ε͕ν͔-η͔κ͕̇+η͕̇κ͔-θ͔λ͕̇+θ͕̇λ͔-ι͔μ͕̇+ι͕̇μ͔)e1456",
    ///     "+(+v͔η͕̇-α͔γ͕̇+α͕̇γ͔-β͔ο͕-β͕ο͔+δ͔μ͕+δ͕μ͔-ε͔λ͕-ε͕λ͔+ζ͔κ͕̇-ζ͕̇κ͔-θ͔ν͕̇+θ͕̇ν͔-ι͔ξ͕̇+ι͕̇ξ͔)e1365",
    ///     "+(+v͔θ͕̇-α͔δ͕̇+α͕̇δ͔+β͔ξ͕+β͕ξ͔-γ͔μ͕-γ͕μ͔+ε͔κ͕+ε͕κ͔+ζ͔λ͕̇-ζ͕̇λ͔+η͔ν͕̇-η͕̇ν͔-ι͔ο͕̇+ι͕̇ο͔)e1346",
    ///     "+(+v͔ι͕̇-α͔ε͕̇+α͕̇ε͔-β͔ν͕-β͕ν͔+γ͔λ͕+γ͕λ͔-δ͔κ͕-δ͕κ͔+ζ͔μ͕̇-ζ͕̇μ͔+η͔ξ͕̇-η͕̇ξ͔+θ͔ο͕̇-θ͕̇ο͔)e1354",
    ///     "+(+v͔κ͕̇+α͔ο͕+α͕ο͔-β͔γ͕̇+β͕̇γ͔-δ͔ι͕-δ͕ι͔+ε͔θ͕+ε͕θ͔-ζ͔η͕̇+ζ͕̇η͔-λ͔ν͕̇+λ͕̇ν͔-μ͔ξ͕̇+μ͕̇ξ͔)e1256",
    ///     "+(+v͔λ͕̇-α͔ξ͕-α͕ξ͔-β͔δ͕̇+β͕̇δ͔+γ͔ι͕+γ͕ι͔-ε͔η͕-ε͕η͔-ζ͔θ͕̇+ζ͕̇θ͔+κ͔ν͕̇-κ͕̇ν͔-μ͔ο͕̇+μ͕̇ο͔)e1264",
    ///     "+(+v͔μ͕̇+α͔ν͕+α͕ν͔-β͔ε͕̇+β͕̇ε͔-γ͔θ͕-γ͕θ͔+δ͔η͕+δ͕η͔-ζ͔ι͕̇+ζ͕̇ι͔+κ͔ξ͕̇-κ͕̇ξ͔+λ͔ο͕̇-λ͕̇ο͔)e1245",
    ///     "+(+v͔ν͕̇+α͔μ͕+α͕μ͔-β͔ι͕-β͕ι͔-γ͔δ͕̇+γ͕̇δ͔+ε͔ζ͕+ε͕ζ͔-η͔θ͕̇+η͕̇θ͔-κ͔λ͕̇+κ͕̇λ͔-ξ͔ο͕̇+ξ͕̇ο͔)e1236",
    ///     "+(+v͔ξ͕̇-α͔λ͕-α͕λ͔+β͔θ͕+β͕θ͔-γ͔ε͕̇+γ͕̇ε͔-δ͔ζ͕-δ͕ζ͔-η͔ι͕̇+η͕̇ι͔-κ͔μ͕̇+κ͕̇μ͔+ν͔ο͕̇-ν͕̇ο͔)e1253",
    ///     "+(+v͔ο͕̇+α͔κ͕+α͕κ͔-β͔η͕-β͕η͔+γ͔ζ͕+γ͕ζ͔-δ͔ε͕̇+δ͕̇ε͔-θ͔ι͕̇+θ͕̇ι͔-λ͔μ͕̇+λ͕̇μ͔-ν͔ξ͕̇+ν͕̇ξ͔)e1234",
    ///     "+(+α͔α͕̇+β͔β͕̇+γ͔γ͕̇+δ͔δ͕̇+ε͔ε͕̇+ζ͔ζ͕̇+η͔η͕̇+θ͔θ͕̇+ι͔ι͕̇+κ͔κ͕̇+λ͔λ͕̇+μ͔μ͕̇+ν͔ν͕̇+ξ͔ξ͕̇+ο͔ο͕̇)e123456",
    /// ]);
    ///
    /// let triple_rotator = Vee::volume_displacement().lhs() * Vee::volume_displacement().rhs();
    ///
    /// assert_eq!(triple_rotator.basis_blades(), Vee::triple_rotator().basis_blades());
    /// format_eq!(triple_rotator, [
    ///     "-a͔a͕-b͔b͕-c͔c͕-d͔d͕-e͔e͕-f͔f͕-g͔g͕-h͔h͕-i͔i͕-j͔j͕-k͔k͕-l͔l͕-m͔m͕-n͔n͕-o͔o͕-p͔p͕-q͔q͕-r͔r͕-s͔s͕-t͔t͕",
    ///     "+(-e͔k͕+e͕k͔-f͔l͕+f͕l͔-g͔m͕+g͕m͔-h͔n͕+h͕n͔-i͔o͕+i͕o͔-j͔p͕+j͕p͔)e12",
    ///     "+(+b͔k͕-b͕k͔+c͔l͕-c͕l͔+d͔m͕-d͕m͔-h͔q͕+h͕q͔-i͔r͕+i͕r͔-j͔s͕+j͕s͔)e13",
    ///     "+(-a͔k͕+a͕k͔+c͔n͕-c͕n͔+d͔o͕-d͕o͔+f͔q͕-f͕q͔+g͔r͕-g͕r͔-j͔t͕+j͕t͔)e14",
    ///     "+(-a͔l͕+a͕l͔-b͔n͕+b͕n͔+d͔p͕-d͕p͔-e͔q͕+e͕q͔+g͔s͕-g͕s͔+i͔t͕-i͕t͔)e15",
    ///     "+(-a͔m͕+a͕m͔-b͔o͕+b͕o͔-c͔p͕+c͕p͔-e͔r͕+e͕r͔-f͔s͕+f͕s͔-h͔t͕+h͕t͔)e16",
    ///     "+(-b͔e͕+b͕e͔-c͔f͕+c͕f͔-d͔g͕+d͕g͔-n͔q͕+n͕q͔-o͔r͕+o͕r͔-p͔s͕+p͕s͔)e23",
    ///     "+(+a͔e͕-a͕e͔-c͔h͕+c͕h͔-d͔i͕+d͕i͔+l͔q͕-l͕q͔+m͔r͕-m͕r͔-p͔t͕+p͕t͔)e24",
    ///     "+(+a͔f͕-a͕f͔+b͔h͕-b͕h͔-d͔j͕+d͕j͔-k͔q͕+k͕q͔+m͔s͕-m͕s͔+o͔t͕-o͕t͔)e25",
    ///     "+(+a͔g͕-a͕g͔+b͔i͕-b͕i͔+c͔j͕-c͕j͔-k͔r͕+k͕r͔-l͔s͕+l͕s͔-n͔t͕+n͕t͔)e26",
    ///     "+(-a͔b͕+a͕b͔-f͔h͕+f͕h͔-g͔i͕+g͕i͔-l͔n͕+l͕n͔-m͔o͕+m͕o͔-s͔t͕+s͕t͔)e34",
    ///     "+(-a͔c͕+a͕c͔+e͔h͕-e͕h͔-g͔j͕+g͕j͔+k͔n͕-k͕n͔-m͔p͕+m͕p͔+r͔t͕-r͕t͔)e35",
    ///     "+(-a͔d͕+a͕d͔+e͔i͕-e͕i͔+f͔j͕-f͕j͔+k͔o͕-k͕o͔+l͔p͕-l͕p͔-q͔t͕+q͕t͔)e36",
    ///     "+(-b͔c͕+b͕c͔-e͔f͕+e͕f͔-i͔j͕+i͕j͔-k͔l͕+k͕l͔-o͔p͕+o͕p͔-r͔s͕+r͕s͔)e45",
    ///     "+(-b͔d͕+b͕d͔-e͔g͕+e͕g͔+h͔j͕-h͕j͔-k͔m͕+k͕m͔+n͔p͕-n͕p͔+q͔s͕-q͕s͔)e46",
    ///     "+(-c͔d͕+c͕d͔-f͔g͕+f͕g͔-h͔i͕+h͕i͔-l͔m͕+l͕m͔-n͔o͕+n͕o͔-q͔r͕+q͕r͔)e56",
    ///     "+(+e͔j͕+e͕j͔-f͔i͕-f͕i͔+g͔h͕+g͕h͔+k͔p͕+k͕p͔-l͔o͕-l͕o͔+m͔n͕+m͕n͔)e3456",
    ///     "+(-b͔j͕-b͕j͔+c͔i͕+c͕i͔-d͔h͕-d͕h͔+k͔s͕+k͕s͔-l͔r͕-l͕r͔+m͔q͕+m͕q͔)e2465",
    ///     "+(+a͔j͕+a͕j͔-c͔g͕-c͕g͔+d͔f͕+d͕f͔+k͔t͕+k͕t͔-n͔r͕-n͕r͔+o͔q͕+o͕q͔)e2356",
    ///     "+(-a͔i͕-a͕i͔+b͔g͕+b͕g͔-d͔e͕-d͕e͔+l͔t͕+l͕t͔-n͔s͕-n͕s͔+p͔q͕+p͕q͔)e2364",
    ///     "+(+a͔h͕+a͕h͔-b͔f͕-b͕f͔+c͔e͕+c͕e͔+m͔t͕+m͕t͔-o͔s͕-o͕s͔+p͔r͕+p͕r͔)e2345",
    ///     "+(-b͔p͕-b͕p͔+c͔o͕+c͕o͔-d͔n͕-d͕n͔-e͔s͕-e͕s͔+f͔r͕+f͕r͔-g͔q͕-g͕q͔)e1456",
    ///     "+(+a͔p͕+a͕p͔-c͔m͕-c͕m͔+d͔l͕+d͕l͔-e͔t͕-e͕t͔+h͔r͕+h͕r͔-i͔q͕-i͕q͔)e1365",
    ///     "+(-a͔o͕-a͕o͔+b͔m͕+b͕m͔-d͔k͕-d͕k͔-f͔t͕-f͕t͔+h͔s͕+h͕s͔-j͔q͕-j͕q͔)e1346",
    ///     "+(+a͔n͕+a͕n͔-b͔l͕-b͕l͔+c͔k͕+c͕k͔-g͔t͕-g͕t͔+i͔s͕+i͕s͔-j͔r͕-j͕r͔)e1354",
    ///     "+(+a͔s͕+a͕s͔+b͔t͕+b͕t͔-f͔m͕-f͕m͔+g͔l͕+g͕l͔-h͔o͕-h͕o͔+i͔n͕+i͕n͔)e1256",
    ///     "+(-a͔r͕-a͕r͔+c͔t͕+c͕t͔+e͔m͕+e͕m͔-g͔k͕-g͕k͔-h͔p͕-h͕p͔+j͔n͕+j͕n͔)e1264",
    ///     "+(+a͔q͕+a͕q͔+d͔t͕+d͕t͔-e͔l͕-e͕l͔+f͔k͕+f͕k͔-i͔p͕-i͕p͔+j͔o͕+j͕o͔)e1245",
    ///     "+(-b͔r͕-b͕r͔-c͔s͕-c͕s͔+e͔o͕+e͕o͔+f͔p͕+f͕p͔-i͔k͕-i͕k͔-j͔l͕-j͕l͔)e1236",
    ///     "+(+b͔q͕+b͕q͔-d͔s͕-d͕s͔-e͔n͕-e͕n͔+g͔p͕+g͕p͔+h͔k͕+h͕k͔-j͔m͕-j͕m͔)e1253",
    ///     "+(+c͔q͕+c͕q͔+d͔r͕+d͕r͔-f͔n͕-f͕n͔-g͔o͕-g͕o͔+h͔l͕+h͕l͔+i͔m͕+i͕m͔)e1234",
    ///     "+(+a͔t͕-a͕t͔-b͔s͕+b͕s͔+c͔r͕-c͕r͔-d͔q͕+d͕q͔+e͔p͕-e͕p͔-f͔o͕+f͕o͔+g͔n͕-g͕n͔+h͔m͕-h͕m͔-i͔l͕+i͕l͔+j͔k͕-j͕k͔)e123456",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn triple_rotator() -> Self {
        Self::scalar() + Self::volume4_displacement() + Self::plane_displacement() + Self::weight()
    }
    /// The multivector of translator $`t \equiv s + v^4_\infty`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let translator = Vee::point().lhs() * Vee::point().rhs();
    ///
    /// assert_eq!(translator.basis_blades(), Vee::translator().basis_blades());
    /// format_eq!(translator, [
    ///     "-ẇ͔ẇ͕",
    ///     "+(+Ẋ͔ẇ͕-Ẋ͕ẇ͔)e01",
    ///     "+(+Ẏ͔ẇ͕-Ẏ͕ẇ͔)e02",
    ///     "+(+Ż͔ẇ͕-Ż͕ẇ͔)e03",
    ///     "+(-ẇ͔Ð͕̇+ẇ͕Ð͔̇)e04",
    ///     "+(-ẇ͔Ø͕̇+ẇ͕Ø͔̇)e05",
    ///     "+(-ẇ͔Þ͕̇+ẇ͕Þ͔̇)e06",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn translator() -> Self {
        Self::scalar() + Self::volume4_moment()
    }
    /// The multivector of single motor $`m_1 \equiv s + v^4`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let single_motor = Vee::single_rotator().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(single_motor.basis_blades(),
    ///     (Vee::single_motor() + Vee::plane_moment()).basis_blades());
    /// format_eq!(single_motor, [
    ///     "+v͔v͕",
    ///     "+(+X͕v͔+Y͕α͔+Z͕β͔+Ð͕γ͔+Ø͕δ͔+Þ͕ε͔)e01",
    ///     "+(-X͕α͔+Y͕v͔+Z͕ζ͔+Ð͕η͔+Ø͕θ͔+Þ͕ι͔)e02",
    ///     "+(-X͕β͔-Y͕ζ͔+Z͕v͔+Ð͕κ͔+Ø͕λ͔+Þ͕μ͔)e03",
    ///     "+(-X͕γ͔-Y͕η͔-Z͕κ͔+v͔Ð͕+Ø͕ν͔+Þ͕ξ͔)e04",
    ///     "+(-X͕δ͔-Y͕θ͔-Z͕λ͔+v͔Ø͕-Ð͕ν͔+Þ͕ο͔)e05",
    ///     "+(-X͕ε͔-Y͕ι͔-Z͕μ͔+v͔Þ͕-Ð͕ξ͔-Ø͕ο͔)e06",
    ///     "+v͕α͔e12",
    ///     "+v͕β͔e13",
    ///     "+v͕γ͔e14",
    ///     "+v͕δ͔e15",
    ///     "+v͕ε͔e16",
    ///     "+v͕ζ͔e23",
    ///     "+v͕η͔e24",
    ///     "+v͕θ͔e25",
    ///     "+v͕ι͔e26",
    ///     "+v͕κ͔e34",
    ///     "+v͕λ͔e35",
    ///     "+v͕μ͔e36",
    ///     "+v͕ν͔e45",
    ///     "+v͕ξ͔e46",
    ///     "+v͕ο͔e56",
    ///     // Additional orthogonality condition besides `norm_squared` condition:
    ///     "+(-Ð͕ο͔+Ø͕ξ͔-Þ͕ν͔)e0465",
    ///     "+(+Z͕ο͔-Ø͕μ͔+Þ͕λ͔)e0356",
    ///     "+(-Z͕ξ͔+Ð͕μ͔-Þ͕κ͔)e0364",
    ///     "+(+Z͕ν͔-Ð͕λ͔+Ø͕κ͔)e0345",
    ///     "+(-Y͕ο͔+Ø͕ι͔-Þ͕θ͔)e0265",
    ///     "+(+Y͕ξ͔-Ð͕ι͔+Þ͕η͔)e0246",
    ///     "+(-Y͕ν͔+Ð͕θ͔-Ø͕η͔)e0254",
    ///     "+(-Y͕μ͔+Z͕ι͔-Þ͕ζ͔)e0263",
    ///     "+(+Y͕λ͔-Z͕θ͔+Ø͕ζ͔)e0235",
    ///     "+(-Y͕κ͔+Z͕η͔-Ð͕ζ͔)e0243",
    ///     "+(+X͕ο͔-Ø͕ε͔+Þ͕δ͔)e0156",
    ///     "+(-X͕ξ͔+Ð͕ε͔-Þ͕γ͔)e0164",
    ///     "+(+X͕ν͔-Ð͕δ͔+Ø͕γ͔)e0145",
    ///     "+(+X͕μ͔-Z͕ε͔+Þ͕β͔)e0136",
    ///     "+(-X͕λ͔+Z͕δ͔-Ø͕β͔)e0153",
    ///     "+(+X͕κ͔-Z͕γ͔+Ð͕β͔)e0134",
    ///     "+(-X͕ι͔+Y͕ε͔-Þ͕α͔)e0162",
    ///     "+(+X͕θ͔-Y͕δ͔+Ø͕α͔)e0125",
    ///     "+(-X͕η͔+Y͕γ͔-Ð͕α͔)e0142",
    ///     "+(+X͕ζ͔-Y͕β͔+Z͕α͔)e0123",
    /// ]);
    ///
    /// // Orthogonality condition between single rotator and translator bivectors. Without this
    /// // condition, it is a double motor for arbitrary choices of single rotator and translator.
    /// format_eq!(Vee::single_rotator().vector(2).lhs() ^ Vee::translator().vector(2).rhs(), [
    ///     "+(-Ð͕ο͔+Ø͕ξ͔-Þ͕ν͔)e0465",
    ///     "+(+Z͕ο͔-Ø͕μ͔+Þ͕λ͔)e0356",
    ///     "+(-Z͕ξ͔+Ð͕μ͔-Þ͕κ͔)e0364",
    ///     "+(+Z͕ν͔-Ð͕λ͔+Ø͕κ͔)e0345",
    ///     "+(-Y͕ο͔+Ø͕ι͔-Þ͕θ͔)e0265",
    ///     "+(+Y͕ξ͔-Ð͕ι͔+Þ͕η͔)e0246",
    ///     "+(-Y͕ν͔+Ð͕θ͔-Ø͕η͔)e0254",
    ///     "+(-Y͕μ͔+Z͕ι͔-Þ͕ζ͔)e0263",
    ///     "+(+Y͕λ͔-Z͕θ͔+Ø͕ζ͔)e0235",
    ///     "+(-Y͕κ͔+Z͕η͔-Ð͕ζ͔)e0243",
    ///     "+(+X͕ο͔-Ø͕ε͔+Þ͕δ͔)e0156",
    ///     "+(-X͕ξ͔+Ð͕ε͔-Þ͕γ͔)e0164",
    ///     "+(+X͕ν͔-Ð͕δ͔+Ø͕γ͔)e0145",
    ///     "+(+X͕μ͔-Z͕ε͔+Þ͕β͔)e0136",
    ///     "+(-X͕λ͔+Z͕δ͔-Ø͕β͔)e0153",
    ///     "+(+X͕κ͔-Z͕γ͔+Ð͕β͔)e0134",
    ///     "+(-X͕ι͔+Y͕ε͔-Þ͕α͔)e0162",
    ///     "+(+X͕θ͔-Y͕δ͔+Ø͕α͔)e0125",
    ///     "+(-X͕η͔+Y͕γ͔-Ð͕α͔)e0142",
    ///     "+(+X͕ζ͔-Y͕β͔+Z͕α͔)e0123",
    /// ]);
    ///
    /// let norm_squared = single_motor.norm_squared();
    ///
    /// assert_eq!(norm_squared.basis_blades(),
    ///     (Vee::scalar() + Vee::plane_displacement()).basis_blades());
    /// format_eq!(norm_squared, [
    ///     "+v͔v͔v͕v͕+v͕v͕α͔α͔+v͕v͕β͔β͔+v͕v͕γ͔γ͔+v͕v͕δ͔δ͔+v͕v͕ε͔ε͔+v͕v͕ζ͔ζ͔+v͕v͕η͔η͔+v͕v͕θ͔θ͔+v͕v͕ι͔ι͔+v͕v͕κ͔κ͔+v͕v͕λ͔λ͔+v͕v͕μ͔μ͔+v͕v͕ν͔ν͔+v͕v͕ξ͔ξ͔+v͕v͕ο͔ο͔",
    ///     // Orthogonality condition:
    ///     "+2(-v͕v͕κ͔ο͔+v͕v͕λ͔ξ͔-v͕v͕μ͔ν͔)e3456",
    ///     "+2(+v͕v͕η͔ο͔-v͕v͕θ͔ξ͔+v͕v͕ι͔ν͔)e2465",
    ///     "+2(-v͕v͕ζ͔ο͔+v͕v͕θ͔μ͔-v͕v͕ι͔λ͔)e2356",
    ///     "+2(+v͕v͕ζ͔ξ͔-v͕v͕η͔μ͔+v͕v͕ι͔κ͔)e2364",
    ///     "+2(-v͕v͕ζ͔ν͔+v͕v͕η͔λ͔-v͕v͕θ͔κ͔)e2345",
    ///     "+2(-v͕v͕γ͔ο͔+v͕v͕δ͔ξ͔-v͕v͕ε͔ν͔)e1456",
    ///     "+2(+v͕v͕β͔ο͔-v͕v͕δ͔μ͔+v͕v͕ε͔λ͔)e1365",
    ///     "+2(-v͕v͕β͔ξ͔+v͕v͕γ͔μ͔-v͕v͕ε͔κ͔)e1346",
    ///     "+2(+v͕v͕β͔ν͔-v͕v͕γ͔λ͔+v͕v͕δ͔κ͔)e1354",
    ///     "+2(-v͕v͕α͔ο͔+v͕v͕δ͔ι͔-v͕v͕ε͔θ͔)e1256",
    ///     "+2(+v͕v͕α͔ξ͔-v͕v͕γ͔ι͔+v͕v͕ε͔η͔)e1264",
    ///     "+2(-v͕v͕α͔ν͔+v͕v͕γ͔θ͔-v͕v͕δ͔η͔)e1245",
    ///     "+2(-v͕v͕α͔μ͔+v͕v͕β͔ι͔-v͕v͕ε͔ζ͔)e1236",
    ///     "+2(+v͕v͕α͔λ͔-v͕v͕β͔θ͔+v͕v͕δ͔ζ͔)e1253",
    ///     "+2(-v͕v͕α͔κ͔+v͕v͕β͔η͔-v͕v͕γ͔ζ͔)e1234",
    /// ]);
    ///
    /// let single_motor = Vee::volume5().lhs() * Vee::volume5().rhs();
    /// assert_eq!(single_motor.basis_blades(), Vee::single_motor().basis_blades());
    /// format_eq!(single_motor, [
    ///     "+x͔x͕+y͔y͕+z͔z͕+ð͔ð͕+ø͔ø͕+þ͔þ͕",
    ///     "+(+W͔x͕-W͕x͔)e01",
    ///     "+(+W͔y͕-W͕y͔)e02",
    ///     "+(+W͔z͕-W͕z͔)e03",
    ///     "+(+W͔ð͕-W͕ð͔)e04",
    ///     "+(+W͔ø͕-W͕ø͔)e05",
    ///     "+(+W͔þ͕-W͕þ͔)e06",
    ///     "+(+x͔y͕-x͕y͔)e12",
    ///     "+(+x͔z͕-x͕z͔)e13",
    ///     "+(+x͔ð͕-x͕ð͔)e14",
    ///     "+(+x͔ø͕-x͕ø͔)e15",
    ///     "+(+x͔þ͕-x͕þ͔)e16",
    ///     "+(+y͔z͕-y͕z͔)e23",
    ///     "+(+y͔ð͕-y͕ð͔)e24",
    ///     "+(+y͔ø͕-y͕ø͔)e25",
    ///     "+(+y͔þ͕-y͕þ͔)e26",
    ///     "+(+z͔ð͕-z͕ð͔)e34",
    ///     "+(+z͔ø͕-z͕ø͔)e35",
    ///     "+(+z͔þ͕-z͕þ͔)e36",
    ///     "+(+ð͔ø͕-ð͕ø͔)e45",
    ///     "+(+ð͔þ͕-ð͕þ͔)e46",
    ///     "+(+ø͔þ͕-ø͕þ͔)e56",
    /// ]);
    ///
    /// let norm_squared = Vee::single_motor().norm_squared();
    ///
    /// assert_eq!(norm_squared.basis_blades(), Vee::norm().basis_blades());
    /// format_eq!(norm_squared, [
    ///     "+vv+αα+ββ+γγ+δδ+εε+ζζ+ηη+θθ+ιι+κκ+λλ+μμ+νν+ξξ+οο",
    ///     "+2(-κο+λξ-μν)e3456",
    ///     "+2(+ηο-θξ+ιν)e2465",
    ///     "+2(-ζο+θμ-ιλ)e2356",
    ///     "+2(+ζξ-ημ+ικ)e2364",
    ///     "+2(-ζν+ηλ-θκ)e2345",
    ///     "+2(-γο+δξ-εν)e1456",
    ///     "+2(+βο-δμ+ελ)e1365",
    ///     "+2(-βξ+γμ-εκ)e1346",
    ///     "+2(+βν-γλ+δκ)e1354",
    ///     "+2(-αο+δι-εθ)e1256",
    ///     "+2(+αξ-γι+εη)e1264",
    ///     "+2(-αν+γθ-δη)e1245",
    ///     "+2(-αμ+βι-εζ)e1236",
    ///     "+2(+αλ-βθ+δζ)e1253",
    ///     "+2(-ακ+βη-γζ)e1234",
    ///     "+2(+Ðο-Øξ+Þν)e0465",
    ///     "+2(-Zο+Øμ-Þλ)e0356",
    ///     "+2(+Zξ-Ðμ+Þκ)e0364",
    ///     "+2(-Zν+Ðλ-Øκ)e0345",
    ///     "+2(+Yο-Øι+Þθ)e0265",
    ///     "+2(-Yξ+Ðι-Þη)e0246",
    ///     "+2(+Yν-Ðθ+Øη)e0254",
    ///     "+2(+Yμ-Zι+Þζ)e0263",
    ///     "+2(-Yλ+Zθ-Øζ)e0235",
    ///     "+2(+Yκ-Zη+Ðζ)e0243",
    ///     "+2(-Xο+Øε-Þδ)e0156",
    ///     "+2(+Xξ-Ðε+Þγ)e0164",
    ///     "+2(-Xν+Ðδ-Øγ)e0145",
    ///     "+2(-Xμ+Zε-Þβ)e0136",
    ///     "+2(+Xλ-Zδ+Øβ)e0153",
    ///     "+2(-Xκ+Zγ-Ðβ)e0134",
    ///     "+2(+Xι-Yε+Þα)e0162",
    ///     "+2(-Xθ+Yδ-Øα)e0125",
    ///     "+2(+Xη-Yγ+Ðα)e0142",
    ///     "+2(-Xζ+Yβ-Zα)e0123",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_motor() -> Self {
        Self::scalar() + Self::volume4()
    }
    /// The multivector of simple double motor $`m_{s2} \equiv s + v^4 + p_\infty`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let simple_double_motor = Vee::line().lhs() * Vee::line().rhs();
    /// assert_eq!(simple_double_motor.basis_blades(), Vee::simple_double_motor().basis_blades());
    /// format_eq!(simple_double_motor, [
    ///     "+ẋ͔ẋ͕+ẏ͔ẏ͕+ż͔ż͕+ð͔̇ð͕̇+ø͔̇ø͕̇+þ͔̇þ͕̇",
    ///     "+(+ẏ͔Α͕̇-ẏ͕Α͔̇+ż͔Β͕̇-ż͕Β͔̇+ð͔̇Γ͕̇-ð͕̇Γ͔̇+ø͔̇Δ͕̇-ø͕̇Δ͔̇+þ͔̇Ε͕̇-þ͕̇Ε͔̇)e01",
    ///     "+(-ẋ͔Α͕̇+ẋ͕Α͔̇+ż͔Ζ͕̇-ż͕Ζ͔̇+ð͔̇Η͕̇-ð͕̇Η͔̇+ø͔̇Θ͕̇-ø͕̇Θ͔̇+þ͔̇Ι͕̇-þ͕̇Ι͔̇)e02",
    ///     "+(-ẋ͔Β͕̇+ẋ͕Β͔̇-ẏ͔Ζ͕̇+ẏ͕Ζ͔̇+ð͔̇Κ͕̇-ð͕̇Κ͔̇+ø͔̇Λ͕̇-ø͕̇Λ͔̇+þ͔̇Μ͕̇-þ͕̇Μ͔̇)e03",
    ///     "+(-ẋ͔Γ͕̇+ẋ͕Γ͔̇-ẏ͔Η͕̇+ẏ͕Η͔̇-ż͔Κ͕̇+ż͕Κ͔̇+ø͔̇Ν͕̇-ø͕̇Ν͔̇+þ͔̇Ξ͕̇-þ͕̇Ξ͔̇)e04",
    ///     "+(-ẋ͔Δ͕̇+ẋ͕Δ͔̇-ẏ͔Θ͕̇+ẏ͕Θ͔̇-ż͔Λ͕̇+ż͕Λ͔̇-ð͔̇Ν͕̇+ð͕̇Ν͔̇+þ͔̇Ο͕̇-þ͕̇Ο͔̇)e05",
    ///     "+(-ẋ͔Ε͕̇+ẋ͕Ε͔̇-ẏ͔Ι͕̇+ẏ͕Ι͔̇-ż͔Μ͕̇+ż͕Μ͔̇-ð͔̇Ξ͕̇+ð͕̇Ξ͔̇-ø͔̇Ο͕̇+ø͕̇Ο͔̇)e06",
    ///     "+(+ẋ͔ẏ͕-ẋ͕ẏ͔)e12",
    ///     "+(+ẋ͔ż͕-ẋ͕ż͔)e13",
    ///     "+(+ẋ͔ð͕̇-ẋ͕ð͔̇)e14",
    ///     "+(+ẋ͔ø͕̇-ẋ͕ø͔̇)e15",
    ///     "+(+ẋ͔þ͕̇-ẋ͕þ͔̇)e16",
    ///     "+(+ẏ͔ż͕-ẏ͕ż͔)e23",
    ///     "+(+ẏ͔ð͕̇-ẏ͕ð͔̇)e24",
    ///     "+(+ẏ͔ø͕̇-ẏ͕ø͔̇)e25",
    ///     "+(+ẏ͔þ͕̇-ẏ͕þ͔̇)e26",
    ///     "+(+ż͔ð͕̇-ż͕ð͔̇)e34",
    ///     "+(+ż͔ø͕̇-ż͕ø͔̇)e35",
    ///     "+(+ż͔þ͕̇-ż͕þ͔̇)e36",
    ///     "+(+ð͔̇ø͕̇-ð͕̇ø͔̇)e45",
    ///     "+(+ð͔̇þ͕̇-ð͕̇þ͔̇)e46",
    ///     "+(+ø͔̇þ͕̇-ø͕̇þ͔̇)e56",
    ///     "+(+ð͔̇Ο͕̇+ð͕̇Ο͔̇-ø͔̇Ξ͕̇-ø͕̇Ξ͔̇+þ͔̇Ν͕̇+þ͕̇Ν͔̇)e0465",
    ///     "+(-ż͔Ο͕̇-ż͕Ο͔̇+ø͔̇Μ͕̇+ø͕̇Μ͔̇-þ͔̇Λ͕̇-þ͕̇Λ͔̇)e0356",
    ///     "+(+ż͔Ξ͕̇+ż͕Ξ͔̇-ð͔̇Μ͕̇-ð͕̇Μ͔̇+þ͔̇Κ͕̇+þ͕̇Κ͔̇)e0364",
    ///     "+(-ż͔Ν͕̇-ż͕Ν͔̇+ð͔̇Λ͕̇+ð͕̇Λ͔̇-ø͔̇Κ͕̇-ø͕̇Κ͔̇)e0345",
    ///     "+(+ẏ͔Ο͕̇+ẏ͕Ο͔̇-ø͔̇Ι͕̇-ø͕̇Ι͔̇+þ͔̇Θ͕̇+þ͕̇Θ͔̇)e0265",
    ///     "+(-ẏ͔Ξ͕̇-ẏ͕Ξ͔̇+ð͔̇Ι͕̇+ð͕̇Ι͔̇-þ͔̇Η͕̇-þ͕̇Η͔̇)e0246",
    ///     "+(+ẏ͔Ν͕̇+ẏ͕Ν͔̇-ð͔̇Θ͕̇-ð͕̇Θ͔̇+ø͔̇Η͕̇+ø͕̇Η͔̇)e0254",
    ///     "+(+ẏ͔Μ͕̇+ẏ͕Μ͔̇-ż͔Ι͕̇-ż͕Ι͔̇+þ͔̇Ζ͕̇+þ͕̇Ζ͔̇)e0263",
    ///     "+(-ẏ͔Λ͕̇-ẏ͕Λ͔̇+ż͔Θ͕̇+ż͕Θ͔̇-ø͔̇Ζ͕̇-ø͕̇Ζ͔̇)e0235",
    ///     "+(+ẏ͔Κ͕̇+ẏ͕Κ͔̇-ż͔Η͕̇-ż͕Η͔̇+ð͔̇Ζ͕̇+ð͕̇Ζ͔̇)e0243",
    ///     "+(-ẋ͔Ο͕̇-ẋ͕Ο͔̇+ø͔̇Ε͕̇+ø͕̇Ε͔̇-þ͔̇Δ͕̇-þ͕̇Δ͔̇)e0156",
    ///     "+(+ẋ͔Ξ͕̇+ẋ͕Ξ͔̇-ð͔̇Ε͕̇-ð͕̇Ε͔̇+þ͔̇Γ͕̇+þ͕̇Γ͔̇)e0164",
    ///     "+(-ẋ͔Ν͕̇-ẋ͕Ν͔̇+ð͔̇Δ͕̇+ð͕̇Δ͔̇-ø͔̇Γ͕̇-ø͕̇Γ͔̇)e0145",
    ///     "+(-ẋ͔Μ͕̇-ẋ͕Μ͔̇+ż͔Ε͕̇+ż͕Ε͔̇-þ͔̇Β͕̇-þ͕̇Β͔̇)e0136",
    ///     "+(+ẋ͔Λ͕̇+ẋ͕Λ͔̇-ż͔Δ͕̇-ż͕Δ͔̇+ø͔̇Β͕̇+ø͕̇Β͔̇)e0153",
    ///     "+(-ẋ͔Κ͕̇-ẋ͕Κ͔̇+ż͔Γ͕̇+ż͕Γ͔̇-ð͔̇Β͕̇-ð͕̇Β͔̇)e0134",
    ///     "+(+ẋ͔Ι͕̇+ẋ͕Ι͔̇-ẏ͔Ε͕̇-ẏ͕Ε͔̇+þ͔̇Α͕̇+þ͕̇Α͔̇)e0162",
    ///     "+(-ẋ͔Θ͕̇-ẋ͕Θ͔̇+ẏ͔Δ͕̇+ẏ͕Δ͔̇-ø͔̇Α͕̇-ø͕̇Α͔̇)e0125",
    ///     "+(+ẋ͔Η͕̇+ẋ͕Η͔̇-ẏ͔Γ͕̇-ẏ͕Γ͔̇+ð͔̇Α͕̇+ð͕̇Α͔̇)e0142",
    ///     "+(-ẋ͔Ζ͕̇-ẋ͕Ζ͔̇+ẏ͔Β͕̇+ẏ͕Β͔̇-ż͔Α͕̇-ż͕Α͔̇)e0123",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_double_motor() -> Self {
        Self::scalar() + Self::volume4() + Self::plane_moment()
    }
    /// The multivector of double motor $`m_2 \equiv s + v^4 + p`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let double_motor = Vee::double_rotator().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(double_motor.basis_blades(),
    ///     (Vee::double_motor() + Vee::direction()).basis_blades());
    /// format_eq!(double_motor, [
    ///     "+v͔v͕",
    ///     "+(+X͕v͔+Y͕α͔+Z͕β͔+Ð͕γ͔+Ø͕δ͔+Þ͕ε͔)e01",
    ///     "+(-X͕α͔+Y͕v͔+Z͕ζ͔+Ð͕η͔+Ø͕θ͔+Þ͕ι͔)e02",
    ///     "+(-X͕β͔-Y͕ζ͔+Z͕v͔+Ð͕κ͔+Ø͕λ͔+Þ͕μ͔)e03",
    ///     "+(-X͕γ͔-Y͕η͔-Z͕κ͔+v͔Ð͕+Ø͕ν͔+Þ͕ξ͔)e04",
    ///     "+(-X͕δ͔-Y͕θ͔-Z͕λ͔+v͔Ø͕-Ð͕ν͔+Þ͕ο͔)e05",
    ///     "+(-X͕ε͔-Y͕ι͔-Z͕μ͔+v͔Þ͕-Ð͕ξ͔-Ø͕ο͔)e06",
    ///     "+v͕α͔e12",
    ///     "+v͕β͔e13",
    ///     "+v͕γ͔e14",
    ///     "+v͕δ͔e15",
    ///     "+v͕ε͔e16",
    ///     "+v͕ζ͔e23",
    ///     "+v͕η͔e24",
    ///     "+v͕θ͔e25",
    ///     "+v͕ι͔e26",
    ///     "+v͕κ͔e34",
    ///     "+v͕λ͔e35",
    ///     "+v͕μ͔e36",
    ///     "+v͕ν͔e45",
    ///     "+v͕ξ͔e46",
    ///     "+v͕ο͔e56",
    ///     "+v͕α͔̇e3456",
    ///     "+v͕β͔̇e2465",
    ///     "+v͕γ͔̇e2356",
    ///     "+v͕δ͔̇e2364",
    ///     "+v͕ε͔̇e2345",
    ///     "+v͕ζ͔̇e1456",
    ///     "+v͕η͔̇e1365",
    ///     "+v͕θ͔̇e1346",
    ///     "+v͕ι͔̇e1354",
    ///     "+v͕κ͔̇e1256",
    ///     "+v͕λ͔̇e1264",
    ///     "+v͕μ͔̇e1245",
    ///     "+v͕ν͔̇e1236",
    ///     "+v͕ξ͔̇e1253",
    ///     "+v͕ο͔̇e1234",
    ///     "+(+X͕ζ͔̇-Y͕β͔̇+Z͕α͔̇-Ð͕ο͔+Ø͕ξ͔-Þ͕ν͔)e0465",
    ///     "+(+X͕η͔̇-Y͕γ͔̇+Z͕ο͔+Ð͕α͔̇-Ø͕μ͔+Þ͕λ͔)e0356",
    ///     "+(+X͕θ͔̇-Y͕δ͔̇-Z͕ξ͔+Ð͕μ͔+Ø͕α͔̇-Þ͕κ͔)e0364",
    ///     "+(+X͕ι͔̇-Y͕ε͔̇+Z͕ν͔-Ð͕λ͔+Ø͕κ͔+Þ͕α͔̇)e0345",
    ///     "+(+X͕κ͔̇-Y͕ο͔-Z͕γ͔̇+Ð͕β͔̇+Ø͕ι͔-Þ͕θ͔)e0265",
    ///     "+(+X͕λ͔̇+Y͕ξ͔-Z͕δ͔̇-Ð͕ι͔+Ø͕β͔̇+Þ͕η͔)e0246",
    ///     "+(+X͕μ͔̇-Y͕ν͔-Z͕ε͔̇+Ð͕θ͔-Ø͕η͔+Þ͕β͔̇)e0254",
    ///     "+(+X͕ν͔̇-Y͕μ͔+Z͕ι͔-Ð͕δ͔̇+Ø͕γ͔̇-Þ͕ζ͔)e0263",
    ///     "+(+X͕ξ͔̇+Y͕λ͔-Z͕θ͔-Ð͕ε͔̇+Ø͕ζ͔+Þ͕γ͔̇)e0235",
    ///     "+(+X͕ο͔̇-Y͕κ͔+Z͕η͔-Ð͕ζ͔-Ø͕ε͔̇+Þ͕δ͔̇)e0243",
    ///     "+(+X͕ο͔+Y͕κ͔̇-Z͕η͔̇+Ð͕ζ͔̇-Ø͕ε͔+Þ͕δ͔)e0156",
    ///     "+(-X͕ξ͔+Y͕λ͔̇-Z͕θ͔̇+Ð͕ε͔+Ø͕ζ͔̇-Þ͕γ͔)e0164",
    ///     "+(+X͕ν͔+Y͕μ͔̇-Z͕ι͔̇-Ð͕δ͔+Ø͕γ͔+Þ͕ζ͔̇)e0145",
    ///     "+(+X͕μ͔+Y͕ν͔̇-Z͕ε͔-Ð͕θ͔̇+Ø͕η͔̇+Þ͕β͔)e0136",
    ///     "+(-X͕λ͔+Y͕ξ͔̇+Z͕δ͔-Ð͕ι͔̇-Ø͕β͔+Þ͕η͔̇)e0153",
    ///     "+(+X͕κ͔+Y͕ο͔̇-Z͕γ͔+Ð͕β͔-Ø͕ι͔̇+Þ͕θ͔̇)e0134",
    ///     "+(-X͕ι͔+Y͕ε͔+Z͕ν͔̇-Ð͕λ͔̇+Ø͕κ͔̇-Þ͕α͔)e0162",
    ///     "+(+X͕θ͔-Y͕δ͔+Z͕ξ͔̇-Ð͕μ͔̇+Ø͕α͔+Þ͕κ͔̇)e0125",
    ///     "+(-X͕η͔+Y͕γ͔+Z͕ο͔̇-Ð͕α͔-Ø͕μ͔̇+Þ͕λ͔̇)e0142",
    ///     "+(+X͕ζ͔-Y͕β͔+Z͕α͔+Ð͕ο͔̇-Ø͕ξ͔̇+Þ͕ν͔̇)e0123",
    ///     // Additional orthogonality condition besides `norm_squared` condition:
    ///     "+(-Y͕α͔̇-Z͕β͔̇-Ð͕γ͔̇-Ø͕δ͔̇-Þ͕ε͔̇)e023465",
    ///     "+(+X͕α͔̇-Z͕ζ͔̇-Ð͕η͔̇-Ø͕θ͔̇-Þ͕ι͔̇)e013456",
    ///     "+(+X͕β͔̇+Y͕ζ͔̇-Ð͕κ͔̇-Ø͕λ͔̇-Þ͕μ͔̇)e012465",
    ///     "+(+X͕γ͔̇+Y͕η͔̇+Z͕κ͔̇-Ø͕ν͔̇-Þ͕ξ͔̇)e012356",
    ///     "+(+X͕δ͔̇+Y͕θ͔̇+Z͕λ͔̇+Ð͕ν͔̇-Þ͕ο͔̇)e012364",
    ///     "+(+X͕ε͔̇+Y͕ι͔̇+Z͕μ͔̇+Ð͕ξ͔̇+Ø͕ο͔̇)e012345",
    /// ]);
    ///
    /// // Orthogonality condition between single rotator quadvector and translator bivectors.
    /// // Without this condition, it is a triple motor for arbitrary choices of double rotator and
    /// // translator.
    /// format_eq!(Vee::double_rotator().vector(4).lhs() ^ Vee::translator().vector(2).rhs(), [
    ///     "+(-Y͕α͔̇-Z͕β͔̇-Ð͕γ͔̇-Ø͕δ͔̇-Þ͕ε͔̇)e023465",
    ///     "+(+X͕α͔̇-Z͕ζ͔̇-Ð͕η͔̇-Ø͕θ͔̇-Þ͕ι͔̇)e013456",
    ///     "+(+X͕β͔̇+Y͕ζ͔̇-Ð͕κ͔̇-Ø͕λ͔̇-Þ͕μ͔̇)e012465",
    ///     "+(+X͕γ͔̇+Y͕η͔̇+Z͕κ͔̇-Ø͕ν͔̇-Þ͕ξ͔̇)e012356",
    ///     "+(+X͕δ͔̇+Y͕θ͔̇+Z͕λ͔̇+Ð͕ν͔̇-Þ͕ο͔̇)e012364",
    ///     "+(+X͕ε͔̇+Y͕ι͔̇+Z͕μ͔̇+Ð͕ξ͔̇+Ø͕ο͔̇)e012345",
    /// ]);
    ///
    /// let norm_squared = Vee::double_motor().norm_squared();
    ///
    /// assert_eq!(norm_squared.basis_blades(), Vee::norm().basis_blades());
    /// format_eq!(norm_squared, [
    ///     "+vv+αα+α̇α̇+ββ+β̇β̇+γγ+γ̇γ̇+δδ+δ̇δ̇+εε+ε̇ε̇+ζζ+ζ̇ζ̇+ηη+η̇η̇\
    ///      +θθ+θ̇θ̇+ιι+ι̇ι̇+κκ+κ̇κ̇+λλ+λ̇λ̇+μμ+μ̇μ̇+νν+ν̇ν̇+ξξ+ξ̇ξ̇+οο+ο̇ο̇",
    ///     "+2(+vα̇-βζ̇+β̇ζ-γη̇+γ̇η-δθ̇+δ̇θ-ει̇+ε̇ι-κο-κ̇ο̇+λξ+λ̇ξ̇-μν-μ̇ν̇)e3456",
    ///     "+2(+vβ̇+αζ̇-α̇ζ-γκ̇+γ̇κ-δλ̇+δ̇λ-εμ̇+ε̇μ+ηο+η̇ο̇-θξ-θ̇ξ̇+ιν+ι̇ν̇)e2465",
    ///     "+2(+vγ̇+αη̇-α̇η+βκ̇-β̇κ-δν̇+δ̇ν-εξ̇+ε̇ξ-ζο-ζ̇ο̇+θμ+θ̇μ̇-ιλ-ι̇λ̇)e2356",
    ///     "+2(+vδ̇+αθ̇-α̇θ+βλ̇-β̇λ+γν̇-γ̇ν-εο̇+ε̇ο+ζξ+ζ̇ξ̇-ημ-η̇μ̇+ικ+ι̇κ̇)e2364",
    ///     "+2(+vε̇+αι̇-α̇ι+βμ̇-β̇μ+γξ̇-γ̇ξ+δο̇-δ̇ο-ζν-ζ̇ν̇+ηλ+η̇λ̇-θκ-θ̇κ̇)e2345",
    ///     "+2(+vζ̇-αβ̇+α̇β-γο-γ̇ο̇+δξ+δ̇ξ̇-εν-ε̇ν̇-ηκ̇+η̇κ-θλ̇+θ̇λ-ιμ̇+ι̇μ)e1456",
    ///     "+2(+vη̇-αγ̇+α̇γ+βο+β̇ο̇-δμ-δ̇μ̇+ελ+ε̇λ̇+ζκ̇-ζ̇κ-θν̇+θ̇ν-ιξ̇+ι̇ξ)e1365",
    ///     "+2(+vθ̇-αδ̇+α̇δ-βξ-β̇ξ̇+γμ+γ̇μ̇-εκ-ε̇κ̇+ζλ̇-ζ̇λ+ην̇-η̇ν-ιο̇+ι̇ο)e1346",
    ///     "+2(+vι̇-αε̇+α̇ε+βν+β̇ν̇-γλ-γ̇λ̇+δκ+δ̇κ̇+ζμ̇-ζ̇μ+ηξ̇-η̇ξ+θο̇-θ̇ο)e1354",
    ///     "+2(+vκ̇-αο-α̇ο̇-βγ̇+β̇γ+δι+δ̇ι̇-εθ-ε̇θ̇-ζη̇+ζ̇η-λν̇+λ̇ν-μξ̇+μ̇ξ)e1256",
    ///     "+2(+vλ̇+αξ+α̇ξ̇-βδ̇+β̇δ-γι-γ̇ι̇+εη+ε̇η̇-ζθ̇+ζ̇θ+κν̇-κ̇ν-μο̇+μ̇ο)e1264",
    ///     "+2(+vμ̇-αν-α̇ν̇-βε̇+β̇ε+γθ+γ̇θ̇-δη-δ̇η̇-ζι̇+ζ̇ι+κξ̇-κ̇ξ+λο̇-λ̇ο)e1245",
    ///     "+2(+vν̇-αμ-α̇μ̇+βι+β̇ι̇-γδ̇+γ̇δ-εζ-ε̇ζ̇-ηθ̇+η̇θ-κλ̇+κ̇λ-ξο̇+ξ̇ο)e1236",
    ///     "+2(+vξ̇+αλ+α̇λ̇-βθ-β̇θ̇-γε̇+γ̇ε+δζ+δ̇ζ̇-ηι̇+η̇ι-κμ̇+κ̇μ+νο̇-ν̇ο)e1253",
    ///     "+2(+vο̇-ακ-α̇κ̇+βη+β̇η̇-γζ-γ̇ζ̇-δε̇+δ̇ε-θι̇+θ̇ι-λμ̇+λ̇μ-νξ̇+ν̇ξ)e1234",
    ///     "+2(+Ȧv+Ḃκ+Ċλ+Ḋμ-Ėη-Ḟθ-Ġι-Ḣε̇+İδ̇-J̇γ̇+K̇γ+L̇δ\
    ///         +Ṁε-Ṅι̇+Ȯθ̇-Ṗη̇-Q̇μ̇+Ṙλ̇-Ṡκ̇-Xζ̇+Yβ̇-Zα̇+Ðο-Øξ+Þν)e0465",
    ///     "+2(-Ȧκ+Ḃv+Ċν+Ḋξ+Ėζ+Ḟε̇-Ġδ̇-Ḣθ-İι+J̇β̇-K̇β+L̇ι̇\
    ///         -Ṁθ̇+Ṅδ+Ȯε+Ṗζ̇-Q̇ξ̇+Ṙν̇-Ṫκ̇-Xη̇+Yγ̇-Zο-Ðα̇+Øμ-Þλ)e0356",
    ///     "+2(-Ȧλ-Ḃν+Ċv+Ḋο-Ėε̇+Ḟζ+Ġγ̇+Ḣη-İβ̇-J̇ι-K̇ι̇-L̇β\
    ///         +Ṁη̇-Ṅγ-Ȯζ̇+Ṗε-Q̇ο̇+Ṡν̇-Ṫλ̇-Xθ̇+Yδ̇+Zξ-Ðμ-Øα̇+Þκ)e0364",
    ///     "+2(-Ȧμ-Ḃξ-Ċο+Ḋv+Ėδ̇-Ḟγ̇+Ġζ+Ḣβ̇+İη+J̇θ+K̇θ̇-L̇η̇\
    ///         -Ṁβ+Ṅζ̇-Ȯγ-Ṗδ-Ṙο̇+Ṡξ̇-Ṫμ̇-Xι̇+Yε̇-Zν+Ðλ-Øκ-Þα̇)e0345",
    ///     "+2(+Ȧη-Ḃζ-Ċε̇+Ḋδ̇+Ėv+Ḟν+Ġξ-Ḣλ-İμ-J̇α̇+K̇α+L̇μ̇\
    ///         -Ṁλ̇+Ṅξ̇-Ȯν̇+Q̇δ+Ṙε+Ṡζ̇+Ṫη̇-Xκ̇+Yο+Zγ̇-Ðβ̇-Øι+Þθ)e0265",
    ///     "+2(+Ȧθ+Ḃε̇-Ċζ-Ḋγ̇-Ėν+Ḟv+Ġο+Ḣκ+İα̇-J̇μ-K̇μ̇+L̇α\
    ///         +Ṁκ̇+Ṅο̇-Ṗν̇-Q̇γ-Ṙζ̇+Ṡε+Ṫθ̇-Xλ̇-Yξ+Zδ̇+Ðι-Øβ̇-Þη)e0246",
    ///     "+2(+Ȧι-Ḃδ̇+Ċγ̇-Ḋζ-Ėξ-Ḟο+Ġv-Ḣα̇+İκ+J̇λ+K̇λ̇-L̇κ̇\
    ///         +Ṁα+Ȯο̇-Ṗξ̇+Q̇ζ̇-Ṙγ-Ṡδ+Ṫι̇-Xμ̇+Yν+Zε̇-Ðθ+Øη-Þβ̇)e0254",
    ///     "+2(-Ȧε̇+Ḃθ-Ċη+Ḋβ̇+Ėλ-Ḟκ-Ġα̇+Ḣv+İο-J̇ξ-K̇ξ̇-L̇ο̇\
    ///         +Ṅα+Ȯκ̇+Ṗλ̇+Q̇β-Ṙη̇-Ṡθ̇+Ṫε-Xν̇+Yμ-Zι+Ðδ̇-Øγ̇+Þζ)e0263",
    ///     "+2(+Ȧδ̇+Ḃι-Ċβ̇-Ḋη+Ėμ+Ḟα̇-Ġκ-Ḣο+İv+J̇ν+K̇ν̇-Ṁο̇\
    ///         -Ṅκ̇+Ȯα+Ṗμ̇+Q̇η̇+Ṙβ-Ṡι̇-Ṫδ-Xξ̇-Yλ+Zθ+Ðε̇-Øζ-Þγ̇)e0235",
    ///     "+2(-Ȧγ̇+Ḃβ̇+Ċι-Ḋθ-Ėα̇+Ḟμ-Ġλ+Ḣξ-İν+J̇v+L̇ν̇+Ṁξ̇\
    ///         -Ṅλ̇-Ȯμ̇+Ṗα+Q̇θ̇+Ṙι̇+Ṡβ+Ṫγ-Xο̇+Yκ-Zη+Ðζ+Øε̇-Þδ̇)e0243",
    ///     "+2(-Ȧγ+Ḃβ-Ċι̇+Ḋθ̇-Ėα-Ḟμ̇+Ġλ̇-Ḣξ̇+İν̇+K̇v+L̇ν+Ṁξ\
    ///         -Ṅλ-Ȯμ-Ṗα̇+Q̇θ+Ṙι-Ṡβ̇-Ṫγ̇-Xο-Yκ̇+Zη̇-Ðζ̇+Øε-Þδ)e0156",
    ///     "+2(-Ȧδ+Ḃι̇+Ċβ-Ḋη̇+Ėμ̇-Ḟα-Ġκ̇-Ḣο̇+J̇ν̇-K̇ν+L̇v+Ṁο\
    ///         +Ṅκ+Ȯα̇-Ṗμ-Q̇η+Ṙβ̇+Ṡι-Ṫδ̇+Xξ-Yλ̇+Zθ̇-Ðε-Øζ̇+Þγ)e0164",
    ///     "+2(-Ȧε-Ḃθ̇+Ċη̇+Ḋβ-Ėλ̇+Ḟκ̇-Ġα-İο̇+J̇ξ̇-K̇ξ-L̇ο+Ṁv\
    ///         -Ṅα̇+Ȯκ+Ṗλ-Q̇β̇-Ṙη-Ṡθ-Ṫε̇-Xν-Yμ̇+Zι̇+Ðδ-Øγ-Þζ̇)e0145",
    ///     "+2(-Ȧι̇-Ḃδ+Ċγ+Ḋζ̇+Ėξ̇+Ḟο̇-Ḣα-İκ̇-J̇λ̇+K̇λ-L̇κ-Ṁα̇\
    ///         +Ṅv+Ȯο-Ṗξ+Q̇ζ+Ṙγ̇+Ṡδ̇+Ṫι-Xμ-Yν̇+Zε+Ðθ̇-Øη̇-Þβ)e0136",
    ///     "+2(+Ȧθ̇-Ḃε-Ċζ̇+Ḋγ-Ėν̇+Ġο̇+Ḣκ̇-İα-J̇μ̇+K̇μ+L̇α̇-Ṁκ\
    ///         -Ṅο+Ȯv+Ṗν-Q̇γ̇+Ṙζ+Ṡε̇-Ṫθ+Xλ-Yξ̇-Zδ+Ðι̇+Øβ-Þη̇)e0153",
    ///     "+2(-Ȧη̇+Ḃζ̇-Ċε+Ḋδ-Ḟν̇-Ġξ̇+Ḣλ̇+İμ̇-J̇α-K̇α̇+L̇μ-Ṁλ\
    ///         +Ṅξ-Ȯν+Ṗv-Q̇δ̇-Ṙε̇+Ṡζ+Ṫη-Xκ-Yο̇+Zγ-Ðβ+Øι̇-Þθ̇)e0134",
    ///     "+2(-Ȧμ̇-Ḃξ̇-Ċο̇-Ėδ+Ḟγ+Ġζ̇-Ḣβ+İη̇+J̇θ̇-K̇θ+L̇η-Ṁβ̇\
    ///         -Ṅζ-Ȯγ̇-Ṗδ̇+Q̇v+Ṙο-Ṡξ+Ṫμ+Xι-Yε-Zν̇+Ðλ̇-Øκ̇+Þα)e0162",
    ///     "+2(+Ȧλ̇+Ḃν̇-Ḋο̇-Ėε-Ḟζ̇+Ġγ-Ḣη̇-İβ+J̇ι̇-K̇ι+L̇β̇+Ṁη\
    ///         +Ṅγ̇-Ȯζ-Ṗε̇-Q̇ο+Ṙv+Ṡν-Ṫλ-Xθ+Yδ-Zξ̇+Ðμ̇-Øα-Þκ̇)e0125",
    ///     "+2(-Ȧκ̇+Ċν̇+Ḋξ̇+Ėζ̇-Ḟε+Ġδ-Ḣθ̇-İι̇-J̇β-K̇β̇-L̇ι+Ṁθ\
    ///         +Ṅδ̇+Ȯε̇-Ṗζ+Q̇ξ-Ṙν+Ṡv+Ṫκ+Xη-Yγ-Zο̇+Ðα+Øμ̇-Þλ̇)e0142",
    ///     "+2(-Ḃκ̇-Ċλ̇-Ḋμ̇+Ėη̇+Ḟθ̇+Ġι̇-Ḣε+İδ-J̇γ-K̇γ̇-L̇δ̇-Ṁε̇\
    ///         -Ṅι+Ȯθ-Ṗη-Q̇μ+Ṙλ-Ṡκ+Ṫv-Xζ+Yβ-Zα-Ðο̇+Øξ̇-Þν̇)e0123",
    /// ]);
    ///
    /// let double_motor = Vee::volume4().lhs() * Vee::volume4().rhs();
    /// assert_eq!(double_motor.basis_blades(), Vee::double_motor().basis_blades());
    /// format_eq!(double_motor, [
    ///     "-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕",
    ///     "+(-Y͔α͕+Y͕α͔-Z͔β͕+Z͕β͔-Ð͔γ͕+Ð͕γ͔-Ø͔δ͕+Ø͕δ͔-Þ͔ε͕+Þ͕ε͔)e01",
    ///     "+(+X͔α͕-X͕α͔-Z͔ζ͕+Z͕ζ͔-Ð͔η͕+Ð͕η͔-Ø͔θ͕+Ø͕θ͔-Þ͔ι͕+Þ͕ι͔)e02",
    ///     "+(+X͔β͕-X͕β͔+Y͔ζ͕-Y͕ζ͔-Ð͔κ͕+Ð͕κ͔-Ø͔λ͕+Ø͕λ͔-Þ͔μ͕+Þ͕μ͔)e03",
    ///     "+(+X͔γ͕-X͕γ͔+Y͔η͕-Y͕η͔+Z͔κ͕-Z͕κ͔-Ø͔ν͕+Ø͕ν͔-Þ͔ξ͕+Þ͕ξ͔)e04",
    ///     "+(+X͔δ͕-X͕δ͔+Y͔θ͕-Y͕θ͔+Z͔λ͕-Z͕λ͔+Ð͔ν͕-Ð͕ν͔-Þ͔ο͕+Þ͕ο͔)e05",
    ///     "+(+X͔ε͕-X͕ε͔+Y͔ι͕-Y͕ι͔+Z͔μ͕-Z͕μ͔+Ð͔ξ͕-Ð͕ξ͔+Ø͔ο͕-Ø͕ο͔)e06",
    ///     "+(-β͔ζ͕+β͕ζ͔-γ͔η͕+γ͕η͔-δ͔θ͕+δ͕θ͔-ε͔ι͕+ε͕ι͔)e12",
    ///     "+(+α͔ζ͕-α͕ζ͔-γ͔κ͕+γ͕κ͔-δ͔λ͕+δ͕λ͔-ε͔μ͕+ε͕μ͔)e13",
    ///     "+(+α͔η͕-α͕η͔+β͔κ͕-β͕κ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔)e14",
    ///     "+(+α͔θ͕-α͕θ͔+β͔λ͕-β͕λ͔+γ͔ν͕-γ͕ν͔-ε͔ο͕+ε͕ο͔)e15",
    ///     "+(+α͔ι͕-α͕ι͔+β͔μ͕-β͕μ͔+γ͔ξ͕-γ͕ξ͔+δ͔ο͕-δ͕ο͔)e16",
    ///     "+(-α͔β͕+α͕β͔-η͔κ͕+η͕κ͔-θ͔λ͕+θ͕λ͔-ι͔μ͕+ι͕μ͔)e23",
    ///     "+(-α͔γ͕+α͕γ͔+ζ͔κ͕-ζ͕κ͔-θ͔ν͕+θ͕ν͔-ι͔ξ͕+ι͕ξ͔)e24",
    ///     "+(-α͔δ͕+α͕δ͔+ζ͔λ͕-ζ͕λ͔+η͔ν͕-η͕ν͔-ι͔ο͕+ι͕ο͔)e25",
    ///     "+(-α͔ε͕+α͕ε͔+ζ͔μ͕-ζ͕μ͔+η͔ξ͕-η͕ξ͔+θ͔ο͕-θ͕ο͔)e26",
    ///     "+(-β͔γ͕+β͕γ͔-ζ͔η͕+ζ͕η͔-λ͔ν͕+λ͕ν͔-μ͔ξ͕+μ͕ξ͔)e34",
    ///     "+(-β͔δ͕+β͕δ͔-ζ͔θ͕+ζ͕θ͔+κ͔ν͕-κ͕ν͔-μ͔ο͕+μ͕ο͔)e35",
    ///     "+(-β͔ε͕+β͕ε͔-ζ͔ι͕+ζ͕ι͔+κ͔ξ͕-κ͕ξ͔+λ͔ο͕-λ͕ο͔)e36",
    ///     "+(-γ͔δ͕+γ͕δ͔-η͔θ͕+η͕θ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔)e45",
    ///     "+(-γ͔ε͕+γ͕ε͔-η͔ι͕+η͕ι͔-κ͔μ͕+κ͕μ͔+ν͔ο͕-ν͕ο͔)e46",
    ///     "+(-δ͔ε͕+δ͕ε͔-θ͔ι͕+θ͕ι͔-λ͔μ͕+λ͕μ͔-ν͔ξ͕+ν͕ξ͔)e56",
    ///     "+(+κ͔ο͕+κ͕ο͔-λ͔ξ͕-λ͕ξ͔+μ͔ν͕+μ͕ν͔)e3456",
    ///     "+(-η͔ο͕-η͕ο͔+θ͔ξ͕+θ͕ξ͔-ι͔ν͕-ι͕ν͔)e2465",
    ///     "+(+ζ͔ο͕+ζ͕ο͔-θ͔μ͕-θ͕μ͔+ι͔λ͕+ι͕λ͔)e2356",
    ///     "+(-ζ͔ξ͕-ζ͕ξ͔+η͔μ͕+η͕μ͔-ι͔κ͕-ι͕κ͔)e2364",
    ///     "+(+ζ͔ν͕+ζ͕ν͔-η͔λ͕-η͕λ͔+θ͔κ͕+θ͕κ͔)e2345",
    ///     "+(+γ͔ο͕+γ͕ο͔-δ͔ξ͕-δ͕ξ͔+ε͔ν͕+ε͕ν͔)e1456",
    ///     "+(-β͔ο͕-β͕ο͔+δ͔μ͕+δ͕μ͔-ε͔λ͕-ε͕λ͔)e1365",
    ///     "+(+β͔ξ͕+β͕ξ͔-γ͔μ͕-γ͕μ͔+ε͔κ͕+ε͕κ͔)e1346",
    ///     "+(-β͔ν͕-β͕ν͔+γ͔λ͕+γ͕λ͔-δ͔κ͕-δ͕κ͔)e1354",
    ///     "+(+α͔ο͕+α͕ο͔-δ͔ι͕-δ͕ι͔+ε͔θ͕+ε͕θ͔)e1256",
    ///     "+(-α͔ξ͕-α͕ξ͔+γ͔ι͕+γ͕ι͔-ε͔η͕-ε͕η͔)e1264",
    ///     "+(+α͔ν͕+α͕ν͔-γ͔θ͕-γ͕θ͔+δ͔η͕+δ͕η͔)e1245",
    ///     "+(+α͔μ͕+α͕μ͔-β͔ι͕-β͕ι͔+ε͔ζ͕+ε͕ζ͔)e1236",
    ///     "+(-α͔λ͕-α͕λ͔+β͔θ͕+β͕θ͔-δ͔ζ͕-δ͕ζ͔)e1253",
    ///     "+(+α͔κ͕+α͕κ͔-β͔η͕-β͕η͔+γ͔ζ͕+γ͕ζ͔)e1234",
    ///     "+(-Ð͔ο͕-Ð͕ο͔+Ø͔ξ͕+Ø͕ξ͔-Þ͔ν͕-Þ͕ν͔)e0465",
    ///     "+(+Z͔ο͕+Z͕ο͔-Ø͔μ͕-Ø͕μ͔+Þ͔λ͕+Þ͕λ͔)e0356",
    ///     "+(-Z͔ξ͕-Z͕ξ͔+Ð͔μ͕+Ð͕μ͔-Þ͔κ͕-Þ͕κ͔)e0364",
    ///     "+(+Z͔ν͕+Z͕ν͔-Ð͔λ͕-Ð͕λ͔+Ø͔κ͕+Ø͕κ͔)e0345",
    ///     "+(-Y͔ο͕-Y͕ο͔+Ø͔ι͕+Ø͕ι͔-Þ͔θ͕-Þ͕θ͔)e0265",
    ///     "+(+Y͔ξ͕+Y͕ξ͔-Ð͔ι͕-Ð͕ι͔+Þ͔η͕+Þ͕η͔)e0246",
    ///     "+(-Y͔ν͕-Y͕ν͔+Ð͔θ͕+Ð͕θ͔-Ø͔η͕-Ø͕η͔)e0254",
    ///     "+(-Y͔μ͕-Y͕μ͔+Z͔ι͕+Z͕ι͔-Þ͔ζ͕-Þ͕ζ͔)e0263",
    ///     "+(+Y͔λ͕+Y͕λ͔-Z͔θ͕-Z͕θ͔+Ø͔ζ͕+Ø͕ζ͔)e0235",
    ///     "+(-Y͔κ͕-Y͕κ͔+Z͔η͕+Z͕η͔-Ð͔ζ͕-Ð͕ζ͔)e0243",
    ///     "+(+X͔ο͕+X͕ο͔-Ø͔ε͕-Ø͕ε͔+Þ͔δ͕+Þ͕δ͔)e0156",
    ///     "+(-X͔ξ͕-X͕ξ͔+Ð͔ε͕+Ð͕ε͔-Þ͔γ͕-Þ͕γ͔)e0164",
    ///     "+(+X͔ν͕+X͕ν͔-Ð͔δ͕-Ð͕δ͔+Ø͔γ͕+Ø͕γ͔)e0145",
    ///     "+(+X͔μ͕+X͕μ͔-Z͔ε͕-Z͕ε͔+Þ͔β͕+Þ͕β͔)e0136",
    ///     "+(-X͔λ͕-X͕λ͔+Z͔δ͕+Z͕δ͔-Ø͔β͕-Ø͕β͔)e0153",
    ///     "+(+X͔κ͕+X͕κ͔-Z͔γ͕-Z͕γ͔+Ð͔β͕+Ð͕β͔)e0134",
    ///     "+(-X͔ι͕-X͕ι͔+Y͔ε͕+Y͕ε͔-Þ͔α͕-Þ͕α͔)e0162",
    ///     "+(+X͔θ͕+X͕θ͔-Y͔δ͕-Y͕δ͔+Ø͔α͕+Ø͕α͔)e0125",
    ///     "+(-X͔η͕-X͕η͔+Y͔γ͕+Y͕γ͔-Ð͔α͕-Ð͕α͔)e0142",
    ///     "+(+X͔ζ͕+X͕ζ͔-Y͔β͕-Y͕β͔+Z͔α͕+Z͕α͔)e0123",
    /// ]);
    ///
    /// let norm_squared = Vee::double_motor().norm_squared();
    ///
    /// assert_eq!(norm_squared.basis_blades(), Vee::norm().basis_blades());
    /// format_eq!(norm_squared, [
    ///     "+vv+αα+α̇α̇+ββ+β̇β̇+γγ+γ̇γ̇+δδ+δ̇δ̇+εε+ε̇ε̇+ζζ+ζ̇ζ̇+ηη+η̇η̇\
    ///      +θθ+θ̇θ̇+ιι+ι̇ι̇+κκ+κ̇κ̇+λλ+λ̇λ̇+μμ+μ̇μ̇+νν+ν̇ν̇+ξξ+ξ̇ξ̇+οο+ο̇ο̇",
    ///     "+2(+vα̇-βζ̇+β̇ζ-γη̇+γ̇η-δθ̇+δ̇θ-ει̇+ε̇ι-κο-κ̇ο̇+λξ+λ̇ξ̇-μν-μ̇ν̇)e3456",
    ///     "+2(+vβ̇+αζ̇-α̇ζ-γκ̇+γ̇κ-δλ̇+δ̇λ-εμ̇+ε̇μ+ηο+η̇ο̇-θξ-θ̇ξ̇+ιν+ι̇ν̇)e2465",
    ///     "+2(+vγ̇+αη̇-α̇η+βκ̇-β̇κ-δν̇+δ̇ν-εξ̇+ε̇ξ-ζο-ζ̇ο̇+θμ+θ̇μ̇-ιλ-ι̇λ̇)e2356",
    ///     "+2(+vδ̇+αθ̇-α̇θ+βλ̇-β̇λ+γν̇-γ̇ν-εο̇+ε̇ο+ζξ+ζ̇ξ̇-ημ-η̇μ̇+ικ+ι̇κ̇)e2364",
    ///     "+2(+vε̇+αι̇-α̇ι+βμ̇-β̇μ+γξ̇-γ̇ξ+δο̇-δ̇ο-ζν-ζ̇ν̇+ηλ+η̇λ̇-θκ-θ̇κ̇)e2345",
    ///     "+2(+vζ̇-αβ̇+α̇β-γο-γ̇ο̇+δξ+δ̇ξ̇-εν-ε̇ν̇-ηκ̇+η̇κ-θλ̇+θ̇λ-ιμ̇+ι̇μ)e1456",
    ///     "+2(+vη̇-αγ̇+α̇γ+βο+β̇ο̇-δμ-δ̇μ̇+ελ+ε̇λ̇+ζκ̇-ζ̇κ-θν̇+θ̇ν-ιξ̇+ι̇ξ)e1365",
    ///     "+2(+vθ̇-αδ̇+α̇δ-βξ-β̇ξ̇+γμ+γ̇μ̇-εκ-ε̇κ̇+ζλ̇-ζ̇λ+ην̇-η̇ν-ιο̇+ι̇ο)e1346",
    ///     "+2(+vι̇-αε̇+α̇ε+βν+β̇ν̇-γλ-γ̇λ̇+δκ+δ̇κ̇+ζμ̇-ζ̇μ+ηξ̇-η̇ξ+θο̇-θ̇ο)e1354",
    ///     "+2(+vκ̇-αο-α̇ο̇-βγ̇+β̇γ+δι+δ̇ι̇-εθ-ε̇θ̇-ζη̇+ζ̇η-λν̇+λ̇ν-μξ̇+μ̇ξ)e1256",
    ///     "+2(+vλ̇+αξ+α̇ξ̇-βδ̇+β̇δ-γι-γ̇ι̇+εη+ε̇η̇-ζθ̇+ζ̇θ+κν̇-κ̇ν-μο̇+μ̇ο)e1264",
    ///     "+2(+vμ̇-αν-α̇ν̇-βε̇+β̇ε+γθ+γ̇θ̇-δη-δ̇η̇-ζι̇+ζ̇ι+κξ̇-κ̇ξ+λο̇-λ̇ο)e1245",
    ///     "+2(+vν̇-αμ-α̇μ̇+βι+β̇ι̇-γδ̇+γ̇δ-εζ-ε̇ζ̇-ηθ̇+η̇θ-κλ̇+κ̇λ-ξο̇+ξ̇ο)e1236",
    ///     "+2(+vξ̇+αλ+α̇λ̇-βθ-β̇θ̇-γε̇+γ̇ε+δζ+δ̇ζ̇-ηι̇+η̇ι-κμ̇+κ̇μ+νο̇-ν̇ο)e1253",
    ///     "+2(+vο̇-ακ-α̇κ̇+βη+β̇η̇-γζ-γ̇ζ̇-δε̇+δ̇ε-θι̇+θ̇ι-λμ̇+λ̇μ-νξ̇+ν̇ξ)e1234",
    ///     "+2(+Ȧv+Ḃκ+Ċλ+Ḋμ-Ėη-Ḟθ-Ġι-Ḣε̇+İδ̇-J̇γ̇+K̇γ+L̇δ\
    ///         +Ṁε-Ṅι̇+Ȯθ̇-Ṗη̇-Q̇μ̇+Ṙλ̇-Ṡκ̇-Xζ̇+Yβ̇-Zα̇+Ðο-Øξ+Þν)e0465",
    ///     "+2(-Ȧκ+Ḃv+Ċν+Ḋξ+Ėζ+Ḟε̇-Ġδ̇-Ḣθ-İι+J̇β̇-K̇β+L̇ι̇\
    ///         -Ṁθ̇+Ṅδ+Ȯε+Ṗζ̇-Q̇ξ̇+Ṙν̇-Ṫκ̇-Xη̇+Yγ̇-Zο-Ðα̇+Øμ-Þλ)e0356",
    ///     "+2(-Ȧλ-Ḃν+Ċv+Ḋο-Ėε̇+Ḟζ+Ġγ̇+Ḣη-İβ̇-J̇ι-K̇ι̇-L̇β\
    ///         +Ṁη̇-Ṅγ-Ȯζ̇+Ṗε-Q̇ο̇+Ṡν̇-Ṫλ̇-Xθ̇+Yδ̇+Zξ-Ðμ-Øα̇+Þκ)e0364",
    ///     "+2(-Ȧμ-Ḃξ-Ċο+Ḋv+Ėδ̇-Ḟγ̇+Ġζ+Ḣβ̇+İη+J̇θ+K̇θ̇-L̇η̇\
    ///         -Ṁβ+Ṅζ̇-Ȯγ-Ṗδ-Ṙο̇+Ṡξ̇-Ṫμ̇-Xι̇+Yε̇-Zν+Ðλ-Øκ-Þα̇)e0345",
    ///     "+2(+Ȧη-Ḃζ-Ċε̇+Ḋδ̇+Ėv+Ḟν+Ġξ-Ḣλ-İμ-J̇α̇+K̇α+L̇μ̇\
    ///         -Ṁλ̇+Ṅξ̇-Ȯν̇+Q̇δ+Ṙε+Ṡζ̇+Ṫη̇-Xκ̇+Yο+Zγ̇-Ðβ̇-Øι+Þθ)e0265",
    ///     "+2(+Ȧθ+Ḃε̇-Ċζ-Ḋγ̇-Ėν+Ḟv+Ġο+Ḣκ+İα̇-J̇μ-K̇μ̇+L̇α\
    ///         +Ṁκ̇+Ṅο̇-Ṗν̇-Q̇γ-Ṙζ̇+Ṡε+Ṫθ̇-Xλ̇-Yξ+Zδ̇+Ðι-Øβ̇-Þη)e0246",
    ///     "+2(+Ȧι-Ḃδ̇+Ċγ̇-Ḋζ-Ėξ-Ḟο+Ġv-Ḣα̇+İκ+J̇λ+K̇λ̇-L̇κ̇\
    ///         +Ṁα+Ȯο̇-Ṗξ̇+Q̇ζ̇-Ṙγ-Ṡδ+Ṫι̇-Xμ̇+Yν+Zε̇-Ðθ+Øη-Þβ̇)e0254",
    ///     "+2(-Ȧε̇+Ḃθ-Ċη+Ḋβ̇+Ėλ-Ḟκ-Ġα̇+Ḣv+İο-J̇ξ-K̇ξ̇-L̇ο̇\
    ///         +Ṅα+Ȯκ̇+Ṗλ̇+Q̇β-Ṙη̇-Ṡθ̇+Ṫε-Xν̇+Yμ-Zι+Ðδ̇-Øγ̇+Þζ)e0263",
    ///     "+2(+Ȧδ̇+Ḃι-Ċβ̇-Ḋη+Ėμ+Ḟα̇-Ġκ-Ḣο+İv+J̇ν+K̇ν̇-Ṁο̇\
    ///         -Ṅκ̇+Ȯα+Ṗμ̇+Q̇η̇+Ṙβ-Ṡι̇-Ṫδ-Xξ̇-Yλ+Zθ+Ðε̇-Øζ-Þγ̇)e0235",
    ///     "+2(-Ȧγ̇+Ḃβ̇+Ċι-Ḋθ-Ėα̇+Ḟμ-Ġλ+Ḣξ-İν+J̇v+L̇ν̇+Ṁξ̇\
    ///         -Ṅλ̇-Ȯμ̇+Ṗα+Q̇θ̇+Ṙι̇+Ṡβ+Ṫγ-Xο̇+Yκ-Zη+Ðζ+Øε̇-Þδ̇)e0243",
    ///     "+2(-Ȧγ+Ḃβ-Ċι̇+Ḋθ̇-Ėα-Ḟμ̇+Ġλ̇-Ḣξ̇+İν̇+K̇v+L̇ν+Ṁξ\
    ///         -Ṅλ-Ȯμ-Ṗα̇+Q̇θ+Ṙι-Ṡβ̇-Ṫγ̇-Xο-Yκ̇+Zη̇-Ðζ̇+Øε-Þδ)e0156",
    ///     "+2(-Ȧδ+Ḃι̇+Ċβ-Ḋη̇+Ėμ̇-Ḟα-Ġκ̇-Ḣο̇+J̇ν̇-K̇ν+L̇v+Ṁο\
    ///         +Ṅκ+Ȯα̇-Ṗμ-Q̇η+Ṙβ̇+Ṡι-Ṫδ̇+Xξ-Yλ̇+Zθ̇-Ðε-Øζ̇+Þγ)e0164",
    ///     "+2(-Ȧε-Ḃθ̇+Ċη̇+Ḋβ-Ėλ̇+Ḟκ̇-Ġα-İο̇+J̇ξ̇-K̇ξ-L̇ο+Ṁv\
    ///         -Ṅα̇+Ȯκ+Ṗλ-Q̇β̇-Ṙη-Ṡθ-Ṫε̇-Xν-Yμ̇+Zι̇+Ðδ-Øγ-Þζ̇)e0145",
    ///     "+2(-Ȧι̇-Ḃδ+Ċγ+Ḋζ̇+Ėξ̇+Ḟο̇-Ḣα-İκ̇-J̇λ̇+K̇λ-L̇κ-Ṁα̇\
    ///         +Ṅv+Ȯο-Ṗξ+Q̇ζ+Ṙγ̇+Ṡδ̇+Ṫι-Xμ-Yν̇+Zε+Ðθ̇-Øη̇-Þβ)e0136",
    ///     "+2(+Ȧθ̇-Ḃε-Ċζ̇+Ḋγ-Ėν̇+Ġο̇+Ḣκ̇-İα-J̇μ̇+K̇μ+L̇α̇-Ṁκ\
    ///         -Ṅο+Ȯv+Ṗν-Q̇γ̇+Ṙζ+Ṡε̇-Ṫθ+Xλ-Yξ̇-Zδ+Ðι̇+Øβ-Þη̇)e0153",
    ///     "+2(-Ȧη̇+Ḃζ̇-Ċε+Ḋδ-Ḟν̇-Ġξ̇+Ḣλ̇+İμ̇-J̇α-K̇α̇+L̇μ-Ṁλ\
    ///         +Ṅξ-Ȯν+Ṗv-Q̇δ̇-Ṙε̇+Ṡζ+Ṫη-Xκ-Yο̇+Zγ-Ðβ+Øι̇-Þθ̇)e0134",
    ///     "+2(-Ȧμ̇-Ḃξ̇-Ċο̇-Ėδ+Ḟγ+Ġζ̇-Ḣβ+İη̇+J̇θ̇-K̇θ+L̇η-Ṁβ̇\
    ///         -Ṅζ-Ȯγ̇-Ṗδ̇+Q̇v+Ṙο-Ṡξ+Ṫμ+Xι-Yε-Zν̇+Ðλ̇-Øκ̇+Þα)e0162",
    ///     "+2(+Ȧλ̇+Ḃν̇-Ḋο̇-Ėε-Ḟζ̇+Ġγ-Ḣη̇-İβ+J̇ι̇-K̇ι+L̇β̇+Ṁη\
    ///         +Ṅγ̇-Ȯζ-Ṗε̇-Q̇ο+Ṙv+Ṡν-Ṫλ-Xθ+Yδ-Zξ̇+Ðμ̇-Øα-Þκ̇)e0125",
    ///     "+2(-Ȧκ̇+Ċν̇+Ḋξ̇+Ėζ̇-Ḟε+Ġδ-Ḣθ̇-İι̇-J̇β-K̇β̇-L̇ι+Ṁθ\
    ///         +Ṅδ̇+Ȯε̇-Ṗζ+Q̇ξ-Ṙν+Ṡv+Ṫκ+Xη-Yγ-Zο̇+Ðα+Øμ̇-Þλ̇)e0142",
    ///     "+2(-Ḃκ̇-Ċλ̇-Ḋμ̇+Ėη̇+Ḟθ̇+Ġι̇-Ḣε+İδ-J̇γ-K̇γ̇-L̇δ̇-Ṁε̇\
    ///         -Ṅι+Ȯθ-Ṗη-Q̇μ+Ṙλ-Ṡκ+Ṫv-Xζ+Yβ-Zα-Ðο̇+Øξ̇-Þν̇)e0123",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_motor() -> Self {
        Self::scalar() + Self::volume4() + Self::plane()
    }
    /// The multivector of simple triple motor $`m_{s3} \equiv s + v^4 + p + P_\infty`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let simple_triple_motor = Vee::plane().lhs() * Vee::plane().rhs();
    /// assert_eq!(simple_triple_motor.basis_blades(), Vee::simple_triple_motor().basis_blades());
    /// format_eq!(simple_triple_motor, [
    ///     "+α͔̇α͕̇+β͔̇β͕̇+γ͔̇γ͕̇+δ͔̇δ͕̇+ε͔̇ε͕̇+ζ͔̇ζ͕̇+η͔̇η͕̇+θ͔̇θ͕̇+ι͔̇ι͕̇+κ͔̇κ͕̇+λ͔̇λ͕̇+μ͔̇μ͕̇+ν͔̇ν͕̇+ξ͔̇ξ͕̇+ο͔̇ο͕̇",
    ///     "+(-Ȧ͔ζ͕̇+Ȧ͕ζ͔̇-Ḃ͔η͕̇+Ḃ͕η͔̇-Ċ͔θ͕̇+Ċ͕θ͔̇-Ḋ͔ι͕̇+Ḋ͕ι͔̇-Ė͔κ͕̇+Ė͕κ͔̇-Ḟ͔λ͕̇+Ḟ͕λ͔̇-Ġ͔μ͕̇+Ġ͕μ͔̇-Ḣ͔ν͕̇+Ḣ͕ν͔̇-İ͔ξ͕̇+İ͕ξ͔̇-J͔̇ο͕̇+J͕̇ο͔̇)e01",
    ///     "+(+Ȧ͔β͕̇-Ȧ͕β͔̇+Ḃ͔γ͕̇-Ḃ͕γ͔̇+Ċ͔δ͕̇-Ċ͕δ͔̇+Ḋ͔ε͕̇-Ḋ͕ε͔̇-K͔̇κ͕̇+K͕̇κ͔̇-L͔̇λ͕̇+L͕̇λ͔̇-Ṁ͔μ͕̇+Ṁ͕μ͔̇-Ṅ͔ν͕̇+Ṅ͕ν͔̇-Ȯ͔ξ͕̇+Ȯ͕ξ͔̇-Ṗ͔ο͕̇+Ṗ͕ο͔̇)e02",
    ///     "+(-Ȧ͔α͕̇+Ȧ͕α͔̇+Ė͔γ͕̇-Ė͕γ͔̇+Ḟ͔δ͕̇-Ḟ͕δ͔̇+Ġ͔ε͕̇-Ġ͕ε͔̇+K͔̇η͕̇-K͕̇η͔̇+L͔̇θ͕̇-L͕̇θ͔̇+Ṁ͔ι͕̇-Ṁ͕ι͔̇-Q͔̇ν͕̇+Q͕̇ν͔̇-Ṙ͔ξ͕̇+Ṙ͕ξ͔̇-Ṡ͔ο͕̇+Ṡ͕ο͔̇)e03",
    ///     "+(-Ḃ͔α͕̇+Ḃ͕α͔̇-Ė͔β͕̇+Ė͕β͔̇+Ḣ͔δ͕̇-Ḣ͕δ͔̇+İ͔ε͕̇-İ͕ε͔̇-K͔̇ζ͕̇+K͕̇ζ͔̇+Ṅ͔θ͕̇-Ṅ͕θ͔̇+Ȯ͔ι͕̇-Ȯ͕ι͔̇+Q͔̇λ͕̇-Q͕̇λ͔̇+Ṙ͔μ͕̇-Ṙ͕μ͔̇-Ṫ͔ο͕̇+Ṫ͕ο͔̇)e04",
    ///     "+(-Ċ͔α͕̇+Ċ͕α͔̇-Ḟ͔β͕̇+Ḟ͕β͔̇-Ḣ͔γ͕̇+Ḣ͕γ͔̇+J͔̇ε͕̇-J͕̇ε͔̇-L͔̇ζ͕̇+L͕̇ζ͔̇-Ṅ͔η͕̇+Ṅ͕η͔̇+Ṗ͔ι͕̇-Ṗ͕ι͔̇-Q͔̇κ͕̇+Q͕̇κ͔̇+Ṡ͔μ͕̇-Ṡ͕μ͔̇+Ṫ͔ξ͕̇-Ṫ͕ξ͔̇)e05",
    ///     "+(-Ḋ͔α͕̇+Ḋ͕α͔̇-Ġ͔β͕̇+Ġ͕β͔̇-İ͔γ͕̇+İ͕γ͔̇-J͔̇δ͕̇+J͕̇δ͔̇-Ṁ͔ζ͕̇+Ṁ͕ζ͔̇-Ȯ͔η͕̇+Ȯ͕η͔̇-Ṗ͔θ͕̇+Ṗ͕θ͔̇-Ṙ͔κ͕̇+Ṙ͕κ͔̇-Ṡ͔λ͕̇+Ṡ͕λ͔̇-Ṫ͔ν͕̇+Ṫ͕ν͔̇)e06",
    ///     "+(+β͔̇ζ͕̇-β͕̇ζ͔̇+γ͔̇η͕̇-γ͕̇η͔̇+δ͔̇θ͕̇-δ͕̇θ͔̇+ε͔̇ι͕̇-ε͕̇ι͔̇)e12",
    ///     "+(-α͔̇ζ͕̇+α͕̇ζ͔̇+γ͔̇κ͕̇-γ͕̇κ͔̇+δ͔̇λ͕̇-δ͕̇λ͔̇+ε͔̇μ͕̇-ε͕̇μ͔̇)e13",
    ///     "+(-α͔̇η͕̇+α͕̇η͔̇-β͔̇κ͕̇+β͕̇κ͔̇+δ͔̇ν͕̇-δ͕̇ν͔̇+ε͔̇ξ͕̇-ε͕̇ξ͔̇)e14",
    ///     "+(-α͔̇θ͕̇+α͕̇θ͔̇-β͔̇λ͕̇+β͕̇λ͔̇-γ͔̇ν͕̇+γ͕̇ν͔̇+ε͔̇ο͕̇-ε͕̇ο͔̇)e15",
    ///     "+(-α͔̇ι͕̇+α͕̇ι͔̇-β͔̇μ͕̇+β͕̇μ͔̇-γ͔̇ξ͕̇+γ͕̇ξ͔̇-δ͔̇ο͕̇+δ͕̇ο͔̇)e16",
    ///     "+(+α͔̇β͕̇-α͕̇β͔̇+η͔̇κ͕̇-η͕̇κ͔̇+θ͔̇λ͕̇-θ͕̇λ͔̇+ι͔̇μ͕̇-ι͕̇μ͔̇)e23",
    ///     "+(+α͔̇γ͕̇-α͕̇γ͔̇-ζ͔̇κ͕̇+ζ͕̇κ͔̇+θ͔̇ν͕̇-θ͕̇ν͔̇+ι͔̇ξ͕̇-ι͕̇ξ͔̇)e24",
    ///     "+(+α͔̇δ͕̇-α͕̇δ͔̇-ζ͔̇λ͕̇+ζ͕̇λ͔̇-η͔̇ν͕̇+η͕̇ν͔̇+ι͔̇ο͕̇-ι͕̇ο͔̇)e25",
    ///     "+(+α͔̇ε͕̇-α͕̇ε͔̇-ζ͔̇μ͕̇+ζ͕̇μ͔̇-η͔̇ξ͕̇+η͕̇ξ͔̇-θ͔̇ο͕̇+θ͕̇ο͔̇)e26",
    ///     "+(+β͔̇γ͕̇-β͕̇γ͔̇+ζ͔̇η͕̇-ζ͕̇η͔̇+λ͔̇ν͕̇-λ͕̇ν͔̇+μ͔̇ξ͕̇-μ͕̇ξ͔̇)e34",
    ///     "+(+β͔̇δ͕̇-β͕̇δ͔̇+ζ͔̇θ͕̇-ζ͕̇θ͔̇-κ͔̇ν͕̇+κ͕̇ν͔̇+μ͔̇ο͕̇-μ͕̇ο͔̇)e35",
    ///     "+(+β͔̇ε͕̇-β͕̇ε͔̇+ζ͔̇ι͕̇-ζ͕̇ι͔̇-κ͔̇ξ͕̇+κ͕̇ξ͔̇-λ͔̇ο͕̇+λ͕̇ο͔̇)e36",
    ///     "+(+γ͔̇δ͕̇-γ͕̇δ͔̇+η͔̇θ͕̇-η͕̇θ͔̇+κ͔̇λ͕̇-κ͕̇λ͔̇+ξ͔̇ο͕̇-ξ͕̇ο͔̇)e45",
    ///     "+(+γ͔̇ε͕̇-γ͕̇ε͔̇+η͔̇ι͕̇-η͕̇ι͔̇+κ͔̇μ͕̇-κ͕̇μ͔̇-ν͔̇ο͕̇+ν͕̇ο͔̇)e46",
    ///     "+(+δ͔̇ε͕̇-δ͕̇ε͔̇+θ͔̇ι͕̇-θ͕̇ι͔̇+λ͔̇μ͕̇-λ͕̇μ͔̇+ν͔̇ξ͕̇-ν͕̇ξ͔̇)e56",
    ///     "+(-κ͔̇ο͕̇-κ͕̇ο͔̇+λ͔̇ξ͕̇+λ͕̇ξ͔̇-μ͔̇ν͕̇-μ͕̇ν͔̇)e3456",
    ///     "+(+η͔̇ο͕̇+η͕̇ο͔̇-θ͔̇ξ͕̇-θ͕̇ξ͔̇+ι͔̇ν͕̇+ι͕̇ν͔̇)e2465",
    ///     "+(-ζ͔̇ο͕̇-ζ͕̇ο͔̇+θ͔̇μ͕̇+θ͕̇μ͔̇-ι͔̇λ͕̇-ι͕̇λ͔̇)e2356",
    ///     "+(+ζ͔̇ξ͕̇+ζ͕̇ξ͔̇-η͔̇μ͕̇-η͕̇μ͔̇+ι͔̇κ͕̇+ι͕̇κ͔̇)e2364",
    ///     "+(-ζ͔̇ν͕̇-ζ͕̇ν͔̇+η͔̇λ͕̇+η͕̇λ͔̇-θ͔̇κ͕̇-θ͕̇κ͔̇)e2345",
    ///     "+(-γ͔̇ο͕̇-γ͕̇ο͔̇+δ͔̇ξ͕̇+δ͕̇ξ͔̇-ε͔̇ν͕̇-ε͕̇ν͔̇)e1456",
    ///     "+(+β͔̇ο͕̇+β͕̇ο͔̇-δ͔̇μ͕̇-δ͕̇μ͔̇+ε͔̇λ͕̇+ε͕̇λ͔̇)e1365",
    ///     "+(-β͔̇ξ͕̇-β͕̇ξ͔̇+γ͔̇μ͕̇+γ͕̇μ͔̇-ε͔̇κ͕̇-ε͕̇κ͔̇)e1346",
    ///     "+(+β͔̇ν͕̇+β͕̇ν͔̇-γ͔̇λ͕̇-γ͕̇λ͔̇+δ͔̇κ͕̇+δ͕̇κ͔̇)e1354",
    ///     "+(-α͔̇ο͕̇-α͕̇ο͔̇+δ͔̇ι͕̇+δ͕̇ι͔̇-ε͔̇θ͕̇-ε͕̇θ͔̇)e1256",
    ///     "+(+α͔̇ξ͕̇+α͕̇ξ͔̇-γ͔̇ι͕̇-γ͕̇ι͔̇+ε͔̇η͕̇+ε͕̇η͔̇)e1264",
    ///     "+(-α͔̇ν͕̇-α͕̇ν͔̇+γ͔̇θ͕̇+γ͕̇θ͔̇-δ͔̇η͕̇-δ͕̇η͔̇)e1245",
    ///     "+(-α͔̇μ͕̇-α͕̇μ͔̇+β͔̇ι͕̇+β͕̇ι͔̇-ε͔̇ζ͕̇-ε͕̇ζ͔̇)e1236",
    ///     "+(+α͔̇λ͕̇+α͕̇λ͔̇-β͔̇θ͕̇-β͕̇θ͔̇+δ͔̇ζ͕̇+δ͕̇ζ͔̇)e1253",
    ///     "+(-α͔̇κ͕̇-α͕̇κ͔̇+β͔̇η͕̇+β͕̇η͔̇-γ͔̇ζ͕̇-γ͕̇ζ͔̇)e1234",
    ///     "+(-Ḣ͔ε͕̇-Ḣ͕ε͔̇+İ͔δ͕̇+İ͕δ͔̇-J͔̇γ͕̇-J͕̇γ͔̇-Ṅ͔ι͕̇-Ṅ͕ι͔̇+Ȯ͔θ͕̇+Ȯ͕θ͔̇-Ṗ͔η͕̇-Ṗ͕η͔̇-Q͔̇μ͕̇-Q͕̇μ͔̇+Ṙ͔λ͕̇+Ṙ͕λ͔̇-Ṡ͔κ͕̇-Ṡ͕κ͔̇)e0465",
    ///     "+(+Ḟ͔ε͕̇+Ḟ͕ε͔̇-Ġ͔δ͕̇-Ġ͕δ͔̇+J͔̇β͕̇+J͕̇β͔̇+L͔̇ι͕̇+L͕̇ι͔̇-Ṁ͔θ͕̇-Ṁ͕θ͔̇+Ṗ͔ζ͕̇+Ṗ͕ζ͔̇-Q͔̇ξ͕̇-Q͕̇ξ͔̇+Ṙ͔ν͕̇+Ṙ͕ν͔̇-Ṫ͔κ͕̇-Ṫ͕κ͔̇)e0356",
    ///     "+(-Ė͔ε͕̇-Ė͕ε͔̇+Ġ͔γ͕̇+Ġ͕γ͔̇-İ͔β͕̇-İ͕β͔̇-K͔̇ι͕̇-K͕̇ι͔̇+Ṁ͔η͕̇+Ṁ͕η͔̇-Ȯ͔ζ͕̇-Ȯ͕ζ͔̇-Q͔̇ο͕̇-Q͕̇ο͔̇+Ṡ͔ν͕̇+Ṡ͕ν͔̇-Ṫ͔λ͕̇-Ṫ͕λ͔̇)e0364",
    ///     "+(+Ė͔δ͕̇+Ė͕δ͔̇-Ḟ͔γ͕̇-Ḟ͕γ͔̇+Ḣ͔β͕̇+Ḣ͕β͔̇+K͔̇θ͕̇+K͕̇θ͔̇-L͔̇η͕̇-L͕̇η͔̇+Ṅ͔ζ͕̇+Ṅ͕ζ͔̇-Ṙ͔ο͕̇-Ṙ͕ο͔̇+Ṡ͔ξ͕̇+Ṡ͕ξ͔̇-Ṫ͔μ͕̇-Ṫ͕μ͔̇)e0345",
    ///     "+(-Ċ͔ε͕̇-Ċ͕ε͔̇+Ḋ͔δ͕̇+Ḋ͕δ͔̇-J͔̇α͕̇-J͕̇α͔̇+L͔̇μ͕̇+L͕̇μ͔̇-Ṁ͔λ͕̇-Ṁ͕λ͔̇+Ṅ͔ξ͕̇+Ṅ͕ξ͔̇-Ȯ͔ν͕̇-Ȯ͕ν͔̇+Ṡ͔ζ͕̇+Ṡ͕ζ͔̇+Ṫ͔η͕̇+Ṫ͕η͔̇)e0265",
    ///     "+(+Ḃ͔ε͕̇+Ḃ͕ε͔̇-Ḋ͔γ͕̇-Ḋ͕γ͔̇+İ͔α͕̇+İ͕α͔̇-K͔̇μ͕̇-K͕̇μ͔̇+Ṁ͔κ͕̇+Ṁ͕κ͔̇+Ṅ͔ο͕̇+Ṅ͕ο͔̇-Ṗ͔ν͕̇-Ṗ͕ν͔̇-Ṙ͔ζ͕̇-Ṙ͕ζ͔̇+Ṫ͔θ͕̇+Ṫ͕θ͔̇)e0246",
    ///     "+(-Ḃ͔δ͕̇-Ḃ͕δ͔̇+Ċ͔γ͕̇+Ċ͕γ͔̇-Ḣ͔α͕̇-Ḣ͕α͔̇+K͔̇λ͕̇+K͕̇λ͔̇-L͔̇κ͕̇-L͕̇κ͔̇+Ȯ͔ο͕̇+Ȯ͕ο͔̇-Ṗ͔ξ͕̇-Ṗ͕ξ͔̇+Q͔̇ζ͕̇+Q͕̇ζ͔̇+Ṫ͔ι͕̇+Ṫ͕ι͔̇)e0254",
    ///     "+(-Ȧ͔ε͕̇-Ȧ͕ε͔̇+Ḋ͔β͕̇+Ḋ͕β͔̇-Ġ͔α͕̇-Ġ͕α͔̇-K͔̇ξ͕̇-K͕̇ξ͔̇-L͔̇ο͕̇-L͕̇ο͔̇+Ȯ͔κ͕̇+Ȯ͕κ͔̇+Ṗ͔λ͕̇+Ṗ͕λ͔̇-Ṙ͔η͕̇-Ṙ͕η͔̇-Ṡ͔θ͕̇-Ṡ͕θ͔̇)e0263",
    ///     "+(+Ȧ͔δ͕̇+Ȧ͕δ͔̇-Ċ͔β͕̇-Ċ͕β͔̇+Ḟ͔α͕̇+Ḟ͕α͔̇+K͔̇ν͕̇+K͕̇ν͔̇-Ṁ͔ο͕̇-Ṁ͕ο͔̇-Ṅ͔κ͕̇-Ṅ͕κ͔̇+Ṗ͔μ͕̇+Ṗ͕μ͔̇+Q͔̇η͕̇+Q͕̇η͔̇-Ṡ͔ι͕̇-Ṡ͕ι͔̇)e0235",
    ///     "+(-Ȧ͔γ͕̇-Ȧ͕γ͔̇+Ḃ͔β͕̇+Ḃ͕β͔̇-Ė͔α͕̇-Ė͕α͔̇+L͔̇ν͕̇+L͕̇ν͔̇+Ṁ͔ξ͕̇+Ṁ͕ξ͔̇-Ṅ͔λ͕̇-Ṅ͕λ͔̇-Ȯ͔μ͕̇-Ȯ͕μ͔̇+Q͔̇θ͕̇+Q͕̇θ͔̇+Ṙ͔ι͕̇+Ṙ͕ι͔̇)e0243",
    ///     "+(-Ċ͔ι͕̇-Ċ͕ι͔̇+Ḋ͔θ͕̇+Ḋ͕θ͔̇-Ḟ͔μ͕̇-Ḟ͕μ͔̇+Ġ͔λ͕̇+Ġ͕λ͔̇-Ḣ͔ξ͕̇-Ḣ͕ξ͔̇+İ͔ν͕̇+İ͕ν͔̇-Ṗ͔α͕̇-Ṗ͕α͔̇-Ṡ͔β͕̇-Ṡ͕β͔̇-Ṫ͔γ͕̇-Ṫ͕γ͔̇)e0156",
    ///     "+(+Ḃ͔ι͕̇+Ḃ͕ι͔̇-Ḋ͔η͕̇-Ḋ͕η͔̇+Ė͔μ͕̇+Ė͕μ͔̇-Ġ͔κ͕̇-Ġ͕κ͔̇-Ḣ͔ο͕̇-Ḣ͕ο͔̇+J͔̇ν͕̇+J͕̇ν͔̇+Ȯ͔α͕̇+Ȯ͕α͔̇+Ṙ͔β͕̇+Ṙ͕β͔̇-Ṫ͔δ͕̇-Ṫ͕δ͔̇)e0164",
    ///     "+(-Ḃ͔θ͕̇-Ḃ͕θ͔̇+Ċ͔η͕̇+Ċ͕η͔̇-Ė͔λ͕̇-Ė͕λ͔̇+Ḟ͔κ͕̇+Ḟ͕κ͔̇-İ͔ο͕̇-İ͕ο͔̇+J͔̇ξ͕̇+J͕̇ξ͔̇-Ṅ͔α͕̇-Ṅ͕α͔̇-Q͔̇β͕̇-Q͕̇β͔̇-Ṫ͔ε͕̇-Ṫ͕ε͔̇)e0145",
    ///     "+(-Ȧ͔ι͕̇-Ȧ͕ι͔̇+Ḋ͔ζ͕̇+Ḋ͕ζ͔̇+Ė͔ξ͕̇+Ė͕ξ͔̇+Ḟ͔ο͕̇+Ḟ͕ο͔̇-İ͔κ͕̇-İ͕κ͔̇-J͔̇λ͕̇-J͕̇λ͔̇-Ṁ͔α͕̇-Ṁ͕α͔̇+Ṙ͔γ͕̇+Ṙ͕γ͔̇+Ṡ͔δ͕̇+Ṡ͕δ͔̇)e0136",
    ///     "+(+Ȧ͔θ͕̇+Ȧ͕θ͔̇-Ċ͔ζ͕̇-Ċ͕ζ͔̇-Ė͔ν͕̇-Ė͕ν͔̇+Ġ͔ο͕̇+Ġ͕ο͔̇+Ḣ͔κ͕̇+Ḣ͕κ͔̇-J͔̇μ͕̇-J͕̇μ͔̇+L͔̇α͕̇+L͕̇α͔̇-Q͔̇γ͕̇-Q͕̇γ͔̇+Ṡ͔ε͕̇+Ṡ͕ε͔̇)e0153",
    ///     "+(-Ȧ͔η͕̇-Ȧ͕η͔̇+Ḃ͔ζ͕̇+Ḃ͕ζ͔̇-Ḟ͔ν͕̇-Ḟ͕ν͔̇-Ġ͔ξ͕̇-Ġ͕ξ͔̇+Ḣ͔λ͕̇+Ḣ͕λ͔̇+İ͔μ͕̇+İ͕μ͔̇-K͔̇α͕̇-K͕̇α͔̇-Q͔̇δ͕̇-Q͕̇δ͔̇-Ṙ͔ε͕̇-Ṙ͕ε͔̇)e0134",
    ///     "+(-Ȧ͔μ͕̇-Ȧ͕μ͔̇-Ḃ͔ξ͕̇-Ḃ͕ξ͔̇-Ċ͔ο͕̇-Ċ͕ο͔̇+Ġ͔ζ͕̇+Ġ͕ζ͔̇+İ͔η͕̇+İ͕η͔̇+J͔̇θ͕̇+J͕̇θ͔̇-Ṁ͔β͕̇-Ṁ͕β͔̇-Ȯ͔γ͕̇-Ȯ͕γ͔̇-Ṗ͔δ͕̇-Ṗ͕δ͔̇)e0162",
    ///     "+(+Ȧ͔λ͕̇+Ȧ͕λ͔̇+Ḃ͔ν͕̇+Ḃ͕ν͔̇-Ḋ͔ο͕̇-Ḋ͕ο͔̇-Ḟ͔ζ͕̇-Ḟ͕ζ͔̇-Ḣ͔η͕̇-Ḣ͕η͔̇+J͔̇ι͕̇+J͕̇ι͔̇+L͔̇β͕̇+L͕̇β͔̇+Ṅ͔γ͕̇+Ṅ͕γ͔̇-Ṗ͔ε͕̇-Ṗ͕ε͔̇)e0125",
    ///     "+(-Ȧ͔κ͕̇-Ȧ͕κ͔̇+Ċ͔ν͕̇+Ċ͕ν͔̇+Ḋ͔ξ͕̇+Ḋ͕ξ͔̇+Ė͔ζ͕̇+Ė͕ζ͔̇-Ḣ͔θ͕̇-Ḣ͕θ͔̇-İ͔ι͕̇-İ͕ι͔̇-K͔̇β͕̇-K͕̇β͔̇+Ṅ͔δ͕̇+Ṅ͕δ͔̇+Ȯ͔ε͕̇+Ȯ͕ε͔̇)e0142",
    ///     "+(-Ḃ͔κ͕̇-Ḃ͕κ͔̇-Ċ͔λ͕̇-Ċ͕λ͔̇-Ḋ͔μ͕̇-Ḋ͕μ͔̇+Ė͔η͕̇+Ė͕η͔̇+Ḟ͔θ͕̇+Ḟ͕θ͔̇+Ġ͔ι͕̇+Ġ͕ι͔̇-K͔̇γ͕̇-K͕̇γ͔̇-L͔̇δ͕̇-L͕̇δ͔̇-Ṁ͔ε͕̇-Ṁ͕ε͔̇)e0123",
    ///     "+(-K͔̇ο͕̇+K͕̇ο͔̇+L͔̇ξ͕̇-L͕̇ξ͔̇-Ṁ͔ν͕̇+Ṁ͕ν͔̇-Ṅ͔μ͕̇+Ṅ͕μ͔̇+Ȯ͔λ͕̇-Ȯ͕λ͔̇-Ṗ͔κ͕̇+Ṗ͕κ͔̇+Q͔̇ι͕̇-Q͕̇ι͔̇-Ṙ͔θ͕̇+Ṙ͕θ͔̇+Ṡ͔η͕̇-Ṡ͕η͔̇-Ṫ͔ζ͕̇+Ṫ͕ζ͔̇)e023465",
    ///     "+(+Ė͔ο͕̇-Ė͕ο͔̇-Ḟ͔ξ͕̇+Ḟ͕ξ͔̇+Ġ͔ν͕̇-Ġ͕ν͔̇+Ḣ͔μ͕̇-Ḣ͕μ͔̇-İ͔λ͕̇+İ͕λ͔̇+J͔̇κ͕̇-J͕̇κ͔̇-Q͔̇ε͕̇+Q͕̇ε͔̇+Ṙ͔δ͕̇-Ṙ͕δ͔̇-Ṡ͔γ͕̇+Ṡ͕γ͔̇+Ṫ͔β͕̇-Ṫ͕β͔̇)e013456",
    ///     "+(-Ḃ͔ο͕̇+Ḃ͕ο͔̇+Ċ͔ξ͕̇-Ċ͕ξ͔̇-Ḋ͔ν͕̇+Ḋ͕ν͔̇-Ḣ͔ι͕̇+Ḣ͕ι͔̇+İ͔θ͕̇-İ͕θ͔̇-J͔̇η͕̇+J͕̇η͔̇+Ṅ͔ε͕̇-Ṅ͕ε͔̇-Ȯ͔δ͕̇+Ȯ͕δ͔̇+Ṗ͔γ͕̇-Ṗ͕γ͔̇-Ṫ͔α͕̇+Ṫ͕α͔̇)e012465",
    ///     "+(+Ȧ͔ο͕̇-Ȧ͕ο͔̇-Ċ͔μ͕̇+Ċ͕μ͔̇+Ḋ͔λ͕̇-Ḋ͕λ͔̇+Ḟ͔ι͕̇-Ḟ͕ι͔̇-Ġ͔θ͕̇+Ġ͕θ͔̇+J͔̇ζ͕̇-J͕̇ζ͔̇-L͔̇ε͕̇+L͕̇ε͔̇+Ṁ͔δ͕̇-Ṁ͕δ͔̇-Ṗ͔β͕̇+Ṗ͕β͔̇+Ṡ͔α͕̇-Ṡ͕α͔̇)e012356",
    ///     "+(-Ȧ͔ξ͕̇+Ȧ͕ξ͔̇+Ḃ͔μ͕̇-Ḃ͕μ͔̇-Ḋ͔κ͕̇+Ḋ͕κ͔̇-Ė͔ι͕̇+Ė͕ι͔̇+Ġ͔η͕̇-Ġ͕η͔̇-İ͔ζ͕̇+İ͕ζ͔̇+K͔̇ε͕̇-K͕̇ε͔̇-Ṁ͔γ͕̇+Ṁ͕γ͔̇+Ȯ͔β͕̇-Ȯ͕β͔̇-Ṙ͔α͕̇+Ṙ͕α͔̇)e012364",
    ///     "+(+Ȧ͔ν͕̇-Ȧ͕ν͔̇-Ḃ͔λ͕̇+Ḃ͕λ͔̇+Ċ͔κ͕̇-Ċ͕κ͔̇+Ė͔θ͕̇-Ė͕θ͔̇-Ḟ͔η͕̇+Ḟ͕η͔̇+Ḣ͔ζ͕̇-Ḣ͕ζ͔̇-K͔̇δ͕̇+K͕̇δ͔̇+L͔̇γ͕̇-L͕̇γ͔̇-Ṅ͔β͕̇+Ṅ͕β͔̇+Q͔̇α͕̇-Q͕̇α͔̇)e012345",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_triple_motor() -> Self {
        Self::scalar() + Self::volume4() + Self::plane() + Self::direction()
    }
    /// The multivector of triple motor $`m_3 \equiv s + v^4 + p + P`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP6 as Vee};
    ///
    /// let triple_motor = Vee::triple_rotator().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(triple_motor.basis_blades(), Vee::triple_motor().basis_blades());
    /// format_eq!(triple_motor, [
    ///     "+v͔v͕",
    ///     "+(+X͕v͔+Y͕α͔+Z͕β͔+Ð͕γ͔+Ø͕δ͔+Þ͕ε͔)e01",
    ///     "+(-X͕α͔+Y͕v͔+Z͕ζ͔+Ð͕η͔+Ø͕θ͔+Þ͕ι͔)e02",
    ///     "+(-X͕β͔-Y͕ζ͔+Z͕v͔+Ð͕κ͔+Ø͕λ͔+Þ͕μ͔)e03",
    ///     "+(-X͕γ͔-Y͕η͔-Z͕κ͔+v͔Ð͕+Ø͕ν͔+Þ͕ξ͔)e04",
    ///     "+(-X͕δ͔-Y͕θ͔-Z͕λ͔+v͔Ø͕-Ð͕ν͔+Þ͕ο͔)e05",
    ///     "+(-X͕ε͔-Y͕ι͔-Z͕μ͔+v͔Þ͕-Ð͕ξ͔-Ø͕ο͔)e06",
    ///     "+v͕α͔e12",
    ///     "+v͕β͔e13",
    ///     "+v͕γ͔e14",
    ///     "+v͕δ͔e15",
    ///     "+v͕ε͔e16",
    ///     "+v͕ζ͔e23",
    ///     "+v͕η͔e24",
    ///     "+v͕θ͔e25",
    ///     "+v͕ι͔e26",
    ///     "+v͕κ͔e34",
    ///     "+v͕λ͔e35",
    ///     "+v͕μ͔e36",
    ///     "+v͕ν͔e45",
    ///     "+v͕ξ͔e46",
    ///     "+v͕ο͔e56",
    ///     "+v͕α͔̇e3456",
    ///     "+v͕β͔̇e2465",
    ///     "+v͕γ͔̇e2356",
    ///     "+v͕δ͔̇e2364",
    ///     "+v͕ε͔̇e2345",
    ///     "+v͕ζ͔̇e1456",
    ///     "+v͕η͔̇e1365",
    ///     "+v͕θ͔̇e1346",
    ///     "+v͕ι͔̇e1354",
    ///     "+v͕κ͔̇e1256",
    ///     "+v͕λ͔̇e1264",
    ///     "+v͕μ͔̇e1245",
    ///     "+v͕ν͔̇e1236",
    ///     "+v͕ξ͔̇e1253",
    ///     "+v͕ο͔̇e1234",
    ///     "+(+X͕ζ͔̇-Y͕β͔̇+Z͕α͔̇-Ð͕ο͔+Ø͕ξ͔-Þ͕ν͔)e0465",
    ///     "+(+X͕η͔̇-Y͕γ͔̇+Z͕ο͔+Ð͕α͔̇-Ø͕μ͔+Þ͕λ͔)e0356",
    ///     "+(+X͕θ͔̇-Y͕δ͔̇-Z͕ξ͔+Ð͕μ͔+Ø͕α͔̇-Þ͕κ͔)e0364",
    ///     "+(+X͕ι͔̇-Y͕ε͔̇+Z͕ν͔-Ð͕λ͔+Ø͕κ͔+Þ͕α͔̇)e0345",
    ///     "+(+X͕κ͔̇-Y͕ο͔-Z͕γ͔̇+Ð͕β͔̇+Ø͕ι͔-Þ͕θ͔)e0265",
    ///     "+(+X͕λ͔̇+Y͕ξ͔-Z͕δ͔̇-Ð͕ι͔+Ø͕β͔̇+Þ͕η͔)e0246",
    ///     "+(+X͕μ͔̇-Y͕ν͔-Z͕ε͔̇+Ð͕θ͔-Ø͕η͔+Þ͕β͔̇)e0254",
    ///     "+(+X͕ν͔̇-Y͕μ͔+Z͕ι͔-Ð͕δ͔̇+Ø͕γ͔̇-Þ͕ζ͔)e0263",
    ///     "+(+X͕ξ͔̇+Y͕λ͔-Z͕θ͔-Ð͕ε͔̇+Ø͕ζ͔+Þ͕γ͔̇)e0235",
    ///     "+(+X͕ο͔̇-Y͕κ͔+Z͕η͔-Ð͕ζ͔-Ø͕ε͔̇+Þ͕δ͔̇)e0243",
    ///     "+(+X͕ο͔+Y͕κ͔̇-Z͕η͔̇+Ð͕ζ͔̇-Ø͕ε͔+Þ͕δ͔)e0156",
    ///     "+(-X͕ξ͔+Y͕λ͔̇-Z͕θ͔̇+Ð͕ε͔+Ø͕ζ͔̇-Þ͕γ͔)e0164",
    ///     "+(+X͕ν͔+Y͕μ͔̇-Z͕ι͔̇-Ð͕δ͔+Ø͕γ͔+Þ͕ζ͔̇)e0145",
    ///     "+(+X͕μ͔+Y͕ν͔̇-Z͕ε͔-Ð͕θ͔̇+Ø͕η͔̇+Þ͕β͔)e0136",
    ///     "+(-X͕λ͔+Y͕ξ͔̇+Z͕δ͔-Ð͕ι͔̇-Ø͕β͔+Þ͕η͔̇)e0153",
    ///     "+(+X͕κ͔+Y͕ο͔̇-Z͕γ͔+Ð͕β͔-Ø͕ι͔̇+Þ͕θ͔̇)e0134",
    ///     "+(-X͕ι͔+Y͕ε͔+Z͕ν͔̇-Ð͕λ͔̇+Ø͕κ͔̇-Þ͕α͔)e0162",
    ///     "+(+X͕θ͔-Y͕δ͔+Z͕ξ͔̇-Ð͕μ͔̇+Ø͕α͔+Þ͕κ͔̇)e0125",
    ///     "+(-X͕η͔+Y͕γ͔+Z͕ο͔̇-Ð͕α͔-Ø͕μ͔̇+Þ͕λ͔̇)e0142",
    ///     "+(+X͕ζ͔-Y͕β͔+Z͕α͔+Ð͕ο͔̇-Ø͕ξ͔̇+Þ͕ν͔̇)e0123",
    ///     "+v͕ẇ͔e123456",
    ///     "+(+X͕ẇ͔-Y͕α͔̇-Z͕β͔̇-Ð͕γ͔̇-Ø͕δ͔̇-Þ͕ε͔̇)e023465",
    ///     "+(+X͕α͔̇+Y͕ẇ͔-Z͕ζ͔̇-Ð͕η͔̇-Ø͕θ͔̇-Þ͕ι͔̇)e013456",
    ///     "+(+X͕β͔̇+Y͕ζ͔̇+Z͕ẇ͔-Ð͕κ͔̇-Ø͕λ͔̇-Þ͕μ͔̇)e012465",
    ///     "+(+X͕γ͔̇+Y͕η͔̇+Z͕κ͔̇+ẇ͔Ð͕-Ø͕ν͔̇-Þ͕ξ͔̇)e012356",
    ///     "+(+X͕δ͔̇+Y͕θ͔̇+Z͕λ͔̇+ẇ͔Ø͕+Ð͕ν͔̇-Þ͕ο͔̇)e012364",
    ///     "+(+X͕ε͔̇+Y͕ι͔̇+Z͕μ͔̇+ẇ͔Þ͕+Ð͕ξ͔̇+Ø͕ο͔̇)e012345",
    /// ]);
    ///
    /// let norm_squared = Vee::triple_motor().norm_squared();
    ///
    /// assert_eq!(norm_squared.basis_blades(), Vee::norm().basis_blades());
    /// format_eq!(norm_squared, [
    ///     "+vv+ẇẇ+αα+α̇α̇+ββ+β̇β̇+γγ+γ̇γ̇+δδ+δ̇δ̇+εε+ε̇ε̇+ζζ+ζ̇ζ̇+ηη+η̇η̇\
    ///      +θθ+θ̇θ̇+ιι+ι̇ι̇+κκ+κ̇κ̇+λλ+λ̇λ̇+μμ+μ̇μ̇+νν+ν̇ν̇+ξξ+ξ̇ξ̇+οο+ο̇ο̇",
    ///     "+2(+vα̇+ẇα-βζ̇+β̇ζ-γη̇+γ̇η-δθ̇+δ̇θ-ει̇+ε̇ι-κο-κ̇ο̇+λξ+λ̇ξ̇-μν-μ̇ν̇)e3456",
    ///     "+2(+vβ̇+ẇβ+αζ̇-α̇ζ-γκ̇+γ̇κ-δλ̇+δ̇λ-εμ̇+ε̇μ+ηο+η̇ο̇-θξ-θ̇ξ̇+ιν+ι̇ν̇)e2465",
    ///     "+2(+vγ̇+ẇγ+αη̇-α̇η+βκ̇-β̇κ-δν̇+δ̇ν-εξ̇+ε̇ξ-ζο-ζ̇ο̇+θμ+θ̇μ̇-ιλ-ι̇λ̇)e2356",
    ///     "+2(+vδ̇+ẇδ+αθ̇-α̇θ+βλ̇-β̇λ+γν̇-γ̇ν-εο̇+ε̇ο+ζξ+ζ̇ξ̇-ημ-η̇μ̇+ικ+ι̇κ̇)e2364",
    ///     "+2(+vε̇+ẇε+αι̇-α̇ι+βμ̇-β̇μ+γξ̇-γ̇ξ+δο̇-δ̇ο-ζν-ζ̇ν̇+ηλ+η̇λ̇-θκ-θ̇κ̇)e2345",
    ///     "+2(+vζ̇+ẇζ-αβ̇+α̇β-γο-γ̇ο̇+δξ+δ̇ξ̇-εν-ε̇ν̇-ηκ̇+η̇κ-θλ̇+θ̇λ-ιμ̇+ι̇μ)e1456",
    ///     "+2(+vη̇+ẇη-αγ̇+α̇γ+βο+β̇ο̇-δμ-δ̇μ̇+ελ+ε̇λ̇+ζκ̇-ζ̇κ-θν̇+θ̇ν-ιξ̇+ι̇ξ)e1365",
    ///     "+2(+vθ̇+ẇθ-αδ̇+α̇δ-βξ-β̇ξ̇+γμ+γ̇μ̇-εκ-ε̇κ̇+ζλ̇-ζ̇λ+ην̇-η̇ν-ιο̇+ι̇ο)e1346",
    ///     "+2(+vι̇+ẇι-αε̇+α̇ε+βν+β̇ν̇-γλ-γ̇λ̇+δκ+δ̇κ̇+ζμ̇-ζ̇μ+ηξ̇-η̇ξ+θο̇-θ̇ο)e1354",
    ///     "+2(+vκ̇+ẇκ-αο-α̇ο̇-βγ̇+β̇γ+δι+δ̇ι̇-εθ-ε̇θ̇-ζη̇+ζ̇η-λν̇+λ̇ν-μξ̇+μ̇ξ)e1256",
    ///     "+2(+vλ̇+ẇλ+αξ+α̇ξ̇-βδ̇+β̇δ-γι-γ̇ι̇+εη+ε̇η̇-ζθ̇+ζ̇θ+κν̇-κ̇ν-μο̇+μ̇ο)e1264",
    ///     "+2(+vμ̇+ẇμ-αν-α̇ν̇-βε̇+β̇ε+γθ+γ̇θ̇-δη-δ̇η̇-ζι̇+ζ̇ι+κξ̇-κ̇ξ+λο̇-λ̇ο)e1245",
    ///     "+2(+vν̇+ẇν-αμ-α̇μ̇+βι+β̇ι̇-γδ̇+γ̇δ-εζ-ε̇ζ̇-ηθ̇+η̇θ-κλ̇+κ̇λ-ξο̇+ξ̇ο)e1236",
    ///     "+2(+vξ̇+ẇξ+αλ+α̇λ̇-βθ-β̇θ̇-γε̇+γ̇ε+δζ+δ̇ζ̇-ηι̇+η̇ι-κμ̇+κ̇μ+νο̇-ν̇ο)e1253",
    ///     "+2(+vο̇+ẇο-ακ-α̇κ̇+βη+β̇η̇-γζ-γ̇ζ̇-δε̇+δ̇ε-θι̇+θ̇ι-λμ̇+λ̇μ-νξ̇+ν̇ξ)e1234",
    ///     "+2(+Ȧv+Ḃκ+Ċλ+Ḋμ-Ėη-Ḟθ-Ġι-Ḣε̇+İδ̇-J̇γ̇+K̇γ+L̇δ+Ṁε-Ṅι̇+Ȯθ̇-Ṗη̇\
    ///         -Q̇μ̇+Ṙλ̇-Ṡκ̇-Ṫẇ-Xζ̇+Ẋζ+Yβ̇-Ẏβ-Zα̇+Żα+Ðο+Ð̇ο̇-Øξ-Ø̇ξ̇+Þν+Þ̇ν̇)e0465",
    ///     "+2(-Ȧκ+Ḃv+Ċν+Ḋξ+Ėζ+Ḟε̇-Ġδ̇-Ḣθ-İι+J̇β̇-K̇β+L̇ι̇-Ṁθ̇+Ṅδ+Ȯε+Ṗζ̇\
    ///         -Q̇ξ̇+Ṙν̇+Ṡẇ-Ṫκ̇-Xη̇+Ẋη+Yγ̇-Ẏγ-Zο-Żο̇-Ðα̇+Ð̇α+Øμ+Ø̇μ̇-Þλ-Þ̇λ̇)e0356",
    ///     "+2(-Ȧλ-Ḃν+Ċv+Ḋο-Ėε̇+Ḟζ+Ġγ̇+Ḣη-İβ̇-J̇ι-K̇ι̇-L̇β+Ṁη̇-Ṅγ-Ȯζ̇+Ṗε\
    ///         -Q̇ο̇-Ṙẇ+Ṡν̇-Ṫλ̇-Xθ̇+Ẋθ+Yδ̇-Ẏδ+Zξ+Żξ̇-Ðμ-Ð̇μ̇-Øα̇+Ø̇α+Þκ+Þ̇κ̇)e0364",
    ///     "+2(-Ȧμ-Ḃξ-Ċο+Ḋv+Ėδ̇-Ḟγ̇+Ġζ+Ḣβ̇+İη+J̇θ+K̇θ̇-L̇η̇-Ṁβ+Ṅζ̇-Ȯγ-Ṗδ\
    ///         +Q̇ẇ-Ṙο̇+Ṡξ̇-Ṫμ̇-Xι̇+Ẋι+Yε̇-Ẏε-Zν-Żν̇+Ðλ+Ð̇λ̇-Øκ-Ø̇κ̇-Þα̇+Þ̇α)e0345",
    ///     "+2(+Ȧη-Ḃζ-Ċε̇+Ḋδ̇+Ėv+Ḟν+Ġξ-Ḣλ-İμ-J̇α̇+K̇α+L̇μ̇-Ṁλ̇+Ṅξ̇-Ȯν̇-Ṗẇ\
    ///         +Q̇δ+Ṙε+Ṡζ̇+Ṫη̇-Xκ̇+Ẋκ+Yο+Ẏο̇+Zγ̇-Żγ-Ðβ̇+Ð̇β-Øι-Ø̇ι̇+Þθ+Þ̇θ̇)e0265",
    ///     "+2(+Ȧθ+Ḃε̇-Ċζ-Ḋγ̇-Ėν+Ḟv+Ġο+Ḣκ+İα̇-J̇μ-K̇μ̇+L̇α+Ṁκ̇+Ṅο̇+Ȯẇ-Ṗν̇\
    ///         -Q̇γ-Ṙζ̇+Ṡε+Ṫθ̇-Xλ̇+Ẋλ-Yξ-Ẏξ̇+Zδ̇-Żδ+Ðι+Ð̇ι̇-Øβ̇+Ø̇β-Þη-Þ̇η̇)e0246",
    ///     "+2(+Ȧι-Ḃδ̇+Ċγ̇-Ḋζ-Ėξ-Ḟο+Ġv-Ḣα̇+İκ+J̇λ+K̇λ̇-L̇κ̇+Ṁα-Ṅẇ+Ȯο̇-Ṗξ̇\
    ///         +Q̇ζ̇-Ṙγ-Ṡδ+Ṫι̇-Xμ̇+Ẋμ+Yν+Ẏν̇+Zε̇-Żε-Ðθ-Ð̇θ̇+Øη+Ø̇η̇-Þβ̇+Þ̇β)e0254",
    ///     "+2(-Ȧε̇+Ḃθ-Ċη+Ḋβ̇+Ėλ-Ḟκ-Ġα̇+Ḣv+İο-J̇ξ-K̇ξ̇-L̇ο̇-Ṁẇ+Ṅα+Ȯκ̇+Ṗλ̇\
    ///         +Q̇β-Ṙη̇-Ṡθ̇+Ṫε-Xν̇+Ẋν+Yμ+Ẏμ̇-Zι-Żι̇+Ðδ̇-Ð̇δ-Øγ̇+Ø̇γ+Þζ+Þ̇ζ̇)e0263",
    ///     "+2(+Ȧδ̇+Ḃι-Ċβ̇-Ḋη+Ėμ+Ḟα̇-Ġκ-Ḣο+İv+J̇ν+K̇ν̇+L̇ẇ-Ṁο̇-Ṅκ̇+Ȯα+Ṗμ̇\
    ///         +Q̇η̇+Ṙβ-Ṡι̇-Ṫδ-Xξ̇+Ẋξ-Yλ-Ẏλ̇+Zθ+Żθ̇+Ðε̇-Ð̇ε-Øζ-Ø̇ζ̇-Þγ̇+Þ̇γ)e0235",
    ///     "+2(-Ȧγ̇+Ḃβ̇+Ċι-Ḋθ-Ėα̇+Ḟμ-Ġλ+Ḣξ-İν+J̇v-K̇ẇ+L̇ν̇+Ṁξ̇-Ṅλ̇-Ȯμ̇+Ṗα\
    ///         +Q̇θ̇+Ṙι̇+Ṡβ+Ṫγ-Xο̇+Ẋο+Yκ+Ẏκ̇-Zη-Żη̇+Ðζ+Ð̇ζ̇+Øε̇-Ø̇ε-Þδ̇+Þ̇δ)e0243",
    ///     "+2(-Ȧγ+Ḃβ-Ċι̇+Ḋθ̇-Ėα-Ḟμ̇+Ġλ̇-Ḣξ̇+İν̇+J̇ẇ+K̇v+L̇ν+Ṁξ-Ṅλ-Ȯμ-Ṗα̇\
    ///         +Q̇θ+Ṙι-Ṡβ̇-Ṫγ̇-Xο-Ẋο̇-Yκ̇+Ẏκ+Zη̇-Żη-Ðζ̇+Ð̇ζ+Øε+Ø̇ε̇-Þδ-Þ̇δ̇)e0156",
    ///     "+2(-Ȧδ+Ḃι̇+Ċβ-Ḋη̇+Ėμ̇-Ḟα-Ġκ̇-Ḣο̇-İẇ+J̇ν̇-K̇ν+L̇v+Ṁο+Ṅκ+Ȯα̇-Ṗμ\
    ///         -Q̇η+Ṙβ̇+Ṡι-Ṫδ̇+Xξ+Ẋξ̇-Yλ̇+Ẏλ+Zθ̇-Żθ-Ðε-Ð̇ε̇-Øζ̇+Ø̇ζ+Þγ+Þ̇γ̇)e0164",
    ///     "+2(-Ȧε-Ḃθ̇+Ċη̇+Ḋβ-Ėλ̇+Ḟκ̇-Ġα+Ḣẇ-İο̇+J̇ξ̇-K̇ξ-L̇ο+Ṁv-Ṅα̇+Ȯκ+Ṗλ\
    ///         -Q̇β̇-Ṙη-Ṡθ-Ṫε̇-Xν-Ẋν̇-Yμ̇+Ẏμ+Zι̇-Żι+Ðδ+Ð̇δ̇-Øγ-Ø̇γ̇-Þζ̇+Þ̇ζ)e0145",
    ///     "+2(-Ȧι̇-Ḃδ+Ċγ+Ḋζ̇+Ėξ̇+Ḟο̇+Ġẇ-Ḣα-İκ̇-J̇λ̇+K̇λ-L̇κ-Ṁα̇+Ṅv+Ȯο-Ṗξ\
    ///         +Q̇ζ+Ṙγ̇+Ṡδ̇+Ṫι-Xμ-Ẋμ̇-Yν̇+Ẏν+Zε+Żε̇+Ðθ̇-Ð̇θ-Øη̇+Ø̇η-Þβ-Þ̇β̇)e0136",
    ///     "+2(+Ȧθ̇-Ḃε-Ċζ̇+Ḋγ-Ėν̇-Ḟẇ+Ġο̇+Ḣκ̇-İα-J̇μ̇+K̇μ+L̇α̇-Ṁκ-Ṅο+Ȯv+Ṗν\
    ///         -Q̇γ̇+Ṙζ+Ṡε̇-Ṫθ+Xλ+Ẋλ̇-Yξ̇+Ẏξ-Zδ-Żδ̇+Ðι̇-Ð̇ι+Øβ+Ø̇β̇-Þη̇+Þ̇η)e0153",
    ///     "+2(-Ȧη̇+Ḃζ̇-Ċε+Ḋδ+Ėẇ-Ḟν̇-Ġξ̇+Ḣλ̇+İμ̇-J̇α-K̇α̇+L̇μ-Ṁλ+Ṅξ-Ȯν+Ṗv\
    ///         -Q̇δ̇-Ṙε̇+Ṡζ+Ṫη-Xκ-Ẋκ̇-Yο̇+Ẏο+Zγ+Żγ̇-Ðβ-Ð̇β̇+Øι̇-Ø̇ι-Þθ̇+Þ̇θ)e0134",
    ///     "+2(-Ȧμ̇-Ḃξ̇-Ċο̇-Ḋẇ-Ėδ+Ḟγ+Ġζ̇-Ḣβ+İη̇+J̇θ̇-K̇θ+L̇η-Ṁβ̇-Ṅζ-Ȯγ̇-Ṗδ̇\
    ///         +Q̇v+Ṙο-Ṡξ+Ṫμ+Xι+Ẋι̇-Yε-Ẏε̇-Zν̇+Żν+Ðλ̇-Ð̇λ-Øκ̇+Ø̇κ+Þα+Þ̇α̇)e0162",
    ///     "+2(+Ȧλ̇+Ḃν̇+Ċẇ-Ḋο̇-Ėε-Ḟζ̇+Ġγ-Ḣη̇-İβ+J̇ι̇-K̇ι+L̇β̇+Ṁη+Ṅγ̇-Ȯζ-Ṗε̇\
    ///         -Q̇ο+Ṙv+Ṡν-Ṫλ-Xθ-Ẋθ̇+Yδ+Ẏδ̇-Zξ̇+Żξ+Ðμ̇-Ð̇μ-Øα-Ø̇α̇-Þκ̇+Þ̇κ)e0125",
    ///     "+2(-Ȧκ̇-Ḃẇ+Ċν̇+Ḋξ̇+Ėζ̇-Ḟε+Ġδ-Ḣθ̇-İι̇-J̇β-K̇β̇-L̇ι+Ṁθ+Ṅδ̇+Ȯε̇-Ṗζ\
    ///         +Q̇ξ-Ṙν+Ṡv+Ṫκ+Xη+Ẋη̇-Yγ-Ẏγ̇-Zο̇+Żο+Ðα+Ð̇α̇+Øμ̇-Ø̇μ-Þλ̇+Þ̇λ)e0142",
    ///     "+2(+Ȧẇ-Ḃκ̇-Ċλ̇-Ḋμ̇+Ėη̇+Ḟθ̇+Ġι̇-Ḣε+İδ-J̇γ-K̇γ̇-L̇δ̇-Ṁε̇-Ṅι+Ȯθ-Ṗη\
    ///         -Q̇μ+Ṙλ-Ṡκ+Ṫv-Xζ-Ẋζ̇+Yβ+Ẏβ̇-Zα-Żα̇-Ðο̇+Ð̇ο+Øξ̇-Ø̇ξ-Þν̇+Þ̇ν)e0123",
    /// ]);
    ///
    /// let triple_motor = Vee::volume().lhs() * Vee::volume().rhs();
    /// assert_eq!(triple_motor.basis_blades(), Vee::triple_motor().basis_blades());
    /// format_eq!(triple_motor, [
    ///     "-a͔a͕-b͔b͕-c͔c͕-d͔d͕-e͔e͕-f͔f͕-g͔g͕-h͔h͕-i͔i͕-j͔j͕-k͔k͕-l͔l͕-m͔m͕-n͔n͕-o͔o͕-p͔p͕-q͔q͕-r͔r͕-s͔s͕-t͔t͕",
    ///     "+(+a͔Ζ͕-a͕Ζ͔+b͔Η͕-b͕Η͔+c͔Θ͕-c͕Θ͔+d͔Ι͕-d͕Ι͔+e͔Κ͕-e͕Κ͔+f͔Λ͕-f͕Λ͔+g͔Μ͕-g͕Μ͔+h͔Ν͕-h͕Ν͔+i͔Ξ͕-i͕Ξ͔+j͔Ο͕-j͕Ο͔)e01",
    ///     "+(-a͔Β͕+a͕Β͔-b͔Γ͕+b͕Γ͔-c͔Δ͕+c͕Δ͔-d͔Ε͕+d͕Ε͔+k͔Κ͕-k͕Κ͔+l͔Λ͕-l͕Λ͔+m͔Μ͕-m͕Μ͔+n͔Ν͕-n͕Ν͔+o͔Ξ͕-o͕Ξ͔+p͔Ο͕-p͕Ο͔)e02",
    ///     "+(+a͔Α͕-a͕Α͔-e͔Γ͕+e͕Γ͔-f͔Δ͕+f͕Δ͔-g͔Ε͕+g͕Ε͔-k͔Η͕+k͕Η͔-l͔Θ͕+l͕Θ͔-m͔Ι͕+m͕Ι͔+q͔Ν͕-q͕Ν͔+r͔Ξ͕-r͕Ξ͔+s͔Ο͕-s͕Ο͔)e03",
    ///     "+(+b͔Α͕-b͕Α͔+e͔Β͕-e͕Β͔-h͔Δ͕+h͕Δ͔-i͔Ε͕+i͕Ε͔+k͔Ζ͕-k͕Ζ͔-n͔Θ͕+n͕Θ͔-o͔Ι͕+o͕Ι͔-q͔Λ͕+q͕Λ͔-r͔Μ͕+r͕Μ͔+t͔Ο͕-t͕Ο͔)e04",
    ///     "+(+c͔Α͕-c͕Α͔+f͔Β͕-f͕Β͔+h͔Γ͕-h͕Γ͔-j͔Ε͕+j͕Ε͔+l͔Ζ͕-l͕Ζ͔+n͔Η͕-n͕Η͔-p͔Ι͕+p͕Ι͔+q͔Κ͕-q͕Κ͔-s͔Μ͕+s͕Μ͔-t͔Ξ͕+t͕Ξ͔)e05",
    ///     "+(+d͔Α͕-d͕Α͔+g͔Β͕-g͕Β͔+i͔Γ͕-i͕Γ͔+j͔Δ͕-j͕Δ͔+m͔Ζ͕-m͕Ζ͔+o͔Η͕-o͕Η͔+p͔Θ͕-p͕Θ͔+r͔Κ͕-r͕Κ͔+s͔Λ͕-s͕Λ͔+t͔Ν͕-t͕Ν͔)e06",
    ///     "+(-e͔k͕+e͕k͔-f͔l͕+f͕l͔-g͔m͕+g͕m͔-h͔n͕+h͕n͔-i͔o͕+i͕o͔-j͔p͕+j͕p͔)e12",
    ///     "+(+b͔k͕-b͕k͔+c͔l͕-c͕l͔+d͔m͕-d͕m͔-h͔q͕+h͕q͔-i͔r͕+i͕r͔-j͔s͕+j͕s͔)e13",
    ///     "+(-a͔k͕+a͕k͔+c͔n͕-c͕n͔+d͔o͕-d͕o͔+f͔q͕-f͕q͔+g͔r͕-g͕r͔-j͔t͕+j͕t͔)e14",
    ///     "+(-a͔l͕+a͕l͔-b͔n͕+b͕n͔+d͔p͕-d͕p͔-e͔q͕+e͕q͔+g͔s͕-g͕s͔+i͔t͕-i͕t͔)e15",
    ///     "+(-a͔m͕+a͕m͔-b͔o͕+b͕o͔-c͔p͕+c͕p͔-e͔r͕+e͕r͔-f͔s͕+f͕s͔-h͔t͕+h͕t͔)e16",
    ///     "+(-b͔e͕+b͕e͔-c͔f͕+c͕f͔-d͔g͕+d͕g͔-n͔q͕+n͕q͔-o͔r͕+o͕r͔-p͔s͕+p͕s͔)e23",
    ///     "+(+a͔e͕-a͕e͔-c͔h͕+c͕h͔-d͔i͕+d͕i͔+l͔q͕-l͕q͔+m͔r͕-m͕r͔-p͔t͕+p͕t͔)e24",
    ///     "+(+a͔f͕-a͕f͔+b͔h͕-b͕h͔-d͔j͕+d͕j͔-k͔q͕+k͕q͔+m͔s͕-m͕s͔+o͔t͕-o͕t͔)e25",
    ///     "+(+a͔g͕-a͕g͔+b͔i͕-b͕i͔+c͔j͕-c͕j͔-k͔r͕+k͕r͔-l͔s͕+l͕s͔-n͔t͕+n͕t͔)e26",
    ///     "+(-a͔b͕+a͕b͔-f͔h͕+f͕h͔-g͔i͕+g͕i͔-l͔n͕+l͕n͔-m͔o͕+m͕o͔-s͔t͕+s͕t͔)e34",
    ///     "+(-a͔c͕+a͕c͔+e͔h͕-e͕h͔-g͔j͕+g͕j͔+k͔n͕-k͕n͔-m͔p͕+m͕p͔+r͔t͕-r͕t͔)e35",
    ///     "+(-a͔d͕+a͕d͔+e͔i͕-e͕i͔+f͔j͕-f͕j͔+k͔o͕-k͕o͔+l͔p͕-l͕p͔-q͔t͕+q͕t͔)e36",
    ///     "+(-b͔c͕+b͕c͔-e͔f͕+e͕f͔-i͔j͕+i͕j͔-k͔l͕+k͕l͔-o͔p͕+o͕p͔-r͔s͕+r͕s͔)e45",
    ///     "+(-b͔d͕+b͕d͔-e͔g͕+e͕g͔+h͔j͕-h͕j͔-k͔m͕+k͕m͔+n͔p͕-n͕p͔+q͔s͕-q͕s͔)e46",
    ///     "+(-c͔d͕+c͕d͔-f͔g͕+f͕g͔-h͔i͕+h͕i͔-l͔m͕+l͕m͔-n͔o͕+n͕o͔-q͔r͕+q͕r͔)e56",
    ///     "+(+e͔j͕+e͕j͔-f͔i͕-f͕i͔+g͔h͕+g͕h͔+k͔p͕+k͕p͔-l͔o͕-l͕o͔+m͔n͕+m͕n͔)e3456",
    ///     "+(-b͔j͕-b͕j͔+c͔i͕+c͕i͔-d͔h͕-d͕h͔+k͔s͕+k͕s͔-l͔r͕-l͕r͔+m͔q͕+m͕q͔)e2465",
    ///     "+(+a͔j͕+a͕j͔-c͔g͕-c͕g͔+d͔f͕+d͕f͔+k͔t͕+k͕t͔-n͔r͕-n͕r͔+o͔q͕+o͕q͔)e2356",
    ///     "+(-a͔i͕-a͕i͔+b͔g͕+b͕g͔-d͔e͕-d͕e͔+l͔t͕+l͕t͔-n͔s͕-n͕s͔+p͔q͕+p͕q͔)e2364",
    ///     "+(+a͔h͕+a͕h͔-b͔f͕-b͕f͔+c͔e͕+c͕e͔+m͔t͕+m͕t͔-o͔s͕-o͕s͔+p͔r͕+p͕r͔)e2345",
    ///     "+(-b͔p͕-b͕p͔+c͔o͕+c͕o͔-d͔n͕-d͕n͔-e͔s͕-e͕s͔+f͔r͕+f͕r͔-g͔q͕-g͕q͔)e1456",
    ///     "+(+a͔p͕+a͕p͔-c͔m͕-c͕m͔+d͔l͕+d͕l͔-e͔t͕-e͕t͔+h͔r͕+h͕r͔-i͔q͕-i͕q͔)e1365",
    ///     "+(-a͔o͕-a͕o͔+b͔m͕+b͕m͔-d͔k͕-d͕k͔-f͔t͕-f͕t͔+h͔s͕+h͕s͔-j͔q͕-j͕q͔)e1346",
    ///     "+(+a͔n͕+a͕n͔-b͔l͕-b͕l͔+c͔k͕+c͕k͔-g͔t͕-g͕t͔+i͔s͕+i͕s͔-j͔r͕-j͕r͔)e1354",
    ///     "+(+a͔s͕+a͕s͔+b͔t͕+b͕t͔-f͔m͕-f͕m͔+g͔l͕+g͕l͔-h͔o͕-h͕o͔+i͔n͕+i͕n͔)e1256",
    ///     "+(-a͔r͕-a͕r͔+c͔t͕+c͕t͔+e͔m͕+e͕m͔-g͔k͕-g͕k͔-h͔p͕-h͕p͔+j͔n͕+j͕n͔)e1264",
    ///     "+(+a͔q͕+a͕q͔+d͔t͕+d͕t͔-e͔l͕-e͕l͔+f͔k͕+f͕k͔-i͔p͕-i͕p͔+j͔o͕+j͕o͔)e1245",
    ///     "+(-b͔r͕-b͕r͔-c͔s͕-c͕s͔+e͔o͕+e͕o͔+f͔p͕+f͕p͔-i͔k͕-i͕k͔-j͔l͕-j͕l͔)e1236",
    ///     "+(+b͔q͕+b͕q͔-d͔s͕-d͕s͔-e͔n͕-e͕n͔+g͔p͕+g͕p͔+h͔k͕+h͕k͔-j͔m͕-j͕m͔)e1253",
    ///     "+(+c͔q͕+c͕q͔+d͔r͕+d͕r͔-f͔n͕-f͕n͔-g͔o͕-g͕o͔+h͔l͕+h͕l͔+i͔m͕+i͕m͔)e1234",
    ///     "+(+h͔Ε͕+h͕Ε͔-i͔Δ͕-i͕Δ͔+j͔Γ͕+j͕Γ͔+n͔Ι͕+n͕Ι͔-o͔Θ͕-o͕Θ͔+p͔Η͕+p͕Η͔+q͔Μ͕+q͕Μ͔-r͔Λ͕-r͕Λ͔+s͔Κ͕+s͕Κ͔)e0465",
    ///     "+(-f͔Ε͕-f͕Ε͔+g͔Δ͕+g͕Δ͔-j͔Β͕-j͕Β͔-l͔Ι͕-l͕Ι͔+m͔Θ͕+m͕Θ͔-p͔Ζ͕-p͕Ζ͔+q͔Ξ͕+q͕Ξ͔-r͔Ν͕-r͕Ν͔+t͔Κ͕+t͕Κ͔)e0356",
    ///     "+(+e͔Ε͕+e͕Ε͔-g͔Γ͕-g͕Γ͔+i͔Β͕+i͕Β͔+k͔Ι͕+k͕Ι͔-m͔Η͕-m͕Η͔+o͔Ζ͕+o͕Ζ͔+q͔Ο͕+q͕Ο͔-s͔Ν͕-s͕Ν͔+t͔Λ͕+t͕Λ͔)e0364",
    ///     "+(-e͔Δ͕-e͕Δ͔+f͔Γ͕+f͕Γ͔-h͔Β͕-h͕Β͔-k͔Θ͕-k͕Θ͔+l͔Η͕+l͕Η͔-n͔Ζ͕-n͕Ζ͔+r͔Ο͕+r͕Ο͔-s͔Ξ͕-s͕Ξ͔+t͔Μ͕+t͕Μ͔)e0345",
    ///     "+(+c͔Ε͕+c͕Ε͔-d͔Δ͕-d͕Δ͔+j͔Α͕+j͕Α͔-l͔Μ͕-l͕Μ͔+m͔Λ͕+m͕Λ͔-n͔Ξ͕-n͕Ξ͔+o͔Ν͕+o͕Ν͔-s͔Ζ͕-s͕Ζ͔-t͔Η͕-t͕Η͔)e0265",
    ///     "+(-b͔Ε͕-b͕Ε͔+d͔Γ͕+d͕Γ͔-i͔Α͕-i͕Α͔+k͔Μ͕+k͕Μ͔-m͔Κ͕-m͕Κ͔-n͔Ο͕-n͕Ο͔+p͔Ν͕+p͕Ν͔+r͔Ζ͕+r͕Ζ͔-t͔Θ͕-t͕Θ͔)e0246",
    ///     "+(+b͔Δ͕+b͕Δ͔-c͔Γ͕-c͕Γ͔+h͔Α͕+h͕Α͔-k͔Λ͕-k͕Λ͔+l͔Κ͕+l͕Κ͔-o͔Ο͕-o͕Ο͔+p͔Ξ͕+p͕Ξ͔-q͔Ζ͕-q͕Ζ͔-t͔Ι͕-t͕Ι͔)e0254",
    ///     "+(+a͔Ε͕+a͕Ε͔-d͔Β͕-d͕Β͔+g͔Α͕+g͕Α͔+k͔Ξ͕+k͕Ξ͔+l͔Ο͕+l͕Ο͔-o͔Κ͕-o͕Κ͔-p͔Λ͕-p͕Λ͔+r͔Η͕+r͕Η͔+s͔Θ͕+s͕Θ͔)e0263",
    ///     "+(-a͔Δ͕-a͕Δ͔+c͔Β͕+c͕Β͔-f͔Α͕-f͕Α͔-k͔Ν͕-k͕Ν͔+m͔Ο͕+m͕Ο͔+n͔Κ͕+n͕Κ͔-p͔Μ͕-p͕Μ͔-q͔Η͕-q͕Η͔+s͔Ι͕+s͕Ι͔)e0235",
    ///     "+(+a͔Γ͕+a͕Γ͔-b͔Β͕-b͕Β͔+e͔Α͕+e͕Α͔-l͔Ν͕-l͕Ν͔-m͔Ξ͕-m͕Ξ͔+n͔Λ͕+n͕Λ͔+o͔Μ͕+o͕Μ͔-q͔Θ͕-q͕Θ͔-r͔Ι͕-r͕Ι͔)e0243",
    ///     "+(+c͔Ι͕+c͕Ι͔-d͔Θ͕-d͕Θ͔+f͔Μ͕+f͕Μ͔-g͔Λ͕-g͕Λ͔+h͔Ξ͕+h͕Ξ͔-i͔Ν͕-i͕Ν͔+p͔Α͕+p͕Α͔+s͔Β͕+s͕Β͔+t͔Γ͕+t͕Γ͔)e0156",
    ///     "+(-b͔Ι͕-b͕Ι͔+d͔Η͕+d͕Η͔-e͔Μ͕-e͕Μ͔+g͔Κ͕+g͕Κ͔+h͔Ο͕+h͕Ο͔-j͔Ν͕-j͕Ν͔-o͔Α͕-o͕Α͔-r͔Β͕-r͕Β͔+t͔Δ͕+t͕Δ͔)e0164",
    ///     "+(+b͔Θ͕+b͕Θ͔-c͔Η͕-c͕Η͔+e͔Λ͕+e͕Λ͔-f͔Κ͕-f͕Κ͔+i͔Ο͕+i͕Ο͔-j͔Ξ͕-j͕Ξ͔+n͔Α͕+n͕Α͔+q͔Β͕+q͕Β͔+t͔Ε͕+t͕Ε͔)e0145",
    ///     "+(+a͔Ι͕+a͕Ι͔-d͔Ζ͕-d͕Ζ͔-e͔Ξ͕-e͕Ξ͔-f͔Ο͕-f͕Ο͔+i͔Κ͕+i͕Κ͔+j͔Λ͕+j͕Λ͔+m͔Α͕+m͕Α͔-r͔Γ͕-r͕Γ͔-s͔Δ͕-s͕Δ͔)e0136",
    ///     "+(-a͔Θ͕-a͕Θ͔+c͔Ζ͕+c͕Ζ͔+e͔Ν͕+e͕Ν͔-g͔Ο͕-g͕Ο͔-h͔Κ͕-h͕Κ͔+j͔Μ͕+j͕Μ͔-l͔Α͕-l͕Α͔+q͔Γ͕+q͕Γ͔-s͔Ε͕-s͕Ε͔)e0153",
    ///     "+(+a͔Η͕+a͕Η͔-b͔Ζ͕-b͕Ζ͔+f͔Ν͕+f͕Ν͔+g͔Ξ͕+g͕Ξ͔-h͔Λ͕-h͕Λ͔-i͔Μ͕-i͕Μ͔+k͔Α͕+k͕Α͔+q͔Δ͕+q͕Δ͔+r͔Ε͕+r͕Ε͔)e0134",
    ///     "+(+a͔Μ͕+a͕Μ͔+b͔Ξ͕+b͕Ξ͔+c͔Ο͕+c͕Ο͔-g͔Ζ͕-g͕Ζ͔-i͔Η͕-i͕Η͔-j͔Θ͕-j͕Θ͔+m͔Β͕+m͕Β͔+o͔Γ͕+o͕Γ͔+p͔Δ͕+p͕Δ͔)e0162",
    ///     "+(-a͔Λ͕-a͕Λ͔-b͔Ν͕-b͕Ν͔+d͔Ο͕+d͕Ο͔+f͔Ζ͕+f͕Ζ͔+h͔Η͕+h͕Η͔-j͔Ι͕-j͕Ι͔-l͔Β͕-l͕Β͔-n͔Γ͕-n͕Γ͔+p͔Ε͕+p͕Ε͔)e0125",
    ///     "+(+a͔Κ͕+a͕Κ͔-c͔Ν͕-c͕Ν͔-d͔Ξ͕-d͕Ξ͔-e͔Ζ͕-e͕Ζ͔+h͔Θ͕+h͕Θ͔+i͔Ι͕+i͕Ι͔+k͔Β͕+k͕Β͔-n͔Δ͕-n͕Δ͔-o͔Ε͕-o͕Ε͔)e0142",
    ///     "+(+b͔Κ͕+b͕Κ͔+c͔Λ͕+c͕Λ͔+d͔Μ͕+d͕Μ͔-e͔Η͕-e͕Η͔-f͔Θ͕-f͕Θ͔-g͔Ι͕-g͕Ι͔+k͔Γ͕+k͕Γ͔+l͔Δ͕+l͕Δ͔+m͔Ε͕+m͕Ε͔)e0123",
    ///     "+(+a͔t͕-a͕t͔-b͔s͕+b͕s͔+c͔r͕-c͕r͔-d͔q͕+d͕q͔+e͔p͕-e͕p͔-f͔o͕+f͕o͔+g͔n͕-g͕n͔+h͔m͕-h͕m͔-i͔l͕+i͕l͔+j͔k͕-j͕k͔)e123456",
    ///     "+(+k͔Ο͕-k͕Ο͔-l͔Ξ͕+l͕Ξ͔+m͔Ν͕-m͕Ν͔+n͔Μ͕-n͕Μ͔-o͔Λ͕+o͕Λ͔+p͔Κ͕-p͕Κ͔-q͔Ι͕+q͕Ι͔+r͔Θ͕-r͕Θ͔-s͔Η͕+s͕Η͔+t͔Ζ͕-t͕Ζ͔)e023465",
    ///     "+(-e͔Ο͕+e͕Ο͔+f͔Ξ͕-f͕Ξ͔-g͔Ν͕+g͕Ν͔-h͔Μ͕+h͕Μ͔+i͔Λ͕-i͕Λ͔-j͔Κ͕+j͕Κ͔+q͔Ε͕-q͕Ε͔-r͔Δ͕+r͕Δ͔+s͔Γ͕-s͕Γ͔-t͔Β͕+t͕Β͔)e013456",
    ///     "+(+b͔Ο͕-b͕Ο͔-c͔Ξ͕+c͕Ξ͔+d͔Ν͕-d͕Ν͔+h͔Ι͕-h͕Ι͔-i͔Θ͕+i͕Θ͔+j͔Η͕-j͕Η͔-n͔Ε͕+n͕Ε͔+o͔Δ͕-o͕Δ͔-p͔Γ͕+p͕Γ͔+t͔Α͕-t͕Α͔)e012465",
    ///     "+(-a͔Ο͕+a͕Ο͔+c͔Μ͕-c͕Μ͔-d͔Λ͕+d͕Λ͔-f͔Ι͕+f͕Ι͔+g͔Θ͕-g͕Θ͔-j͔Ζ͕+j͕Ζ͔+l͔Ε͕-l͕Ε͔-m͔Δ͕+m͕Δ͔+p͔Β͕-p͕Β͔-s͔Α͕+s͕Α͔)e012356",
    ///     "+(+a͔Ξ͕-a͕Ξ͔-b͔Μ͕+b͕Μ͔+d͔Κ͕-d͕Κ͔+e͔Ι͕-e͕Ι͔-g͔Η͕+g͕Η͔+i͔Ζ͕-i͕Ζ͔-k͔Ε͕+k͕Ε͔+m͔Γ͕-m͕Γ͔-o͔Β͕+o͕Β͔+r͔Α͕-r͕Α͔)e012364",
    ///     "+(-a͔Ν͕+a͕Ν͔+b͔Λ͕-b͕Λ͔-c͔Κ͕+c͕Κ͔-e͔Θ͕+e͕Θ͔+f͔Η͕-f͕Η͔-h͔Ζ͕+h͕Ζ͔+k͔Δ͕-k͕Δ͔-l͔Γ͕+l͕Γ͔+n͔Β͕-n͕Β͔-q͔Α͕+q͕Α͔)e012345",
    /// ]);
    ///
    /// let point = Vee::point() << Vee::triple_motor();
    /// assert_eq!(point.basis_blades(), (Vee::point() + Vee::volume4()).basis_blades());
    /// format_eq!(point, [
    ///     "+2(-Ȧẇζ-Ḃẇη-Ċẇθ-Ḋẇι-Ėẇκ-Ḟẇλ-Ġẇμ-Ḣẇν-İẇξ-J̇ẇο-K̇ẇο̇+L̇ẇξ̇\
    ///         -Ṁẇν̇-Ṅẇμ̇+Ȯẇλ̇-Ṗẇκ̇+Q̇ẇι̇-Ṙẇθ̇+Ṡẇη̇-Ṫẇζ̇+Xẇẇ-Ẋαα̇-Ẋββ̇-Ẋγγ̇\
    ///         -Ẋδδ̇-Ẋεε̇+Ẋζζ̇+Ẋηη̇+Ẋθθ̇+Ẋιι̇+Ẋκκ̇+Ẋλλ̇+Ẋμμ̇+Ẋνν̇+Ẋξξ̇+Ẋοο̇\
    ///         -Yẇα̇+Ẏvα̇-Ẏβζ̇-Ẏβ̇ζ-Ẏγη̇-Ẏγ̇η-Ẏδθ̇-Ẏδ̇θ-Ẏει̇-Ẏε̇ι-Ẏκο+Ẏκ̇ο̇\
    ///         +Ẏλξ-Ẏλ̇ξ̇-Ẏμν+Ẏμ̇ν̇-Zẇβ̇+Żvβ̇+Żαζ̇+Żα̇ζ-Żγκ̇-Żγ̇κ-Żδλ̇-Żδ̇λ\
    ///         -Żεμ̇-Żε̇μ+Żηο-Żη̇ο̇-Żθξ+Żθ̇ξ̇+Żιν-Żι̇ν̇+vÐ̇γ̇+vØ̇δ̇+vÞ̇ε̇-ẇÐγ̇\
    ///         -ẇØδ̇-ẇÞε̇+Ð̇αη̇+Ð̇α̇η+Ð̇βκ̇+Ð̇β̇κ-Ð̇δν̇-Ð̇δ̇ν-Ð̇εξ̇-Ð̇ε̇ξ-Ð̇ζο+Ð̇ζ̇ο̇\
    ///         +Ð̇θμ-Ð̇θ̇μ̇-Ð̇ιλ+Ð̇ι̇λ̇+Ø̇αθ̇+Ø̇α̇θ+Ø̇βλ̇+Ø̇β̇λ+Ø̇γν̇+Ø̇γ̇ν-Ø̇εο̇-Ø̇ε̇ο\
    ///         +Ø̇ζξ-Ø̇ζ̇ξ̇-Ø̇ημ+Ø̇η̇μ̇+Ø̇ικ-Ø̇ι̇κ̇+Þ̇αι̇+Þ̇α̇ι+Þ̇βμ̇+Þ̇β̇μ+Þ̇γξ̇+Þ̇γ̇ξ\
    ///         +Þ̇δο̇+Þ̇δ̇ο-Þ̇ζν+Þ̇ζ̇ν̇+Þ̇ηλ-Þ̇η̇λ̇-Þ̇θκ+Þ̇θ̇κ̇)e01",
    ///     "+2(+Ȧẇβ+Ḃẇγ+Ċẇδ+Ḋẇε+Ėẇο̇-Ḟẇξ̇+Ġẇν̇+Ḣẇμ̇-İẇλ̇+J̇ẇκ̇-K̇ẇκ-L̇ẇλ\
    ///         -Ṁẇμ-Ṅẇν-Ȯẇξ-Ṗẇο-Q̇ẇε̇+Ṙẇδ̇-Ṡẇγ̇+Ṫẇβ̇+Xẇα̇-Ẋvα̇-Ẋβζ̇-Ẋβ̇ζ\
    ///         -Ẋγη̇-Ẋγ̇η-Ẋδθ̇-Ẋδ̇θ-Ẋει̇-Ẋε̇ι+Ẋκο-Ẋκ̇ο̇-Ẋλξ+Ẋλ̇ξ̇+Ẋμν-Ẋμ̇ν̇\
    ///         +Yẇẇ-Ẏαα̇+Ẏββ̇+Ẏγγ̇+Ẏδδ̇+Ẏεε̇-Ẏζζ̇-Ẏηη̇-Ẏθθ̇-Ẏιι̇+Ẏκκ̇+Ẏλλ̇\
    ///         +Ẏμμ̇+Ẏνν̇+Ẏξξ̇+Ẏοο̇-Zẇζ̇+Żvζ̇-Żαβ̇-Żα̇β-Żγο+Żγ̇ο̇+Żδξ-Żδ̇ξ̇\
    ///         -Żεν+Żε̇ν̇-Żηκ̇-Żη̇κ-Żθλ̇-Żθ̇λ-Żιμ̇-Żι̇μ+vÐ̇η̇+vØ̇θ̇+vÞ̇ι̇-ẇÐη̇\
    ///         -ẇØθ̇-ẇÞι̇-Ð̇αγ̇-Ð̇α̇γ+Ð̇βο-Ð̇β̇ο̇-Ð̇δμ+Ð̇δ̇μ̇+Ð̇ελ-Ð̇ε̇λ̇+Ð̇ζκ̇+Ð̇ζ̇κ\
    ///         -Ð̇θν̇-Ð̇θ̇ν-Ð̇ιξ̇-Ð̇ι̇ξ-Ø̇αδ̇-Ø̇α̇δ-Ø̇βξ+Ø̇β̇ξ̇+Ø̇γμ-Ø̇γ̇μ̇-Ø̇εκ+Ø̇ε̇κ̇\
    ///         +Ø̇ζλ̇+Ø̇ζ̇λ+Ø̇ην̇+Ø̇η̇ν-Ø̇ιο̇-Ø̇ι̇ο-Þ̇αε̇-Þ̇α̇ε+Þ̇βν-Þ̇β̇ν̇-Þ̇γλ+Þ̇γ̇λ̇\
    ///         +Þ̇δκ-Þ̇δ̇κ̇+Þ̇ζμ̇+Þ̇ζ̇μ+Þ̇ηξ̇+Þ̇η̇ξ+Þ̇θο̇+Þ̇θ̇ο)e02",
    ///     "+2(-Ȧẇα-Ḃẇο̇+Ċẇξ̇-Ḋẇν̇+Ėẇγ+Ḟẇδ+Ġẇε-Ḣẇι̇+İẇθ̇-J̇ẇη̇+K̇ẇη+L̇ẇθ\
    ///         +Ṁẇι+Ṅẇε̇-Ȯẇδ̇+Ṗẇγ̇-Q̇ẇν-Ṙẇξ-Ṡẇο-Ṫẇα̇+Xẇβ̇-Ẋvβ̇+Ẋαζ̇+Ẋα̇ζ\
    ///         -Ẋγκ̇-Ẋγ̇κ-Ẋδλ̇-Ẋδ̇λ-Ẋεμ̇-Ẋε̇μ-Ẋηο+Ẋη̇ο̇+Ẋθξ-Ẋθ̇ξ̇-Ẋιν+Ẋι̇ν̇\
    ///         +Yẇζ̇-Ẏvζ̇-Ẏαβ̇-Ẏα̇β+Ẏγο-Ẏγ̇ο̇-Ẏδξ+Ẏδ̇ξ̇+Ẏεν-Ẏε̇ν̇-Ẏηκ̇-Ẏη̇κ\
    ///         -Ẏθλ̇-Ẏθ̇λ-Ẏιμ̇-Ẏι̇μ+Zẇẇ+Żαα̇-Żββ̇+Żγγ̇+Żδδ̇+Żεε̇-Żζζ̇+Żηη̇\
    ///         +Żθθ̇+Żιι̇-Żκκ̇-Żλλ̇-Żμμ̇+Żνν̇+Żξξ̇+Żοο̇+vÐ̇κ̇+vØ̇λ̇+vÞ̇μ̇-ẇÐκ̇\
    ///         -ẇØλ̇-ẇÞμ̇-Ð̇αο+Ð̇α̇ο̇-Ð̇βγ̇-Ð̇β̇γ+Ð̇δι-Ð̇δ̇ι̇-Ð̇εθ+Ð̇ε̇θ̇-Ð̇ζη̇-Ð̇ζ̇η\
    ///         -Ð̇λν̇-Ð̇λ̇ν-Ð̇μξ̇-Ð̇μ̇ξ+Ø̇αξ-Ø̇α̇ξ̇-Ø̇βδ̇-Ø̇β̇δ-Ø̇γι+Ø̇γ̇ι̇+Ø̇εη-Ø̇ε̇η̇\
    ///         -Ø̇ζθ̇-Ø̇ζ̇θ+Ø̇κν̇+Ø̇κ̇ν-Ø̇μο̇-Ø̇μ̇ο-Þ̇αν+Þ̇α̇ν̇-Þ̇βε̇-Þ̇β̇ε+Þ̇γθ-Þ̇γ̇θ̇\
    ///         -Þ̇δη+Þ̇δ̇η̇-Þ̇ζι̇-Þ̇ζ̇ι+Þ̇κξ̇+Þ̇κ̇ξ+Þ̇λο̇+Þ̇λ̇ο)e03",
    ///     "+2(+Ȧẇο̇-Ḃẇα-Ċẇμ̇+Ḋẇλ̇-Ėẇβ+Ḟẇι̇-Ġẇθ̇+Ḣẇδ+İẇε+J̇ẇζ̇-K̇ẇζ-L̇ẇε̇\
    ///         +Ṁẇδ̇+Ṅẇθ+Ȯẇι-Ṗẇβ̇+Q̇ẇλ+Ṙẇμ+Ṡẇα̇-Ṫẇο+Xẇγ̇-Ẋvγ̇+Ẋαη̇+Ẋα̇η\
    ///         +Ẋβκ̇+Ẋβ̇κ-Ẋδν̇-Ẋδ̇ν-Ẋεξ̇-Ẋε̇ξ+Ẋζο-Ẋζ̇ο̇-Ẋθμ+Ẋθ̇μ̇+Ẋιλ-Ẋι̇λ̇\
    ///         +Yẇη̇-Ẏvη̇-Ẏαγ̇-Ẏα̇γ-Ẏβο+Ẏβ̇ο̇+Ẏδμ-Ẏδ̇μ̇-Ẏελ+Ẏε̇λ̇+Ẏζκ̇+Ẏζ̇κ\
    ///         -Ẏθν̇-Ẏθ̇ν-Ẏιξ̇-Ẏι̇ξ+Zẇκ̇-Żvκ̇+Żαο-Żα̇ο̇-Żβγ̇-Żβ̇γ-Żδι+Żδ̇ι̇\
    ///         +Żεθ-Żε̇θ̇-Żζη̇-Żζ̇η-Żλν̇-Żλ̇ν-Żμξ̇-Żμ̇ξ+vØ̇ν̇+vÞ̇ξ̇-ẇØν̇-ẇÞξ̇\
    ///         +ẇẇÐ+Ð̇αα̇+Ð̇ββ̇-Ð̇γγ̇+Ð̇δδ̇+Ð̇εε̇+Ð̇ζζ̇-Ð̇ηη̇+Ð̇θθ̇+Ð̇ιι̇-Ð̇κκ̇+Ð̇λλ̇\
    ///         +Ð̇μμ̇-Ð̇νν̇-Ð̇ξξ̇+Ð̇οο̇-Ø̇αμ+Ø̇α̇μ̇+Ø̇βι-Ø̇β̇ι̇-Ø̇γδ̇-Ø̇γ̇δ-Ø̇εζ+Ø̇ε̇ζ̇\
    ///         -Ø̇ηθ̇-Ø̇η̇θ-Ø̇κλ̇-Ø̇κ̇λ-Ø̇ξο̇-Ø̇ξ̇ο+Þ̇αλ-Þ̇α̇λ̇-Þ̇βθ+Þ̇β̇θ̇-Þ̇γε̇-Þ̇γ̇ε\
    ///         +Þ̇δζ-Þ̇δ̇ζ̇-Þ̇ηι̇-Þ̇η̇ι-Þ̇κμ̇-Þ̇κ̇μ+Þ̇νο̇+Þ̇ν̇ο)e04",
    ///     "+2(-Ȧẇξ̇+Ḃẇμ̇-Ċẇα-Ḋẇκ̇-Ėẇι̇-Ḟẇβ+Ġẇη̇-Ḣẇγ-İẇζ̇+J̇ẇε+K̇ẇε̇-L̇ẇζ\
    ///         -Ṁẇγ̇-Ṅẇη+Ȯẇβ̇+Ṗẇι-Q̇ẇκ-Ṙẇα̇+Ṡẇμ+Ṫẇξ+Xẇδ̇-Ẋvδ̇+Ẋαθ̇+Ẋα̇θ\
    ///         +Ẋβλ̇+Ẋβ̇λ+Ẋγν̇+Ẋγ̇ν-Ẋεο̇-Ẋε̇ο-Ẋζξ+Ẋζ̇ξ̇+Ẋημ-Ẋη̇μ̇-Ẋικ+Ẋι̇κ̇\
    ///         +Yẇθ̇-Ẏvθ̇-Ẏαδ̇-Ẏα̇δ+Ẏβξ-Ẏβ̇ξ̇-Ẏγμ+Ẏγ̇μ̇+Ẏεκ-Ẏε̇κ̇+Ẏζλ̇+Ẏζ̇λ\
    ///         +Ẏην̇+Ẏη̇ν-Ẏιο̇-Ẏι̇ο+Zẇλ̇-Żvλ̇-Żαξ+Żα̇ξ̇-Żβδ̇-Żβ̇δ+Żγι-Żγ̇ι̇\
    ///         -Żεη+Żε̇η̇-Żζθ̇-Żζ̇θ+Żκν̇+Żκ̇ν-Żμο̇-Żμ̇ο-vÐ̇ν̇+vÞ̇ο̇+ẇÐν̇-ẇÞο̇\
    ///         +ẇẇØ+Ð̇αμ-Ð̇α̇μ̇-Ð̇βι+Ð̇β̇ι̇-Ð̇γδ̇-Ð̇γ̇δ+Ð̇εζ-Ð̇ε̇ζ̇-Ð̇ηθ̇-Ð̇η̇θ-Ð̇κλ̇\
    ///         -Ð̇κ̇λ-Ð̇ξο̇-Ð̇ξ̇ο+Ø̇αα̇+Ø̇ββ̇+Ø̇γγ̇-Ø̇δδ̇+Ø̇εε̇+Ø̇ζζ̇+Ø̇ηη̇-Ø̇θθ̇+Ø̇ιι̇\
    ///         +Ø̇κκ̇-Ø̇λλ̇+Ø̇μμ̇-Ø̇νν̇+Ø̇ξξ̇-Ø̇οο̇-Þ̇ακ+Þ̇α̇κ̇+Þ̇βη-Þ̇β̇η̇-Þ̇γζ+Þ̇γ̇ζ̇\
    ///         -Þ̇δε̇-Þ̇δ̇ε-Þ̇θι̇-Þ̇θ̇ι-Þ̇λμ̇-Þ̇λ̇μ-Þ̇νξ̇-Þ̇ν̇ξ)e05",
    ///     "+2(+Ȧẇν̇-Ḃẇλ̇+Ċẇκ̇-Ḋẇα+Ėẇθ̇-Ḟẇη̇-Ġẇβ+Ḣẇζ̇-İẇγ-J̇ẇδ-K̇ẇδ̇+L̇ẇγ̇\
    ///         -Ṁẇζ-Ṅẇβ̇-Ȯẇη-Ṗẇθ+Q̇ẇα̇-Ṙẇκ-Ṡẇλ-Ṫẇν+Xẇε̇-Ẋvε̇+Ẋαι̇+Ẋα̇ι\
    ///         +Ẋβμ̇+Ẋβ̇μ+Ẋγξ̇+Ẋγ̇ξ+Ẋδο̇+Ẋδ̇ο+Ẋζν-Ẋζ̇ν̇-Ẋηλ+Ẋη̇λ̇+Ẋθκ-Ẋθ̇κ̇\
    ///         +Yẇι̇-Ẏvι̇-Ẏαε̇-Ẏα̇ε-Ẏβν+Ẏβ̇ν̇+Ẏγλ-Ẏγ̇λ̇-Ẏδκ+Ẏδ̇κ̇+Ẏζμ̇+Ẏζ̇μ\
    ///         +Ẏηξ̇+Ẏη̇ξ+Ẏθο̇+Ẏθ̇ο+Zẇμ̇-Żvμ̇+Żαν-Żα̇ν̇-Żβε̇-Żβ̇ε-Żγθ+Żγ̇θ̇\
    ///         +Żδη-Żδ̇η̇-Żζι̇-Żζ̇ι+Żκξ̇+Żκ̇ξ+Żλο̇+Żλ̇ο-vÐ̇ξ̇-vØ̇ο̇+ẇÐξ̇+ẇØο̇\
    ///         +ẇẇÞ-Ð̇αλ+Ð̇α̇λ̇+Ð̇βθ-Ð̇β̇θ̇-Ð̇γε̇-Ð̇γ̇ε-Ð̇δζ+Ð̇δ̇ζ̇-Ð̇ηι̇-Ð̇η̇ι-Ð̇κμ̇\
    ///         -Ð̇κ̇μ+Ð̇νο̇+Ð̇ν̇ο+Ø̇ακ-Ø̇α̇κ̇-Ø̇βη+Ø̇β̇η̇+Ø̇γζ-Ø̇γ̇ζ̇-Ø̇δε̇-Ø̇δ̇ε-Ø̇θι̇\
    ///         -Ø̇θ̇ι-Ø̇λμ̇-Ø̇λ̇μ-Ø̇νξ̇-Ø̇ν̇ξ+Þ̇αα̇+Þ̇ββ̇+Þ̇γγ̇+Þ̇δδ̇-Þ̇εε̇+Þ̇ζζ̇+Þ̇ηη̇\
    ///         +Þ̇θθ̇-Þ̇ιι̇+Þ̇κκ̇+Þ̇λλ̇-Þ̇μμ̇+Þ̇νν̇-Þ̇ξξ̇-Þ̇οο̇)e06",
    ///     "+2(+vẇα̇-ẇβζ̇+ẇβ̇ζ-ẇγη̇+ẇγ̇η-ẇδθ̇+ẇδ̇θ-ẇει̇\
    ///         +ẇε̇ι-ẇκο-ẇκ̇ο̇+ẇλξ+ẇλ̇ξ̇-ẇμν-ẇμ̇ν̇+ẇẇα)e12",
    ///     "+2(+vẇβ̇+ẇαζ̇-ẇα̇ζ-ẇγκ̇+ẇγ̇κ-ẇδλ̇+ẇδ̇λ-ẇεμ̇\
    ///         +ẇε̇μ+ẇηο+ẇη̇ο̇-ẇθξ-ẇθ̇ξ̇+ẇιν+ẇι̇ν̇+ẇẇβ)e13",
    ///     "+2(+vẇγ̇+ẇαη̇-ẇα̇η+ẇβκ̇-ẇβ̇κ-ẇδν̇+ẇδ̇ν-ẇεξ̇\
    ///         +ẇε̇ξ-ẇζο-ẇζ̇ο̇+ẇθμ+ẇθ̇μ̇-ẇιλ-ẇι̇λ̇+ẇẇγ)e14",
    ///     "+2(+vẇδ̇+ẇαθ̇-ẇα̇θ+ẇβλ̇-ẇβ̇λ+ẇγν̇-ẇγ̇ν-ẇεο̇\
    ///         +ẇε̇ο+ẇζξ+ẇζ̇ξ̇-ẇημ-ẇη̇μ̇+ẇικ+ẇι̇κ̇+ẇẇδ)e15",
    ///     "+2(+vẇε̇+ẇαι̇-ẇα̇ι+ẇβμ̇-ẇβ̇μ+ẇγξ̇-ẇγ̇ξ+ẇδο̇\
    ///         -ẇδ̇ο-ẇζν-ẇζ̇ν̇+ẇηλ+ẇη̇λ̇-ẇθκ-ẇθ̇κ̇+ẇẇε)e16",
    ///     "+2(+vẇζ̇-ẇαβ̇+ẇα̇β-ẇγο-ẇγ̇ο̇+ẇδξ+ẇδ̇ξ̇-ẇεν\
    ///         -ẇε̇ν̇-ẇηκ̇+ẇη̇κ-ẇθλ̇+ẇθ̇λ-ẇιμ̇+ẇι̇μ+ẇẇζ)e23",
    ///     "+2(+vẇη̇-ẇαγ̇+ẇα̇γ+ẇβο+ẇβ̇ο̇-ẇδμ-ẇδ̇μ̇+ẇελ\
    ///         +ẇε̇λ̇+ẇζκ̇-ẇζ̇κ-ẇθν̇+ẇθ̇ν-ẇιξ̇+ẇι̇ξ+ẇẇη)e24",
    ///     "+2(+vẇθ̇-ẇαδ̇+ẇα̇δ-ẇβξ-ẇβ̇ξ̇+ẇγμ+ẇγ̇μ̇-ẇεκ\
    ///         -ẇε̇κ̇+ẇζλ̇-ẇζ̇λ+ẇην̇-ẇη̇ν-ẇιο̇+ẇι̇ο+ẇẇθ)e25",
    ///     "+2(+vẇι̇-ẇαε̇+ẇα̇ε+ẇβν+ẇβ̇ν̇-ẇγλ-ẇγ̇λ̇+ẇδκ\
    ///         +ẇδ̇κ̇+ẇζμ̇-ẇζ̇μ+ẇηξ̇-ẇη̇ξ+ẇθο̇-ẇθ̇ο+ẇẇι)e26",
    ///     "+2(+vẇκ̇-ẇαο-ẇα̇ο̇-ẇβγ̇+ẇβ̇γ+ẇδι+ẇδ̇ι̇-ẇεθ\
    ///         -ẇε̇θ̇-ẇζη̇+ẇζ̇η-ẇλν̇+ẇλ̇ν-ẇμξ̇+ẇμ̇ξ+ẇẇκ)e34",
    ///     "+2(+vẇλ̇+ẇαξ+ẇα̇ξ̇-ẇβδ̇+ẇβ̇δ-ẇγι-ẇγ̇ι̇+ẇεη\
    ///         +ẇε̇η̇-ẇζθ̇+ẇζ̇θ+ẇκν̇-ẇκ̇ν-ẇμο̇+ẇμ̇ο+ẇẇλ)e35",
    ///     "+2(+vẇμ̇-ẇαν-ẇα̇ν̇-ẇβε̇+ẇβ̇ε+ẇγθ+ẇγ̇θ̇-ẇδη\
    ///         -ẇδ̇η̇-ẇζι̇+ẇζ̇ι+ẇκξ̇-ẇκ̇ξ+ẇλο̇-ẇλ̇ο+ẇẇμ)e36",
    ///     "+2(+vẇν̇-ẇαμ-ẇα̇μ̇+ẇβι+ẇβ̇ι̇-ẇγδ̇+ẇγ̇δ-ẇεζ\
    ///         -ẇε̇ζ̇-ẇηθ̇+ẇη̇θ-ẇκλ̇+ẇκ̇λ-ẇξο̇+ẇξ̇ο+ẇẇν)e45",
    ///     "+2(+vẇξ̇+ẇαλ+ẇα̇λ̇-ẇβθ-ẇβ̇θ̇-ẇγε̇+ẇγ̇ε+ẇδζ\
    ///         +ẇδ̇ζ̇-ẇηι̇+ẇη̇ι-ẇκμ̇+ẇκ̇μ+ẇνο̇-ẇν̇ο+ẇẇξ)e46",
    ///     "+2(+vẇο̇-ẇακ-ẇα̇κ̇+ẇβη+ẇβ̇η̇-ẇγζ-ẇγ̇ζ̇-ẇδε̇\
    ///         +ẇδ̇ε-ẇθι̇+ẇθ̇ι-ẇλμ̇+ẇλ̇μ-ẇνξ̇+ẇν̇ξ+ẇẇο)e56",
    ///     "+(+vvẇ+ẇαα+ẇα̇α̇+ẇββ+ẇβ̇β̇+ẇγγ+ẇγ̇γ̇+ẇδδ+ẇδ̇δ̇+ẇεε+ẇε̇ε̇+ẇζζ+ẇζ̇ζ̇+ẇηη+ẇη̇η̇+ẇθθ\
    ///        +ẇθ̇θ̇+ẇιι+ẇι̇ι̇+ẇκκ+ẇκ̇κ̇+ẇλλ+ẇλ̇λ̇+ẇμμ+ẇμ̇μ̇+ẇνν+ẇν̇ν̇+ẇξξ+ẇξ̇ξ̇+ẇοο+ẇο̇ο̇+ẇẇẇ)e123456",
    ///     "+(+2Ȧẇζ̇+2Ḃẇη̇+2Ċẇθ̇+2Ḋẇι̇+2Ėẇκ̇+2Ḟẇλ̇+2Ġẇμ̇+2Ḣẇν̇+2İẇξ̇+2J̇ẇο̇-2K̇ẇο+2L̇ẇξ-2Ṁẇν\
    ///        -2Ṅẇμ+2Ȯẇλ-2Ṗẇκ+2Q̇ẇι-2Ṙẇθ+2Ṡẇη-2Ṫẇζ-2Xvẇ+Ẋvv+Ẋẇẇ-Ẋαα+Ẋα̇α̇-Ẋββ+Ẋβ̇β̇\
    ///        -Ẋγγ+Ẋγ̇γ̇-Ẋδδ+Ẋδ̇δ̇-Ẋεε+Ẋε̇ε̇+Ẋζζ-Ẋζ̇ζ̇+Ẋηη-Ẋη̇η̇+Ẋθθ-Ẋθ̇θ̇+Ẋιι-Ẋι̇ι̇+Ẋκκ-Ẋκ̇κ̇\
    ///        +Ẋλλ-Ẋλ̇λ̇+Ẋμμ-Ẋμ̇μ̇+Ẋνν-Ẋν̇ν̇+Ẋξξ-Ẋξ̇ξ̇+Ẋοο-Ẋο̇ο̇-2Yẇα+2Ẏvα-2Ẏβζ+2Ẏβ̇ζ̇-2Ẏγη\
    ///        +2Ẏγ̇η̇-2Ẏδθ+2Ẏδ̇θ̇-2Ẏει+2Ẏε̇ι̇+2Ẏκο̇+2Ẏκ̇ο-2Ẏλξ̇-2Ẏλ̇ξ+2Ẏμν̇+2Ẏμ̇ν-2Zẇβ+2Żvβ\
    ///        +2Żαζ-2Żα̇ζ̇-2Żγκ+2Żγ̇κ̇-2Żδλ+2Żδ̇λ̇-2Żεμ+2Żε̇μ̇-2Żηο̇-2Żη̇ο+2Żθξ̇+2Żθ̇ξ-2Żιν̇\
    ///        -2Żι̇ν+2vÐ̇γ+2vØ̇δ+2vÞ̇ε-2ẇÐγ-2ẇØδ-2ẇÞε+2Ð̇αη-2Ð̇α̇η̇+2Ð̇βκ-2Ð̇β̇κ̇-2Ð̇δν+2Ð̇δ̇ν̇\
    ///        -2Ð̇εξ+2Ð̇ε̇ξ̇+2Ð̇ζο̇+2Ð̇ζ̇ο-2Ð̇θμ̇-2Ð̇θ̇μ+2Ð̇ιλ̇+2Ð̇ι̇λ+2Ø̇αθ-2Ø̇α̇θ̇+2Ø̇βλ-2Ø̇β̇λ̇+2Ø̇γν\
    ///        -2Ø̇γ̇ν̇-2Ø̇εο+2Ø̇ε̇ο̇-2Ø̇ζξ̇-2Ø̇ζ̇ξ+2Ø̇ημ̇+2Ø̇η̇μ-2Ø̇ικ̇-2Ø̇ι̇κ+2Þ̇αι-2Þ̇α̇ι̇+2Þ̇βμ-2Þ̇β̇μ̇\
    ///        +2Þ̇γξ-2Þ̇γ̇ξ̇+2Þ̇δο-2Þ̇δ̇ο̇+2Þ̇ζν̇+2Þ̇ζ̇ν-2Þ̇ηλ̇-2Þ̇η̇λ+2Þ̇θκ̇+2Þ̇θ̇κ)e023465",
    ///     "+(-2Ȧẇβ̇-2Ḃẇγ̇-2Ċẇδ̇-2Ḋẇε̇+2Ėẇο-2Ḟẇξ+2Ġẇν+2Ḣẇμ-2İẇλ+2J̇ẇκ+2K̇ẇκ̇+2L̇ẇλ̇+2Ṁẇμ̇\
    ///        +2Ṅẇν̇+2Ȯẇξ̇+2Ṗẇο̇-2Q̇ẇε+2Ṙẇδ-2Ṡẇγ+2Ṫẇβ+2Xẇα-2Ẋvα-2Ẋβζ+2Ẋβ̇ζ̇-2Ẋγη+2Ẋγ̇\
    ///        η̇-2Ẋδθ+2Ẋδ̇θ̇-2Ẋει+2Ẋε̇ι̇-2Ẋκο̇-2Ẋκ̇ο+2Ẋλξ̇+2Ẋλ̇ξ-2Ẋμν̇-2Ẋμ̇ν-2Yvẇ+Ẏvv+Ẏẇẇ\
    ///        -Ẏαα+Ẏα̇α̇+Ẏββ-Ẏβ̇β̇+Ẏγγ-Ẏγ̇γ̇+Ẏδδ-Ẏδ̇δ̇+Ẏεε-Ẏε̇ε̇-Ẏζζ+Ẏζ̇ζ̇-Ẏηη+Ẏη̇η̇-Ẏθθ+Ẏθ̇θ̇-\
    ///        Ẏιι+Ẏι̇ι̇+Ẏκκ-Ẏκ̇κ̇+Ẏλλ-Ẏλ̇λ̇+Ẏμμ-Ẏμ̇μ̇+Ẏνν-Ẏν̇ν̇+Ẏξξ-Ẏξ̇ξ̇+Ẏοο-Ẏο̇ο̇-2Zẇζ+2Żvζ\
    ///        -2Żαβ+2Żα̇β̇+2Żγο̇+2Żγ̇ο-2Żδξ̇-2Żδ̇ξ+2Żεν̇+2Żε̇ν-2Żηκ+2Żη̇κ̇-2Żθλ+2Żθ̇λ̇-2Żιμ\
    ///        +2Żι̇μ̇+2vÐ̇η+2vØ̇θ+2vÞ̇ι-2ẇÐη-2ẇØθ-2ẇÞι-2Ð̇αγ+2Ð̇α̇γ̇-2Ð̇βο̇-2Ð̇β̇ο+2Ð̇δμ̇+2Ð̇δ̇μ\
    ///        -2Ð̇ελ̇-2Ð̇ε̇λ+2Ð̇ζκ-2Ð̇ζ̇κ̇-2Ð̇θν+2Ð̇θ̇ν̇-2Ð̇ιξ+2Ð̇ι̇ξ̇-2Ø̇αδ+2Ø̇α̇δ̇+2Ø̇βξ̇+2Ø̇β̇ξ-2Ø̇γμ̇\
    ///        -2Ø̇γ̇μ+2Ø̇εκ̇+2Ø̇ε̇κ+2Ø̇ζλ-2Ø̇ζ̇λ̇+2Ø̇ην-2Ø̇η̇ν̇-2Ø̇ιο+2Ø̇ι̇ο̇-2Þ̇αε+2Þ̇α̇ε̇-2Þ̇βν̇-2Þ̇β̇ν\
    ///        +2Þ̇γλ̇+2Þ̇γ̇λ-2Þ̇δκ̇-2Þ̇δ̇κ+2Þ̇ζμ-2Þ̇ζ̇μ̇+2Þ̇ηξ-2Þ̇η̇ξ̇+2Þ̇θο-2Þ̇θ̇ο̇)e013456",
    ///     "+(+2Ȧẇα̇-2Ḃẇο+2Ċẇξ-2Ḋẇν-2Ėẇγ̇-2Ḟẇδ̇-2Ġẇε̇-2Ḣẇι+2İẇθ-2J̇ẇη-2K̇ẇη̇-2L̇ẇθ̇-2Ṁẇι̇\
    ///        +2Ṅẇε-2Ȯẇδ+2Ṗẇγ+2Q̇ẇν̇+2Ṙẇξ̇+2Ṡẇο̇-2Ṫẇα+2Xẇβ-2Ẋvβ+2Ẋαζ-2Ẋα̇ζ̇-2Ẋγκ+2Ẋγ̇\
    ///        κ̇-2Ẋδλ+2Ẋδ̇λ̇-2Ẋεμ+2Ẋε̇μ̇+2Ẋηο̇+2Ẋη̇ο-2Ẋθξ̇-2Ẋθ̇ξ+2Ẋιν̇+2Ẋι̇ν+2Yẇζ-2Ẏvζ-2Ẏ\
    ///        αβ+2Ẏα̇β̇-2Ẏγο̇-2Ẏγ̇ο+2Ẏδξ̇+2Ẏδ̇ξ-2Ẏεν̇-2Ẏε̇ν-2Ẏηκ+2Ẏη̇κ̇-2Ẏθλ+2Ẏθ̇λ̇-2Ẏιμ+2Ẏ\
    ///        ι̇μ̇-2Zvẇ+Żvv+Żẇẇ+Żαα-Żα̇α̇-Żββ+Żβ̇β̇+Żγγ-Żγ̇γ̇+Żδδ-Żδ̇δ̇+Żεε-Żε̇ε̇-Żζζ+Żζ̇ζ̇+Ż\
    ///        ηη-Żη̇η̇+Żθθ-Żθ̇θ̇+Żιι-Żι̇ι̇-Żκκ+Żκ̇κ̇-Żλλ+Żλ̇λ̇-Żμμ+Żμ̇μ̇+Żνν-Żν̇ν̇+Żξξ-Żξ̇ξ̇+Żο\
    ///        ο-Żο̇ο̇+2vÐ̇κ+2vØ̇λ+2vÞ̇μ-2ẇÐκ-2ẇØλ-2ẇÞμ+2Ð̇αο̇+2Ð̇α̇ο-2Ð̇βγ+2Ð̇β̇γ̇-2Ð̇δι̇-2Ð̇δ̇ι\
    ///        +2Ð̇εθ̇+2Ð̇ε̇θ-2Ð̇ζη+2Ð̇ζ̇η̇-2Ð̇λν+2Ð̇λ̇ν̇-2Ð̇μξ+2Ð̇μ̇ξ̇-2Ø̇αξ̇-2Ø̇α̇ξ-2Ø̇βδ+2Ø̇β̇δ̇+2Ø̇γι̇\
    ///        +2Ø̇γ̇ι-2Ø̇εη̇-2Ø̇ε̇η-2Ø̇ζθ+2Ø̇ζ̇θ̇+2Ø̇κν-2Ø̇κ̇ν̇-2Ø̇μο+2Ø̇μ̇ο̇+2Þ̇αν̇+2Þ̇α̇ν-2Þ̇βε+2Þ̇β̇ε̇\
    ///        -2Þ̇γθ̇-2Þ̇γ̇θ+2Þ̇δη̇+2Þ̇δ̇η-2Þ̇ζι+2Þ̇ζ̇ι̇+2Þ̇κξ-2Þ̇κ̇ξ̇+2Þ̇λο-2Þ̇λ̇ο̇)e012465",
    ///     "+(+2Ȧẇο+2Ḃẇα̇-2Ċẇμ+2Ḋẇλ+2Ėẇβ̇+2Ḟẇι-2Ġẇθ-2Ḣẇδ̇-2İẇε̇+2J̇ẇζ+2K̇ẇζ̇-2L̇ẇε+2Ṁẇδ\
    ///        -2Ṅẇθ̇-2Ȯẇι̇-2Ṗẇβ-2Q̇ẇλ̇-2Ṙẇμ̇+2Ṡẇα+2Ṫẇο̇+2Xẇγ-2Ẋvγ+2Ẋαη-2Ẋα̇η̇+2Ẋβκ-2Ẋβ̇\
    ///        κ̇-2Ẋδν+2Ẋδ̇ν̇-2Ẋεξ+2Ẋε̇ξ̇-2Ẋζο̇-2Ẋζ̇ο+2Ẋθμ̇+2Ẋθ̇μ-2Ẋιλ̇-2Ẋι̇λ+2Yẇη-2Ẏvη-2Ẏ\
    ///        αγ+2Ẏα̇γ̇+2Ẏβο̇+2Ẏβ̇ο-2Ẏδμ̇-2Ẏδ̇μ+2Ẏελ̇+2Ẏε̇λ+2Ẏζκ-2Ẏζ̇κ̇-2Ẏθν+2Ẏθ̇ν̇-2Ẏιξ+2Ẏ\
    ///        ι̇ξ̇+2Zẇκ-2Żvκ-2Żαο̇-2Żα̇ο-2Żβγ+2Żβ̇γ̇+2Żδι̇+2Żδ̇ι-2Żεθ̇-2Żε̇θ-2Żζη+2Żζ̇η̇-2Ż\
    ///        λν+2Żλ̇ν̇-2Żμξ+2Żμ̇ξ̇-2vẇÐ+2vØ̇ν+2vÞ̇ξ+vvÐ̇-2ẇØν-2ẇÞξ+ẇẇÐ̇+Ð̇αα-Ð̇α̇α̇+Ð̇ββ-Ð̇β̇\
    ///        β̇-Ð̇γγ+Ð̇γ̇γ̇+Ð̇δδ-Ð̇δ̇δ̇+Ð̇εε-Ð̇ε̇ε̇+Ð̇ζζ-Ð̇ζ̇ζ̇-Ð̇ηη+Ð̇η̇η̇+Ð̇θθ-Ð̇θ̇θ̇+Ð̇ιι-Ð̇ι̇ι̇-Ð̇κκ+Ð̇κ̇κ̇\
    ///        +Ð̇λλ-Ð̇λ̇λ̇+Ð̇μμ-Ð̇μ̇μ̇-Ð̇νν+Ð̇ν̇ν̇-Ð̇ξξ+Ð̇ξ̇ξ̇+Ð̇οο-Ð̇ο̇ο̇+2Ø̇αμ̇+2Ø̇α̇μ-2Ø̇βι̇-2Ø̇β̇ι-2Ø̇γδ\
    ///        +2Ø̇γ̇δ̇+2Ø̇εζ̇+2Ø̇ε̇ζ-2Ø̇ηθ+2Ø̇η̇θ̇-2Ø̇κλ+2Ø̇κ̇λ̇-2Ø̇ξο+2Ø̇ξ̇ο̇-2Þ̇αλ̇-2Þ̇α̇λ+2Þ̇βθ̇+2Þ̇β̇θ\
    ///        -2Þ̇γε+2Þ̇γ̇ε̇-2Þ̇δζ̇-2Þ̇δ̇ζ-2Þ̇ηι+2Þ̇η̇ι̇-2Þ̇κμ+2Þ̇κ̇μ̇+2Þ̇νο-2Þ̇ν̇ο̇)e012356",
    ///     "+(-2Ȧẇξ+2Ḃẇμ+2Ċẇα̇-2Ḋẇκ-2Ėẇι+2Ḟẇβ̇+2Ġẇη+2Ḣẇγ̇-2İẇζ-2J̇ẇε̇+2K̇ẇε+2L̇ẇζ̇-2Ṁẇγ\
    ///        +2Ṅẇη̇+2Ȯẇβ-2Ṗẇι̇+2Q̇ẇκ̇-2Ṙẇα-2Ṡẇμ̇-2Ṫẇξ̇+2Xẇδ-2Ẋvδ+2Ẋαθ-2Ẋα̇θ̇+2Ẋβλ-2Ẋβ̇\
    ///        λ̇+2Ẋγν-2Ẋγ̇ν̇-2Ẋεο+2Ẋε̇ο̇+2Ẋζξ̇+2Ẋζ̇ξ-2Ẋημ̇-2Ẋη̇μ+2Ẋικ̇+2Ẋι̇κ+2Yẇθ-2Ẏvθ-2Ẏ\
    ///        αδ+2Ẏα̇δ̇-2Ẏβξ̇-2Ẏβ̇ξ+2Ẏγμ̇+2Ẏγ̇μ-2Ẏεκ̇-2Ẏε̇κ+2Ẏζλ-2Ẏζ̇λ̇+2Ẏην-2Ẏη̇ν̇-2Ẏιο+2Ẏ\
    ///        ι̇ο̇+2Zẇλ-2Żvλ+2Żαξ̇+2Żα̇ξ-2Żβδ+2Żβ̇δ̇-2Żγι̇-2Żγ̇ι+2Żεη̇+2Żε̇η-2Żζθ+2Żζ̇θ̇+2Ż\
    ///        κν-2Żκ̇ν̇-2Żμο+2Żμ̇ο̇-2vẇØ-2vÐ̇ν+2vÞ̇ο+vvØ̇+2ẇÐν-2ẇÞο+ẇẇØ̇-2Ð̇αμ̇-2Ð̇α̇μ+2Ð̇βι̇\
    ///        +2Ð̇β̇ι-2Ð̇γδ+2Ð̇γ̇δ̇-2Ð̇εζ̇-2Ð̇ε̇ζ-2Ð̇ηθ+2Ð̇η̇θ̇-2Ð̇κλ+2Ð̇κ̇λ̇-2Ð̇ξο+2Ð̇ξ̇ο̇+Ø̇αα-Ø̇α̇α̇+Ø̇\
    ///        ββ-Ø̇β̇β̇+Ø̇γγ-Ø̇γ̇γ̇-Ø̇δδ+Ø̇δ̇δ̇+Ø̇εε-Ø̇ε̇ε̇+Ø̇ζζ-Ø̇ζ̇ζ̇+Ø̇ηη-Ø̇η̇η̇-Ø̇θθ+Ø̇θ̇θ̇+Ø̇ιι-Ø̇ι̇ι̇+Ø̇κ\
    ///        κ-Ø̇κ̇κ̇-Ø̇λλ+Ø̇λ̇λ̇+Ø̇μμ-Ø̇μ̇μ̇-Ø̇νν+Ø̇ν̇ν̇+Ø̇ξξ-Ø̇ξ̇ξ̇-Ø̇οο+Ø̇ο̇ο̇+2Þ̇ακ̇+2Þ̇α̇κ-2Þ̇βη̇-2Þ̇β̇η\
    ///        +2Þ̇γζ̇+2Þ̇γ̇ζ-2Þ̇δε+2Þ̇δ̇ε̇-2Þ̇θι+2Þ̇θ̇ι̇-2Þ̇λμ+2Þ̇λ̇μ̇-2Þ̇νξ+2Þ̇ν̇ξ̇)e012364",
    ///     "+(+2Ȧẇν-2Ḃẇλ+2Ċẇκ+2Ḋẇα̇+2Ėẇθ-2Ḟẇη+2Ġẇβ̇+2Ḣẇζ+2İẇγ̇+2J̇ẇδ̇-2K̇ẇδ+2L̇ẇγ+2Ṁẇζ̇\
    ///        -2Ṅẇβ+2Ȯẇη̇+2Ṗẇθ̇+2Q̇ẇα+2Ṙẇκ̇+2Ṡẇλ̇+2Ṫẇν̇+2Xẇε-2Ẋvε+2Ẋαι-2Ẋα̇ι̇+2Ẋβμ-2Ẋβ̇\
    ///        μ̇+2Ẋγξ-2Ẋγ̇ξ̇+2Ẋδο-2Ẋδ̇ο̇-2Ẋζν̇-2Ẋζ̇ν+2Ẋηλ̇+2Ẋη̇λ-2Ẋθκ̇-2Ẋθ̇κ+2Yẇι-2Ẏvι-2Ẏ\
    ///        αε+2Ẏα̇ε̇+2Ẏβν̇+2Ẏβ̇ν-2Ẏγλ̇-2Ẏγ̇λ+2Ẏδκ̇+2Ẏδ̇κ+2Ẏζμ-2Ẏζ̇μ̇+2Ẏηξ-2Ẏη̇ξ̇+2Ẏθο-2Ẏ\
    ///        θ̇ο̇+2Zẇμ-2Żvμ-2Żαν̇-2Żα̇ν-2Żβε+2Żβ̇ε̇+2Żγθ̇+2Żγ̇θ-2Żδη̇-2Żδ̇η-2Żζι+2Żζ̇ι̇+2Ż\
    ///        κξ-2Żκ̇ξ̇+2Żλο-2Żλ̇ο̇-2vẇÞ-2vÐ̇ξ-2vØ̇ο+vvÞ̇+2ẇÐξ+2ẇØο+ẇẇÞ̇+2Ð̇αλ̇+2Ð̇α̇λ-2Ð̇βθ̇\
    ///        -2Ð̇β̇θ-2Ð̇γε+2Ð̇γ̇ε̇+2Ð̇δζ̇+2Ð̇δ̇ζ-2Ð̇ηι+2Ð̇η̇ι̇-2Ð̇κμ+2Ð̇κ̇μ̇+2Ð̇νο-2Ð̇ν̇ο̇-2Ø̇ακ̇-2Ø̇α̇κ\
    ///        +2Ø̇βη̇+2Ø̇β̇η-2Ø̇γζ̇-2Ø̇γ̇ζ-2Ø̇δε+2Ø̇δ̇ε̇-2Ø̇θι+2Ø̇θ̇ι̇-2Ø̇λμ+2Ø̇λ̇μ̇-2Ø̇νξ+2Ø̇ν̇ξ̇+Þ̇αα-\
    ///        Þ̇α̇α̇+Þ̇ββ-Þ̇β̇β̇+Þ̇γγ-Þ̇γ̇γ̇+Þ̇δδ-Þ̇δ̇δ̇-Þ̇εε+Þ̇ε̇ε̇+Þ̇ζζ-Þ̇ζ̇ζ̇+Þ̇ηη-Þ̇η̇η̇+Þ̇θθ-Þ̇θ̇θ̇-Þ̇ιι+Þ̇\
    ///        ι̇ι̇+Þ̇κκ-Þ̇κ̇κ̇+Þ̇λλ-Þ̇λ̇λ̇-Þ̇μμ+Þ̇μ̇μ̇+Þ̇νν-Þ̇ν̇ν̇-Þ̇ξξ+Þ̇ξ̇ξ̇-Þ̇οο+Þ̇ο̇ο̇)e012345",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn triple_motor() -> Self {
        Self::scalar() + Self::volume4() + Self::plane() + Self::point()
    }
    /// The multivector of single rotoreflector $`f_{r1} \equiv v^5_0 + v_0`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let single_rotoreflector = Vee::normal().lhs() * Vee::single_rotator().rhs();
    ///
    /// assert_eq!(
    ///     single_rotoreflector.basis_blades(),
    ///     Vee::single_rotoreflector().basis_blades()
    /// );
    /// format_eq!(single_rotoreflector, [
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔ζ͕-ð͔η͕-ø͔θ͕-þ͔ι͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔ζ͕-ð͔κ͕-ø͔λ͕-þ͔μ͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔η͕+z͔κ͕-ø͔ν͕-þ͔ξ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔θ͕+z͔λ͕+ð͔ν͕-þ͔ο͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔ι͕+z͔μ͕+ð͔ξ͕+ø͔ο͕)e6",
    ///     "+(+x͔ζ͕-y͔β͕+z͔α͕)e123",
    ///     "+(+x͔η͕-y͔γ͕+ð͔α͕)e124",
    ///     "+(+x͔θ͕-y͔δ͕+ø͔α͕)e125",
    ///     "+(+x͔ι͕-y͔ε͕+þ͔α͕)e126",
    ///     "+(+x͔κ͕-z͔γ͕+ð͔β͕)e134",
    ///     "+(+x͔λ͕-z͔δ͕+ø͔β͕)e135",
    ///     "+(+x͔μ͕-z͔ε͕+þ͔β͕)e136",
    ///     "+(+x͔ν͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(+x͔ξ͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+x͔ο͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+y͔κ͕-z͔η͕+ð͔ζ͕)e234",
    ///     "+(+y͔λ͕-z͔θ͕+ø͔ζ͕)e235",
    ///     "+(+y͔μ͕-z͔ι͕+þ͔ζ͕)e236",
    ///     "+(+y͔ν͕-ð͔θ͕+ø͔η͕)e245",
    ///     "+(+y͔ξ͕-ð͔ι͕+þ͔η͕)e246",
    ///     "+(+y͔ο͕-ø͔ι͕+þ͔θ͕)e256",
    ///     "+(+z͔ν͕-ð͔λ͕+ø͔κ͕)e345",
    ///     "+(+z͔ξ͕-ð͔μ͕+þ͔κ͕)e346",
    ///     "+(+z͔ο͕-ø͔μ͕+þ͔λ͕)e356",
    ///     "+(+ð͔ο͕-ø͔ξ͕+þ͔ν͕)e456",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_rotoreflector() -> Self {
        Self::normal() + Self::volume_displacement()
    }
    /// The multivector of double rotoreflector $`f_{r2} \equiv v^5_0 + v_0 + \ell_0`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let double_rotoreflector = Vee::normal().lhs() * Vee::double_rotator().rhs();
    ///
    /// assert_eq!(
    ///     double_rotoreflector.basis_blades(),
    ///     Vee::double_rotoreflector().basis_blades()
    /// );
    /// format_eq!(double_rotoreflector, [
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔ζ͕-ð͔η͕-ø͔θ͕-þ͔ι͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔ζ͕-ð͔κ͕-ø͔λ͕-þ͔μ͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔η͕+z͔κ͕-ø͔ν͕-þ͔ξ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔θ͕+z͔λ͕+ð͔ν͕-þ͔ο͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔ι͕+z͔μ͕+ð͔ξ͕+ø͔ο͕)e6",
    ///     "+(+x͔ζ͕-y͔β͕+z͔α͕-ð͔ο͕̇+ø͔ξ͕̇-þ͔ν͕̇)e123",
    ///     "+(+x͔η͕-y͔γ͕+z͔ο͕̇+ð͔α͕-ø͔μ͕̇+þ͔λ͕̇)e124",
    ///     "+(+x͔θ͕-y͔δ͕-z͔ξ͕̇+ð͔μ͕̇+ø͔α͕-þ͔κ͕̇)e125",
    ///     "+(+x͔ι͕-y͔ε͕+z͔ν͕̇-ð͔λ͕̇+ø͔κ͕̇+þ͔α͕)e126",
    ///     "+(+x͔κ͕-y͔ο͕̇-z͔γ͕+ð͔β͕+ø͔ι͕̇-þ͔θ͕̇)e134",
    ///     "+(+x͔λ͕+y͔ξ͕̇-z͔δ͕-ð͔ι͕̇+ø͔β͕+þ͔η͕̇)e135",
    ///     "+(+x͔μ͕-y͔ν͕̇-z͔ε͕+ð͔θ͕̇-ø͔η͕̇+þ͔β͕)e136",
    ///     "+(+x͔ν͕-y͔μ͕̇+z͔ι͕̇-ð͔δ͕+ø͔γ͕-þ͔ζ͕̇)e145",
    ///     "+(+x͔ξ͕+y͔λ͕̇-z͔θ͕̇-ð͔ε͕+ø͔ζ͕̇+þ͔γ͕)e146",
    ///     "+(+x͔ο͕-y͔κ͕̇+z͔η͕̇-ð͔ζ͕̇-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+x͔ο͕̇+y͔κ͕-z͔η͕+ð͔ζ͕-ø͔ε͕̇+þ͔δ͕̇)e234",
    ///     "+(-x͔ξ͕̇+y͔λ͕-z͔θ͕+ð͔ε͕̇+ø͔ζ͕-þ͔γ͕̇)e235",
    ///     "+(+x͔ν͕̇+y͔μ͕-z͔ι͕-ð͔δ͕̇+ø͔γ͕̇+þ͔ζ͕)e236",
    ///     "+(+x͔μ͕̇+y͔ν͕-z͔ε͕̇-ð͔θ͕+ø͔η͕+þ͔β͕̇)e245",
    ///     "+(-x͔λ͕̇+y͔ξ͕+z͔δ͕̇-ð͔ι͕-ø͔β͕̇+þ͔η͕)e246",
    ///     "+(+x͔κ͕̇+y͔ο͕-z͔γ͕̇+ð͔β͕̇-ø͔ι͕+þ͔θ͕)e256",
    ///     "+(-x͔ι͕̇+y͔ε͕̇+z͔ν͕-ð͔λ͕+ø͔κ͕-þ͔α͕̇)e345",
    ///     "+(+x͔θ͕̇-y͔δ͕̇+z͔ξ͕-ð͔μ͕+ø͔α͕̇+þ͔κ͕)e346",
    ///     "+(-x͔η͕̇+y͔γ͕̇+z͔ο͕-ð͔α͕̇-ø͔μ͕+þ͔λ͕)e356",
    ///     "+(+x͔ζ͕̇-y͔β͕̇+z͔α͕̇+ð͔ο͕-ø͔ξ͕+þ͔ν͕)e456",
    ///     "+(+y͔α͕̇+z͔β͕̇+ð͔γ͕̇+ø͔δ͕̇+þ͔ε͕̇)e23456",
    ///     "+(-x͔α͕̇+z͔ζ͕̇+ð͔η͕̇+ø͔θ͕̇+þ͔ι͕̇)e13465",
    ///     "+(-x͔β͕̇-y͔ζ͕̇+ð͔κ͕̇+ø͔λ͕̇+þ͔μ͕̇)e12456",
    ///     "+(-x͔γ͕̇-y͔η͕̇-z͔κ͕̇+ø͔ν͕̇+þ͔ξ͕̇)e12365",
    ///     "+(-x͔δ͕̇-y͔θ͕̇-z͔λ͕̇-ð͔ν͕̇+þ͔ο͕̇)e12346",
    ///     "+(-x͔ε͕̇-y͔ι͕̇-z͔μ͕̇-ð͔ξ͕̇-ø͔ο͕̇)e12354",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_rotoreflector() -> Self {
        Self::normal() + Self::volume_displacement() + Self::line_displacement()
    }
    /// The multivector of transflector $`f_t \equiv v^5 + p_\infty`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let transflector = Vee::normal().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(
    ///     transflector.basis_blades(),
    ///     Vee::transflector().basis_blades()
    /// );
    /// format_eq!(transflector, [
    ///     "+(-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔)e0",
    ///     "+v͕x͔e1",
    ///     "+v͕y͔e2",
    ///     "+v͕z͔e3",
    ///     "+v͕ð͔e4",
    ///     "+v͕ø͔e5",
    ///     "+v͕þ͔e6",
    ///     "+(+X͕y͔-Y͕x͔)e012",
    ///     "+(+X͕z͔-Z͕x͔)e013",
    ///     "+(+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+Y͕z͔-Z͕y͔)e023",
    ///     "+(+Y͕ð͔-y͔Ð͕)e024",
    ///     "+(+Y͕ø͔-y͔Ø͕)e025",
    ///     "+(+Y͕þ͔-y͔Þ͕)e026",
    ///     "+(+Z͕ð͔-z͔Ð͕)e034",
    ///     "+(+Z͕ø͔-z͔Ø͕)e035",
    ///     "+(+Z͕þ͔-z͔Þ͕)e036",
    ///     "+(+Ð͕ø͔-Ø͕ð͔)e045",
    ///     "+(+Ð͕þ͔-Þ͕ð͔)e046",
    ///     "+(+Ø͕þ͔-Þ͕ø͔)e056",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn transflector() -> Self {
        Self::volume5() + Self::volume_moment()
    }
    /// The multivector of single flector $`f_1 \equiv v^5 + v`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let single_flector = Vee::volume5().lhs() * Vee::single_motor().rhs();
    ///
    /// assert_eq!(
    ///     single_flector.basis_blades(),
    ///     Vee::single_flector().basis_blades()
    /// );
    /// format_eq!(single_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔ζ͕-ð͔η͕-ø͔θ͕-þ͔ι͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔ζ͕-ð͔κ͕-ø͔λ͕-þ͔μ͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔η͕+z͔κ͕-ø͔ν͕-þ͔ξ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔θ͕+z͔λ͕+ð͔ν͕-þ͔ο͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔ι͕+z͔μ͕+ð͔ξ͕+ø͔ο͕)e6",
    ///     "+(+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+W͔ζ͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(+W͔η͕+Y͕ð͔-y͔Ð͕)e024",
    ///     "+(+W͔θ͕+Y͕ø͔-y͔Ø͕)e025",
    ///     "+(+W͔ι͕+Y͕þ͔-y͔Þ͕)e026",
    ///     "+(+W͔κ͕+Z͕ð͔-z͔Ð͕)e034",
    ///     "+(+W͔λ͕+Z͕ø͔-z͔Ø͕)e035",
    ///     "+(+W͔μ͕+Z͕þ͔-z͔Þ͕)e036",
    ///     "+(+W͔ν͕+Ð͕ø͔-Ø͕ð͔)e045",
    ///     "+(+W͔ξ͕+Ð͕þ͔-Þ͕ð͔)e046",
    ///     "+(+W͔ο͕+Ø͕þ͔-Þ͕ø͔)e056",
    ///     "+(+x͔ζ͕-y͔β͕+z͔α͕)e123",
    ///     "+(+x͔η͕-y͔γ͕+ð͔α͕)e124",
    ///     "+(+x͔θ͕-y͔δ͕+ø͔α͕)e125",
    ///     "+(+x͔ι͕-y͔ε͕+þ͔α͕)e126",
    ///     "+(+x͔κ͕-z͔γ͕+ð͔β͕)e134",
    ///     "+(+x͔λ͕-z͔δ͕+ø͔β͕)e135",
    ///     "+(+x͔μ͕-z͔ε͕+þ͔β͕)e136",
    ///     "+(+x͔ν͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(+x͔ξ͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+x͔ο͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+y͔κ͕-z͔η͕+ð͔ζ͕)e234",
    ///     "+(+y͔λ͕-z͔θ͕+ø͔ζ͕)e235",
    ///     "+(+y͔μ͕-z͔ι͕+þ͔ζ͕)e236",
    ///     "+(+y͔ν͕-ð͔θ͕+ø͔η͕)e245",
    ///     "+(+y͔ξ͕-ð͔ι͕+þ͔η͕)e246",
    ///     "+(+y͔ο͕-ø͔ι͕+þ͔θ͕)e256",
    ///     "+(+z͔ν͕-ð͔λ͕+ø͔κ͕)e345",
    ///     "+(+z͔ξ͕-ð͔μ͕+þ͔κ͕)e346",
    ///     "+(+z͔ο͕-ø͔μ͕+þ͔λ͕)e356",
    ///     "+(+ð͔ο͕-ø͔ξ͕+þ͔ν͕)e456",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_flector() -> Self {
        Self::volume5() + Self::volume()
    }
    /// The multivector of simple double flector $`f_{s2} \equiv v^5 + v + \ell_\infty`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let simple_double_flector = Vee::volume5().lhs() * Vee::simple_double_motor().rhs();
    ///
    /// assert_eq!(
    ///     simple_double_flector.basis_blades(),
    ///     Vee::simple_double_flector().basis_blades()
    /// );
    /// format_eq!(simple_double_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔ζ͕-ð͔η͕-ø͔θ͕-þ͔ι͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔ζ͕-ð͔κ͕-ø͔λ͕-þ͔μ͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔η͕+z͔κ͕-ø͔ν͕-þ͔ξ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔θ͕+z͔λ͕+ð͔ν͕-þ͔ο͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔ι͕+z͔μ͕+ð͔ξ͕+ø͔ο͕)e6",
    ///     "+(+Q͕̇þ͔-Ṙ͕ø͔+Ṡ͕ð͔-Ṫ͕z͔+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(-Ṅ͕þ͔+Ȯ͕ø͔-Ṗ͕ð͔+Ṫ͕y͔+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+L͕̇þ͔-Ṁ͕ø͔+Ṗ͕z͔-Ṡ͕y͔+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(-K͕̇þ͔+Ṁ͕ð͔-Ȯ͕z͔+Ṙ͕y͔+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+K͕̇ø͔-L͕̇ð͔+Ṅ͕z͔-Q͕̇y͔+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+Ḣ͕þ͔-İ͕ø͔+J͕̇ð͔-Ṫ͕x͔+W͔ζ͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(-Ḟ͕þ͔+Ġ͕ø͔-J͕̇z͔+Ṡ͕x͔+W͔η͕+Y͕ð͔-y͔Ð͕)e024",
    ///     "+(+Ė͕þ͔-Ġ͕ð͔+İ͕z͔-Ṙ͕x͔+W͔θ͕+Y͕ø͔-y͔Ø͕)e025",
    ///     "+(-Ė͕ø͔+Ḟ͕ð͔-Ḣ͕z͔+Q͕̇x͔+W͔ι͕+Y͕þ͔-y͔Þ͕)e026",
    ///     "+(+Ċ͕þ͔-Ḋ͕ø͔+J͕̇y͔-Ṗ͕x͔+W͔κ͕+Z͕ð͔-z͔Ð͕)e034",
    ///     "+(-Ḃ͕þ͔+Ḋ͕ð͔-İ͕y͔+Ȯ͕x͔+W͔λ͕+Z͕ø͔-z͔Ø͕)e035",
    ///     "+(+Ḃ͕ø͔-Ċ͕ð͔+Ḣ͕y͔-Ṅ͕x͔+W͔μ͕+Z͕þ͔-z͔Þ͕)e036",
    ///     "+(+Ȧ͕þ͔-Ḋ͕z͔+Ġ͕y͔-Ṁ͕x͔+W͔ν͕+Ð͕ø͔-Ø͕ð͔)e045",
    ///     "+(-Ȧ͕ø͔+Ċ͕z͔-Ḟ͕y͔+L͕̇x͔+W͔ξ͕+Ð͕þ͔-Þ͕ð͔)e046",
    ///     "+(+Ȧ͕ð͔-Ḃ͕z͔+Ė͕y͔-K͕̇x͔+W͔ο͕+Ø͕þ͔-Þ͕ø͔)e056",
    ///     "+(+x͔ζ͕-y͔β͕+z͔α͕)e123",
    ///     "+(+x͔η͕-y͔γ͕+ð͔α͕)e124",
    ///     "+(+x͔θ͕-y͔δ͕+ø͔α͕)e125",
    ///     "+(+x͔ι͕-y͔ε͕+þ͔α͕)e126",
    ///     "+(+x͔κ͕-z͔γ͕+ð͔β͕)e134",
    ///     "+(+x͔λ͕-z͔δ͕+ø͔β͕)e135",
    ///     "+(+x͔μ͕-z͔ε͕+þ͔β͕)e136",
    ///     "+(+x͔ν͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(+x͔ξ͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+x͔ο͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+y͔κ͕-z͔η͕+ð͔ζ͕)e234",
    ///     "+(+y͔λ͕-z͔θ͕+ø͔ζ͕)e235",
    ///     "+(+y͔μ͕-z͔ι͕+þ͔ζ͕)e236",
    ///     "+(+y͔ν͕-ð͔θ͕+ø͔η͕)e245",
    ///     "+(+y͔ξ͕-ð͔ι͕+þ͔η͕)e246",
    ///     "+(+y͔ο͕-ø͔ι͕+þ͔θ͕)e256",
    ///     "+(+z͔ν͕-ð͔λ͕+ø͔κ͕)e345",
    ///     "+(+z͔ξ͕-ð͔μ͕+þ͔κ͕)e346",
    ///     "+(+z͔ο͕-ø͔μ͕+þ͔λ͕)e356",
    ///     "+(+ð͔ο͕-ø͔ξ͕+þ͔ν͕)e456",
    ///     "+(+Ȧ͕z͔+Ḃ͕ð͔+Ċ͕ø͔+Ḋ͕þ͔)e03456",
    ///     "+(-Ȧ͕y͔+Ė͕ð͔+Ḟ͕ø͔+Ġ͕þ͔)e02465",
    ///     "+(-Ḃ͕y͔-Ė͕z͔+Ḣ͕ø͔+İ͕þ͔)e02356",
    ///     "+(-Ċ͕y͔-Ḟ͕z͔-Ḣ͕ð͔+J͕̇þ͔)e02364",
    ///     "+(-Ḋ͕y͔-Ġ͕z͔-İ͕ð͔-J͕̇ø͔)e02345",
    ///     "+(+Ȧ͕x͔+K͕̇ð͔+L͕̇ø͔+Ṁ͕þ͔)e01456",
    ///     "+(+Ḃ͕x͔-K͕̇z͔+Ṅ͕ø͔+Ȯ͕þ͔)e01365",
    ///     "+(+Ċ͕x͔-L͕̇z͔-Ṅ͕ð͔+Ṗ͕þ͔)e01346",
    ///     "+(+Ḋ͕x͔-Ṁ͕z͔-Ȯ͕ð͔-Ṗ͕ø͔)e01354",
    ///     "+(+Ė͕x͔+K͕̇y͔+Q͕̇ø͔+Ṙ͕þ͔)e01256",
    ///     "+(+Ḟ͕x͔+L͕̇y͔-Q͕̇ð͔+Ṡ͕þ͔)e01264",
    ///     "+(+Ġ͕x͔+Ṁ͕y͔-Ṙ͕ð͔-Ṡ͕ø͔)e01245",
    ///     "+(+Ḣ͕x͔+Ṅ͕y͔+Q͕̇z͔+Ṫ͕þ͔)e01236",
    ///     "+(+İ͕x͔+Ȯ͕y͔+Ṙ͕z͔-Ṫ͕ø͔)e01253",
    ///     "+(+J͕̇x͔+Ṗ͕y͔+Ṡ͕z͔+Ṫ͕ð͔)e01234",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_double_flector() -> Self {
        Self::volume5() + Self::volume() + Self::line_moment()
    }
    /// The multivector of double flector $`f_2 \equiv v^5 + v + \ell`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let double_flector = Vee::volume5().lhs() * Vee::double_motor().rhs();
    ///
    /// assert_eq!(
    ///     double_flector.basis_blades(),
    ///     Vee::double_flector().basis_blades()
    /// );
    /// format_eq!(double_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔ζ͕-ð͔η͕-ø͔θ͕-þ͔ι͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔ζ͕-ð͔κ͕-ø͔λ͕-þ͔μ͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔η͕+z͔κ͕-ø͔ν͕-þ͔ξ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔θ͕+z͔λ͕+ð͔ν͕-þ͔ο͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔ι͕+z͔μ͕+ð͔ξ͕+ø͔ο͕)e6",
    ///     "+(+Q͕̇þ͔-Ṙ͕ø͔+Ṡ͕ð͔-Ṫ͕z͔+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(-Ṅ͕þ͔+Ȯ͕ø͔-Ṗ͕ð͔+Ṫ͕y͔+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+L͕̇þ͔-Ṁ͕ø͔+Ṗ͕z͔-Ṡ͕y͔+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(-K͕̇þ͔+Ṁ͕ð͔-Ȯ͕z͔+Ṙ͕y͔+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+K͕̇ø͔-L͕̇ð͔+Ṅ͕z͔-Q͕̇y͔+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+Ḣ͕þ͔-İ͕ø͔+J͕̇ð͔-Ṫ͕x͔+W͔ζ͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(-Ḟ͕þ͔+Ġ͕ø͔-J͕̇z͔+Ṡ͕x͔+W͔η͕+Y͕ð͔-y͔Ð͕)e024",
    ///     "+(+Ė͕þ͔-Ġ͕ð͔+İ͕z͔-Ṙ͕x͔+W͔θ͕+Y͕ø͔-y͔Ø͕)e025",
    ///     "+(-Ė͕ø͔+Ḟ͕ð͔-Ḣ͕z͔+Q͕̇x͔+W͔ι͕+Y͕þ͔-y͔Þ͕)e026",
    ///     "+(+Ċ͕þ͔-Ḋ͕ø͔+J͕̇y͔-Ṗ͕x͔+W͔κ͕+Z͕ð͔-z͔Ð͕)e034",
    ///     "+(-Ḃ͕þ͔+Ḋ͕ð͔-İ͕y͔+Ȯ͕x͔+W͔λ͕+Z͕ø͔-z͔Ø͕)e035",
    ///     "+(+Ḃ͕ø͔-Ċ͕ð͔+Ḣ͕y͔-Ṅ͕x͔+W͔μ͕+Z͕þ͔-z͔Þ͕)e036",
    ///     "+(+Ȧ͕þ͔-Ḋ͕z͔+Ġ͕y͔-Ṁ͕x͔+W͔ν͕+Ð͕ø͔-Ø͕ð͔)e045",
    ///     "+(-Ȧ͕ø͔+Ċ͕z͔-Ḟ͕y͔+L͕̇x͔+W͔ξ͕+Ð͕þ͔-Þ͕ð͔)e046",
    ///     "+(+Ȧ͕ð͔-Ḃ͕z͔+Ė͕y͔-K͕̇x͔+W͔ο͕+Ø͕þ͔-Þ͕ø͔)e056",
    ///     "+(+x͔ζ͕-y͔β͕+z͔α͕-ð͔ο͕̇+ø͔ξ͕̇-þ͔ν͕̇)e123",
    ///     "+(+x͔η͕-y͔γ͕+z͔ο͕̇+ð͔α͕-ø͔μ͕̇+þ͔λ͕̇)e124",
    ///     "+(+x͔θ͕-y͔δ͕-z͔ξ͕̇+ð͔μ͕̇+ø͔α͕-þ͔κ͕̇)e125",
    ///     "+(+x͔ι͕-y͔ε͕+z͔ν͕̇-ð͔λ͕̇+ø͔κ͕̇+þ͔α͕)e126",
    ///     "+(+x͔κ͕-y͔ο͕̇-z͔γ͕+ð͔β͕+ø͔ι͕̇-þ͔θ͕̇)e134",
    ///     "+(+x͔λ͕+y͔ξ͕̇-z͔δ͕-ð͔ι͕̇+ø͔β͕+þ͔η͕̇)e135",
    ///     "+(+x͔μ͕-y͔ν͕̇-z͔ε͕+ð͔θ͕̇-ø͔η͕̇+þ͔β͕)e136",
    ///     "+(+x͔ν͕-y͔μ͕̇+z͔ι͕̇-ð͔δ͕+ø͔γ͕-þ͔ζ͕̇)e145",
    ///     "+(+x͔ξ͕+y͔λ͕̇-z͔θ͕̇-ð͔ε͕+ø͔ζ͕̇+þ͔γ͕)e146",
    ///     "+(+x͔ο͕-y͔κ͕̇+z͔η͕̇-ð͔ζ͕̇-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+x͔ο͕̇+y͔κ͕-z͔η͕+ð͔ζ͕-ø͔ε͕̇+þ͔δ͕̇)e234",
    ///     "+(-x͔ξ͕̇+y͔λ͕-z͔θ͕+ð͔ε͕̇+ø͔ζ͕-þ͔γ͕̇)e235",
    ///     "+(+x͔ν͕̇+y͔μ͕-z͔ι͕-ð͔δ͕̇+ø͔γ͕̇+þ͔ζ͕)e236",
    ///     "+(+x͔μ͕̇+y͔ν͕-z͔ε͕̇-ð͔θ͕+ø͔η͕+þ͔β͕̇)e245",
    ///     "+(-x͔λ͕̇+y͔ξ͕+z͔δ͕̇-ð͔ι͕-ø͔β͕̇+þ͔η͕)e246",
    ///     "+(+x͔κ͕̇+y͔ο͕-z͔γ͕̇+ð͔β͕̇-ø͔ι͕+þ͔θ͕)e256",
    ///     "+(-x͔ι͕̇+y͔ε͕̇+z͔ν͕-ð͔λ͕+ø͔κ͕-þ͔α͕̇)e345",
    ///     "+(+x͔θ͕̇-y͔δ͕̇+z͔ξ͕-ð͔μ͕+ø͔α͕̇+þ͔κ͕)e346",
    ///     "+(-x͔η͕̇+y͔γ͕̇+z͔ο͕-ð͔α͕̇-ø͔μ͕+þ͔λ͕)e356",
    ///     "+(+x͔ζ͕̇-y͔β͕̇+z͔α͕̇+ð͔ο͕-ø͔ξ͕+þ͔ν͕)e456",
    ///     "+(+y͔α͕̇+z͔β͕̇+ð͔γ͕̇+ø͔δ͕̇+þ͔ε͕̇)e23456",
    ///     "+(-x͔α͕̇+z͔ζ͕̇+ð͔η͕̇+ø͔θ͕̇+þ͔ι͕̇)e13465",
    ///     "+(-x͔β͕̇-y͔ζ͕̇+ð͔κ͕̇+ø͔λ͕̇+þ͔μ͕̇)e12456",
    ///     "+(-x͔γ͕̇-y͔η͕̇-z͔κ͕̇+ø͔ν͕̇+þ͔ξ͕̇)e12365",
    ///     "+(-x͔δ͕̇-y͔θ͕̇-z͔λ͕̇-ð͔ν͕̇+þ͔ο͕̇)e12346",
    ///     "+(-x͔ε͕̇-y͔ι͕̇-z͔μ͕̇-ð͔ξ͕̇-ø͔ο͕̇)e12354",
    ///     "+(+Ȧ͕z͔+Ḃ͕ð͔+Ċ͕ø͔+Ḋ͕þ͔+W͔α͕̇)e03456",
    ///     "+(-Ȧ͕y͔+Ė͕ð͔+Ḟ͕ø͔+Ġ͕þ͔+W͔β͕̇)e02465",
    ///     "+(-Ḃ͕y͔-Ė͕z͔+Ḣ͕ø͔+İ͕þ͔+W͔γ͕̇)e02356",
    ///     "+(-Ċ͕y͔-Ḟ͕z͔-Ḣ͕ð͔+J͕̇þ͔+W͔δ͕̇)e02364",
    ///     "+(-Ḋ͕y͔-Ġ͕z͔-İ͕ð͔-J͕̇ø͔+W͔ε͕̇)e02345",
    ///     "+(+Ȧ͕x͔+K͕̇ð͔+L͕̇ø͔+Ṁ͕þ͔+W͔ζ͕̇)e01456",
    ///     "+(+Ḃ͕x͔-K͕̇z͔+Ṅ͕ø͔+Ȯ͕þ͔+W͔η͕̇)e01365",
    ///     "+(+Ċ͕x͔-L͕̇z͔-Ṅ͕ð͔+Ṗ͕þ͔+W͔θ͕̇)e01346",
    ///     "+(+Ḋ͕x͔-Ṁ͕z͔-Ȯ͕ð͔-Ṗ͕ø͔+W͔ι͕̇)e01354",
    ///     "+(+Ė͕x͔+K͕̇y͔+Q͕̇ø͔+Ṙ͕þ͔+W͔κ͕̇)e01256",
    ///     "+(+Ḟ͕x͔+L͕̇y͔-Q͕̇ð͔+Ṡ͕þ͔+W͔λ͕̇)e01264",
    ///     "+(+Ġ͕x͔+Ṁ͕y͔-Ṙ͕ð͔-Ṡ͕ø͔+W͔μ͕̇)e01245",
    ///     "+(+Ḣ͕x͔+Ṅ͕y͔+Q͕̇z͔+Ṫ͕þ͔+W͔ν͕̇)e01236",
    ///     "+(+İ͕x͔+Ȯ͕y͔+Ṙ͕z͔-Ṫ͕ø͔+W͔ξ͕̇)e01253",
    ///     "+(+J͕̇x͔+Ṗ͕y͔+Ṡ͕z͔+Ṫ͕ð͔+W͔ο͕̇)e01234",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_flector() -> Self {
        Self::volume5() + Self::volume() + Self::line()
    }
    /// The multivector of triple flector $`f_3 \equiv v^5 + v + \ell + S`$.
    ///
    /// ```
    /// use vee::{PgaP6 as Vee, format_eq};
    ///
    /// let triple_flector = Vee::volume5().lhs() * Vee::triple_motor().rhs();
    ///
    /// assert_eq!(
    ///     triple_flector.basis_blades(),
    ///     Vee::triple_flector().basis_blades()
    /// );
    /// format_eq!(triple_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔ζ͕-ð͔η͕-ø͔θ͕-þ͔ι͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔ζ͕-ð͔κ͕-ø͔λ͕-þ͔μ͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔η͕+z͔κ͕-ø͔ν͕-þ͔ξ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔θ͕+z͔λ͕+ð͔ν͕-þ͔ο͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔ι͕+z͔μ͕+ð͔ξ͕+ø͔ο͕)e6",
    ///     "+(+Q͕̇þ͔-Ṙ͕ø͔+Ṡ͕ð͔-Ṫ͕z͔+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(-Ṅ͕þ͔+Ȯ͕ø͔-Ṗ͕ð͔+Ṫ͕y͔+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+L͕̇þ͔-Ṁ͕ø͔+Ṗ͕z͔-Ṡ͕y͔+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(-K͕̇þ͔+Ṁ͕ð͔-Ȯ͕z͔+Ṙ͕y͔+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+K͕̇ø͔-L͕̇ð͔+Ṅ͕z͔-Q͕̇y͔+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+Ḣ͕þ͔-İ͕ø͔+J͕̇ð͔-Ṫ͕x͔+W͔ζ͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(-Ḟ͕þ͔+Ġ͕ø͔-J͕̇z͔+Ṡ͕x͔+W͔η͕+Y͕ð͔-y͔Ð͕)e024",
    ///     "+(+Ė͕þ͔-Ġ͕ð͔+İ͕z͔-Ṙ͕x͔+W͔θ͕+Y͕ø͔-y͔Ø͕)e025",
    ///     "+(-Ė͕ø͔+Ḟ͕ð͔-Ḣ͕z͔+Q͕̇x͔+W͔ι͕+Y͕þ͔-y͔Þ͕)e026",
    ///     "+(+Ċ͕þ͔-Ḋ͕ø͔+J͕̇y͔-Ṗ͕x͔+W͔κ͕+Z͕ð͔-z͔Ð͕)e034",
    ///     "+(-Ḃ͕þ͔+Ḋ͕ð͔-İ͕y͔+Ȯ͕x͔+W͔λ͕+Z͕ø͔-z͔Ø͕)e035",
    ///     "+(+Ḃ͕ø͔-Ċ͕ð͔+Ḣ͕y͔-Ṅ͕x͔+W͔μ͕+Z͕þ͔-z͔Þ͕)e036",
    ///     "+(+Ȧ͕þ͔-Ḋ͕z͔+Ġ͕y͔-Ṁ͕x͔+W͔ν͕+Ð͕ø͔-Ø͕ð͔)e045",
    ///     "+(-Ȧ͕ø͔+Ċ͕z͔-Ḟ͕y͔+L͕̇x͔+W͔ξ͕+Ð͕þ͔-Þ͕ð͔)e046",
    ///     "+(+Ȧ͕ð͔-Ḃ͕z͔+Ė͕y͔-K͕̇x͔+W͔ο͕+Ø͕þ͔-Þ͕ø͔)e056",
    ///     "+(+x͔ζ͕-y͔β͕+z͔α͕-ð͔ο͕̇+ø͔ξ͕̇-þ͔ν͕̇)e123",
    ///     "+(+x͔η͕-y͔γ͕+z͔ο͕̇+ð͔α͕-ø͔μ͕̇+þ͔λ͕̇)e124",
    ///     "+(+x͔θ͕-y͔δ͕-z͔ξ͕̇+ð͔μ͕̇+ø͔α͕-þ͔κ͕̇)e125",
    ///     "+(+x͔ι͕-y͔ε͕+z͔ν͕̇-ð͔λ͕̇+ø͔κ͕̇+þ͔α͕)e126",
    ///     "+(+x͔κ͕-y͔ο͕̇-z͔γ͕+ð͔β͕+ø͔ι͕̇-þ͔θ͕̇)e134",
    ///     "+(+x͔λ͕+y͔ξ͕̇-z͔δ͕-ð͔ι͕̇+ø͔β͕+þ͔η͕̇)e135",
    ///     "+(+x͔μ͕-y͔ν͕̇-z͔ε͕+ð͔θ͕̇-ø͔η͕̇+þ͔β͕)e136",
    ///     "+(+x͔ν͕-y͔μ͕̇+z͔ι͕̇-ð͔δ͕+ø͔γ͕-þ͔ζ͕̇)e145",
    ///     "+(+x͔ξ͕+y͔λ͕̇-z͔θ͕̇-ð͔ε͕+ø͔ζ͕̇+þ͔γ͕)e146",
    ///     "+(+x͔ο͕-y͔κ͕̇+z͔η͕̇-ð͔ζ͕̇-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+x͔ο͕̇+y͔κ͕-z͔η͕+ð͔ζ͕-ø͔ε͕̇+þ͔δ͕̇)e234",
    ///     "+(-x͔ξ͕̇+y͔λ͕-z͔θ͕+ð͔ε͕̇+ø͔ζ͕-þ͔γ͕̇)e235",
    ///     "+(+x͔ν͕̇+y͔μ͕-z͔ι͕-ð͔δ͕̇+ø͔γ͕̇+þ͔ζ͕)e236",
    ///     "+(+x͔μ͕̇+y͔ν͕-z͔ε͕̇-ð͔θ͕+ø͔η͕+þ͔β͕̇)e245",
    ///     "+(-x͔λ͕̇+y͔ξ͕+z͔δ͕̇-ð͔ι͕-ø͔β͕̇+þ͔η͕)e246",
    ///     "+(+x͔κ͕̇+y͔ο͕-z͔γ͕̇+ð͔β͕̇-ø͔ι͕+þ͔θ͕)e256",
    ///     "+(-x͔ι͕̇+y͔ε͕̇+z͔ν͕-ð͔λ͕+ø͔κ͕-þ͔α͕̇)e345",
    ///     "+(+x͔θ͕̇-y͔δ͕̇+z͔ξ͕-ð͔μ͕+ø͔α͕̇+þ͔κ͕)e346",
    ///     "+(-x͔η͕̇+y͔γ͕̇+z͔ο͕-ð͔α͕̇-ø͔μ͕+þ͔λ͕)e356",
    ///     "+(+x͔ζ͕̇-y͔β͕̇+z͔α͕̇+ð͔ο͕-ø͔ξ͕+þ͔ν͕)e456",
    ///     "+(+ẇ͕x͔+y͔α͕̇+z͔β͕̇+ð͔γ͕̇+ø͔δ͕̇+þ͔ε͕̇)e23456",
    ///     "+(+ẇ͕y͔-x͔α͕̇+z͔ζ͕̇+ð͔η͕̇+ø͔θ͕̇+þ͔ι͕̇)e13465",
    ///     "+(+ẇ͕z͔-x͔β͕̇-y͔ζ͕̇+ð͔κ͕̇+ø͔λ͕̇+þ͔μ͕̇)e12456",
    ///     "+(+ẇ͕ð͔-x͔γ͕̇-y͔η͕̇-z͔κ͕̇+ø͔ν͕̇+þ͔ξ͕̇)e12365",
    ///     "+(+ẇ͕ø͔-x͔δ͕̇-y͔θ͕̇-z͔λ͕̇-ð͔ν͕̇+þ͔ο͕̇)e12346",
    ///     "+(+ẇ͕þ͔-x͔ε͕̇-y͔ι͕̇-z͔μ͕̇-ð͔ξ͕̇-ø͔ο͕̇)e12354",
    ///     "+(+Ȧ͕z͔+Ḃ͕ð͔+Ċ͕ø͔+Ḋ͕þ͔+W͔α͕̇+Ẋ͕y͔-Ẏ͕x͔)e03456",
    ///     "+(-Ȧ͕y͔+Ė͕ð͔+Ḟ͕ø͔+Ġ͕þ͔+W͔β͕̇+Ẋ͕z͔-Ż͕x͔)e02465",
    ///     "+(-Ḃ͕y͔-Ė͕z͔+Ḣ͕ø͔+İ͕þ͔+W͔γ͕̇+Ẋ͕ð͔-x͔Ð͕̇)e02356",
    ///     "+(-Ċ͕y͔-Ḟ͕z͔-Ḣ͕ð͔+J͕̇þ͔+W͔δ͕̇+Ẋ͕ø͔-x͔Ø͕̇)e02364",
    ///     "+(-Ḋ͕y͔-Ġ͕z͔-İ͕ð͔-J͕̇ø͔+W͔ε͕̇+Ẋ͕þ͔-x͔Þ͕̇)e02345",
    ///     "+(+Ȧ͕x͔+K͕̇ð͔+L͕̇ø͔+Ṁ͕þ͔+W͔ζ͕̇+Ẏ͕z͔-Ż͕y͔)e01456",
    ///     "+(+Ḃ͕x͔-K͕̇z͔+Ṅ͕ø͔+Ȯ͕þ͔+W͔η͕̇+Ẏ͕ð͔-y͔Ð͕̇)e01365",
    ///     "+(+Ċ͕x͔-L͕̇z͔-Ṅ͕ð͔+Ṗ͕þ͔+W͔θ͕̇+Ẏ͕ø͔-y͔Ø͕̇)e01346",
    ///     "+(+Ḋ͕x͔-Ṁ͕z͔-Ȯ͕ð͔-Ṗ͕ø͔+W͔ι͕̇+Ẏ͕þ͔-y͔Þ͕̇)e01354",
    ///     "+(+Ė͕x͔+K͕̇y͔+Q͕̇ø͔+Ṙ͕þ͔+W͔κ͕̇+Ż͕ð͔-z͔Ð͕̇)e01256",
    ///     "+(+Ḟ͕x͔+L͕̇y͔-Q͕̇ð͔+Ṡ͕þ͔+W͔λ͕̇+Ż͕ø͔-z͔Ø͕̇)e01264",
    ///     "+(+Ġ͕x͔+Ṁ͕y͔-Ṙ͕ð͔-Ṡ͕ø͔+W͔μ͕̇+Ż͕þ͔-z͔Þ͕̇)e01245",
    ///     "+(+Ḣ͕x͔+Ṅ͕y͔+Q͕̇z͔+Ṫ͕þ͔+W͔ν͕̇+Ð͕̇ø͔-Ø͕̇ð͔)e01236",
    ///     "+(+İ͕x͔+Ȯ͕y͔+Ṙ͕z͔-Ṫ͕ø͔+W͔ξ͕̇+Ð͕̇þ͔-Þ͕̇ð͔)e01253",
    ///     "+(+J͕̇x͔+Ṗ͕y͔+Ṡ͕z͔+Ṫ͕ð͔+W͔ο͕̇+Ø͕̇þ͔-Þ͕̇ø͔)e01234",
    ///     "+(+W͔ẇ͕+Ẋ͕x͔+Ẏ͕y͔+Ż͕z͔+Ð͕̇ð͔+Ø͕̇ø͔+Þ͕̇þ͔)I",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn triple_flector() -> Self {
        Self::volume5() + Self::volume() + Self::line() + Self::pseudoscalar()
    }
}
