// Copyright © 2025-2026 Rouven Spreckels <rs@qu1x.dev>
//
// This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of
// the MPL was not distributed with this file, You can obtain one at https://mozilla.org/MPL/2.0/.

use super::{BasisBlade, Multivector, Pga, Symbol};

#[rustfmt::skip]
basis!(TAB7, LUT7, 7, [
    // 1
    ('v', e),
    // 1
    ('W', e0),
    // 7
    ('x', e1),
    ('y', e2),
    ('z', e3),
    ('ð', e4),
    ('ø', e5),
    ('þ', e6),
    ('œ', e7),
    // 7
    ('X', e01),
    ('Y', e02),
    ('Z', e03),
    ('Ð', e04),
    ('Ø', e05),
    ('Þ', e06),
    ('Œ', e07),
    // 21
    ('α', e12),
    ('β', e13),
    ('γ', e14),
    ('δ', e15),
    ('ε', e16),
    ('ζ', e17),
    ('η', e23),
    ('θ', e24),
    ('ι', e25),
    ('κ', e26),
    ('λ', e27),
    ('μ', e34),
    ('ν', e35),
    ('ξ', e36),
    ('ο', e37),
    ('π', e45),
    ('ρ', e46),
    ('σ', e47),
    ('τ', e56),
    ('υ', e57),
    ('φ', e67),
    // 21
    ('Α', e012),
    ('Β', e013),
    ('Γ', e014),
    ('Δ', e015),
    ('Ε', e016),
    ('Ζ', e017),
    ('Η', e023),
    ('Θ', e024),
    ('Ι', e025),
    ('Κ', e026),
    ('Λ', e027),
    ('Μ', e034),
    ('Ν', e035),
    ('Ξ', e036),
    ('Ο', e037),
    ('Π', e045),
    ('Ρ', e046),
    ('Σ', e047),
    ('Τ', e056),
    ('Υ', e057),
    ('Φ', e067),
    // 35
    ('a', e123),
    ('b', e124),
    ('c', e125),
    ('d', e126),
    ('e', e127),
    ('f', e134),
    ('g', e135),
    ('h', e136),
    ('i', e137),
    ('j', e145),
    ('k', e146),
    ('l', e147),
    ('m', e156),
    ('n', e157),
    ('o', e167),
    ('p', e234),
    ('q', e235),
    ('r', e236),
    ('s', e237),
    ('t', e245),
    ('u', e246),
    ('á', e247),
    ('ä', e256),
    ('å', e257),
    ('æ', e267),
    ('ç', e345),
    ('é', e346),
    ('ë', e347),
    ('í', e356),
    ('ï', e357),
    ('ñ', e367),
    ('ó', e456),
    ('ö', e457),
    ('ú', e467),
    ('ü', e567),
    // 35
    ('A', e0123),
    ('B', e0124),
    ('C', e0125),
    ('D', e0126),
    ('E', e0127),
    ('F', e0134),
    ('G', e0135),
    ('H', e0136),
    ('I', e0137),
    ('J', e0145),
    ('K', e0146),
    ('L', e0147),
    ('M', e0156),
    ('N', e0157),
    ('O', e0167),
    ('P', e0234),
    ('Q', e0235),
    ('R', e0236),
    ('S', e0237),
    ('T', e0245),
    ('U', e0246),
    ('Á', e0247),
    ('Ä', e0256),
    ('Å', e0257),
    ('Æ', e0267),
    ('Ç', e0345),
    ('É', e0346),
    ('Ë', e0347),
    ('Í', e0356),
    ('Ï', e0357),
    ('Ñ', e0367),
    ('Ó', e0456),
    ('Ö', e0457),
    ('Ú', e0467),
    ('Ü', e0567),
    // 35
    ('ü', e1234),
    ('ú', e1253),
    ('ö', e1236),
    ('ó', e1273),
    ('ñ', e1245),
    ('ï', e1264),
    ('í', e1247),
    ('ë', e1256),
    ('é', e1275),
    ('ç', e1267),
    ('æ', e1354),
    ('å', e1346),
    ('ä', e1374),
    ('á', e1365),
    ('u', e1357),
    ('t', e1376),
    ('s', e1456),
    ('r', e1475),
    ('q', e1467),
    ('p', e1576),
    ('o', e2345),
    ('n', e2364),
    ('m', e2347),
    ('l', e2356),
    ('k', e2375),
    ('j', e2367),
    ('i', e2465),
    ('h', e2457),
    ('g', e2476),
    ('f', e2567),
    ('e', e3456),
    ('d', e3475),
    ('c', e3467),
    ('b', e3576),
    ('a', e4567),
    // 35
    ('Ü', e01243),
    ('Ú', e01235),
    ('Ö', e01263),
    ('Ó', e01237),
    ('Ñ', e01254),
    ('Ï', e01246),
    ('Í', e01274),
    ('Ë', e01265),
    ('É', e01257),
    ('Ç', e01276),
    ('Æ', e01345),
    ('Å', e01364),
    ('Ä', e01347),
    ('Á', e01356),
    ('U', e01375),
    ('T', e01367),
    ('S', e01465),
    ('R', e01457),
    ('Q', e01476),
    ('P', e01567),
    ('O', e02354),
    ('N', e02346),
    ('M', e02374),
    ('L', e02365),
    ('K', e02357),
    ('J', e02376),
    ('I', e02456),
    ('H', e02475),
    ('G', e02467),
    ('F', e02576),
    ('E', e03465),
    ('D', e03457),
    ('C', e03476),
    ('B', e03567),
    ('A', e04576),
    // 21
    ('φ', e12345),
    ('υ', e12364),
    ('τ', e12347),
    ('σ', e12356),
    ('ρ', e12375),
    ('π', e12367),
    ('ο', e12465),
    ('ξ', e12457),
    ('ν', e12476),
    ('μ', e12567),
    ('λ', e13456),
    ('κ', e13475),
    ('ι', e13467),
    ('θ', e13576),
    ('η', e14567),
    ('ζ', e23465),
    ('ε', e23457),
    ('δ', e23476),
    ('γ', e23567),
    ('β', e24576),
    ('α', e34567),
    // 21
    ('Φ', e012345),
    ('Υ', e012364),
    ('Τ', e012347),
    ('Σ', e012356),
    ('Ρ', e012375),
    ('Π', e012367),
    ('Ο', e012465),
    ('Ξ', e012457),
    ('Ν', e012476),
    ('Μ', e012567),
    ('Λ', e013456),
    ('Κ', e013475),
    ('Ι', e013467),
    ('Θ', e013576),
    ('Η', e014567),
    ('Ζ', e023465),
    ('Ε', e023457),
    ('Δ', e023476),
    ('Γ', e023567),
    ('Β', e024576),
    ('Α', e034567),
    // 7
    ('œ', e123456),
    ('þ', e123475),
    ('ø', e123467),
    ('ð', e123576),
    ('z', e124567),
    ('y', e134576),
    ('x', e234567),
    // 7
    ('Œ', e0123465),
    ('Þ', e0123457),
    ('Ø', e0123476),
    ('Ð', e0123567),
    ('Z', e0124576),
    ('Y', e0134567),
    ('X', e0234576),
    // 1
    ('w', e1234567),
    // 1
    ('V', e01234567),
]);

/// The named entities of the PGA with embedded dimension $`N = 7`$.
impl<const M: i8> Multivector<Pga<M, 7>> {
    /// The multivector of scalar $`s \equiv v\e`$ where $`\e \equiv 1`$.
    #[must_use]
    #[inline]
    pub fn scalar() -> Self {
        Self::e()
    }
    /// The multivector of pseudoscalar $`S \equiv V\I`$ where $`\I \equiv \e_{0123456}`$.
    #[must_use]
    #[inline]
    pub fn pseudoscalar() -> Self {
        Self::e01234567()
    }
    /// The multivector of norm $`n \equiv s + v + S`$.
    ///
    /// Quadvector $`v`$ does not square to a scalar, therefore $`n`$ is **not** a generalized
    /// complex number.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let quadvector_norm_squared = Vee::volume().norm_squared();
    ///
    /// assert_eq!(
    ///     quadvector_norm_squared.basis_blades(),
    ///     Vee::norm().basis_blades()
    /// );
    /// format_eq!(quadvector_norm_squared, [
    ///     "+aa+bb+cc+dd+ee+ff+gg+hh+ii+jj+kk+ll+mm+nn+oo+pp+qq\
    ///      +rr+ss+tt+uu+áá+ää+åå+ææ+çç+éé+ëë+íí+ïï+ññ+óó+öö+úú+üü",
    ///     "+2(-cç-dé-eë+gt+hu+iá-jq-kr-ls)e1234",
    ///     "+2(-Jo+Kn-Lm-Ml+Nk-Oj-Tæ+Uå-tÆ+uÅ-Áä-Äá-Çñ+Éï-Ëí-Íë+Ïé-Ñç)e0123",
    ///     "+2(+Go-Hn+Im+Mi-Nh+Og+Qæ-Rå+Sä+qÆ-rÅ+sÄ-Çú+Éö-Ëó-Óë+Öé-Úç)e0124",
    ///     "+2(-Fo+Hl-Ik-Ki+Lh-Of-Pæ+Rá-Su-Us-pÆ+rÁ-Çü+Íö-Ïó-Óï+Öí-Üç)e0125",
    ///     "+2(+Fn-Gl+Ij+Ji-Lg+Nf+På-Qá+St+Ts+pÅ-qÁ-Éü+Íú-Ñó-Óñ+Úí-Üé)e0126",
    ///     "+2(-Fm+Gk-Hj-Jh+Kg-Mf-Pä+Qu-Rt-Tr+Uq-pÄ-Ëü+Ïú-Ñö-Öñ+Úï-Üë)e0127",
    ///     "+2(-Co+Dn-Em-Me+Nd-Oc+Qñ-Rï+Sí+Tú-Uö+qÑ-rÏ+sÍ+tÚ-uÖ+Áó+Óá)e0134",
    ///     "+2(+Bo-Dl+Ek+Ke-Ld+Ob-Pñ+Rë-Sé+Tü-pÑ+rË-sÉ+tÜ-Äö+Åó+Óå-Öä)e0135",
    ///     "+2(-Bn+Cl-Ej-Je+Lc-Nb+Pï-Që+Sç+Uü+pÏ-qË+sÇ+uÜ-Äú+Æó+Óæ-Úä)e0136",
    ///     "+2(+Bm-Ck+Dj+Jd-Kc+Mb-Pí+Qé-Rç-pÍ+qÉ-rÇ+Áü-Åú+Æö+Öæ-Úå+Üá)e0137",
    ///     "+2(-Ao+Di-Eh-He+Id-Oa-Pú-Qü+Uë-pÚ-qÜ+uË-Áé+Äï-Åí-Éá-Íå+Ïä)e0145",
    ///     "+2(+An-Ci+Eg+Ge-Ic+Na+Pö-Rü-Të+pÖ-rÜ-tË+Áç+Äñ-Æí+Çá-Íæ+Ñä)e0146",
    ///     "+2(-Am+Ch-Dg-Gd+Hc-Ma-Pó-Sü+Té-Uç-pÓ-sÜ+tÉ-uÇ+Åñ-Æï-Ïæ+Ñå)e0147",
    ///     "+2(-Al+Bi-Ef-Fe+Ib-La+Qö+Rú-Tï-Uñ+qÖ+rÚ-tÏ-uÑ+Åç+Æé+Çå+Éæ)e0156",
    ///     "+2(+Ak-Bh+Df+Fd-Hb+Ka-Qó+Sú+Tí-qÓ+sÚ+tÍ-Áñ-Äç+Æë-Çä+Ëæ-Ñá)e0157",
    ///     "+2(-Aj+Bg-Cf-Fc+Gb-Ja-Ró-Sö+Uí-rÓ-sÖ+uÍ+Áï-Äé-Åë-Éä-Ëå+Ïá)e0167",
    ///     "+2(-Cæ+Då-Eä-Gñ+Hï-Ií-Jú+Kö-Ló-cÆ+dÅ-eÄ-gÑ+hÏ-iÍ-jÚ+kÖ-lÓ)e0234",
    ///     "+2(+Bæ-Dá+Eu+Fñ-Hë+Ié-Jü+Mö-Nó+Ue+bÆ-dÁ+fÑ-hË+iÉ-jÜ+mÖ-nÓ)e0235",
    ///     "+2(-Bå+Cá-Et-Fï+Gë-Iç-Kü+Mú-Oó-Te-bÅ+cÁ-fÏ+gË-iÇ-kÜ+mÚ-oÓ)e0236",
    ///     "+2(+Bä-Cu+Dt+Fí-Gé+Hç-Lü+Nú-Oö+Td-Uc+bÄ+fÍ-gÉ+hÇ-lÜ+nÚ-oÖ)e0237",
    ///     "+2(-Aæ+Ds-Er+Fú+Gü-Kë+Lé-Mï+Ní-Re+Sd-aÆ+fÚ+gÜ-kË+lÉ-mÏ+nÍ)e0245",
    ///     "+2(+Aå-Cs+Eq-Fö+Hü+Jë-Lç-Mñ+Oí+Qe-Sc+aÅ-fÖ+hÜ+jË-lÇ-mÑ+oÍ)e0246",
    ///     "+2(-Aä+Cr-Dq+Fó+Iü-Jé+Kç-Nñ+Oï-Qd+Rc-aÄ+fÓ+iÜ-jÉ+kÇ-nÑ+oÏ)e0247",
    ///     "+2(-Aá+Bs-Ep-Gö-Hú+Jï+Kñ-Nç-Oé-Pe+Sb-aÁ-gÖ-hÚ+jÏ+kÑ-nÇ-oÉ)e0256",
    ///     "+2(+Au-Br+Dp+Gó-Iú-Jí+Lñ+Mç-Oë+Pd-Rb+Ua+gÓ-iÚ-jÍ+lÑ+mÇ-oË)e0257",
    ///     "+2(-At+Bq-Cp+Hó+Iö-Kí-Lï+Mé+Në-Pc+Qb-Ta+hÓ+iÖ-kÍ-lÏ+mÉ+nË)e0267",
    ///     "+2(-Añ-Bú-Cü+Hs-Ir+Ká-Lu+Må-Nä-Ri+Sh-Ul-aÑ-bÚ-cÜ+kÁ+mÅ-nÄ)e0345",
    ///     "+2(+Aï+Bö-Dü-Gs+Iq-Já+Lt+Mæ-Oä+Qi-Sg+Tl+aÏ+bÖ-dÜ-jÁ+mÆ-oÄ)e0346",
    ///     "+2(-Aí-Bó-Eü+Gr-Hq+Ju-Kt+Næ-Oå-Qh+Rg-Tk+Uj-aÍ-bÓ-eÜ+nÆ-oÅ)e0347",
    ///     "+2(-Aë+Cö+Dú+Fs-Ip-Jå-Kæ+Nt+Ou-Pi+Sf+Tn+Uo-aË+cÖ+dÚ-jÅ-kÆ)e0356",
    ///     "+2(+Aé-Có+Eú-Fr+Hp+Jä-Læ-Mt+Oá+Ph-Rf-Tm+aÉ-cÓ+eÚ+jÄ-lÆ+oÁ)e0357",
    ///     "+2(-Aç-Dó-Eö+Fq-Gp+Kä+Lå-Mu-Ná-Pg+Qf-Um-aÇ-dÓ-eÖ+kÄ+lÅ-nÁ)e0367",
    ///     "+2(-Bë-Cï-Dñ+Fá+Gå+Hæ-Lp-Nq-Or-Pl-Qn-Ro-bË-cÏ-dÑ+fÁ+gÅ+hÆ)e0456",
    ///     "+2(+Bé+Cí-Eñ-Fu-Gä+Iæ+Kp+Mq-Os+Pk+Qm-So-Uf+bÉ+cÍ-eÑ-gÄ+iÆ)e0457",
    ///     "+2(-Bç+Dí+Eï+Ft-Hä-Iå-Jp+Mr+Ns-Pj+Rm+Sn+Tf-bÇ+dÍ+eÏ-hÄ-iÅ)e0467",
    ///     "+2(-Cç-Dé-Eë+Gt+Hu+Iá-Jq-Kr-Ls-Qj-Rk-Sl+Tg+Uh-cÇ-dÉ-eË+iÁ)e0567",
    ///     "+2(-jo+kn-lm-tæ+uå-áä-çñ+éï-ëí)e4567",
    ///     "+2(+go-hn+im+qæ-rå+sä-çú+éö-ëó)e3576",
    ///     "+2(-fo+hl-ik-pæ+rá-su-çü+íö-ïó)e3467",
    ///     "+2(+fn-gl+ij+på-qá+st-éü+íú-ñó)e3475",
    ///     "+2(-fm+gk-hj-pä+qu-rt-ëü+ïú-ñö)e3456",
    ///     "+2(-co+dn-em+qñ-rï+sí+tú-uö+áó)e2567",
    ///     "+2(+bo-dl+ek-pñ+rë-sé+tü-äö+åó)e2476",
    ///     "+2(-bn+cl-ej+pï-që+sç+uü-äú+æó)e2457",
    ///     "+2(+bm-ck+dj-pí+qé-rç+áü-åú+æö)e2465",
    ///     "+2(-ao+di-eh-pú-qü+uë-áé+äï-åí)e2367",
    ///     "+2(+an-ci+eg+pö-rü-të+áç+äñ-æí)e2375",
    ///     "+2(-am+ch-dg-pó-sü+té-uç+åñ-æï)e2356",
    ///     "+2(-al+bi-ef+qö+rú-tï-uñ+åç+æé)e2347",
    ///     "+2(+ak-bh+df-qó+sú+tí-áñ-äç+æë)e2364",
    ///     "+2(-aj+bg-cf-ró-sö+uí+áï-äé-åë)e2345",
    ///     "+2(-cæ+då-eä-gñ+hï-ií-jú+kö-ló)e1576",
    ///     "+2(+bæ-dá+eu+fñ-hë+ié-jü+mö-nó)e1467",
    ///     "+2(-bå+cá-et-fï+gë-iç-kü+mú-oó)e1475",
    ///     "+2(+bä-cu+dt+fí-gé+hç-lü+nú-oö)e1456",
    ///     "+2(-aæ+ds-er+fú+gü-kë+lé-mï+ní)e1376",
    ///     "+2(+aå-cs+eq-fö+hü+jë-lç-mñ+oí)e1357",
    ///     "+2(-aä+cr-dq+fó+iü-jé+kç-nñ+oï)e1365",
    ///     "+2(-aá+bs-ep-gö-hú+jï+kñ-nç-oé)e1374",
    ///     "+2(+au-br+dp+gó-iú-jí+lñ+mç-oë)e1346",
    ///     "+2(-at+bq-cp+hó+iö-kí-lï+mé+në)e1354",
    ///     "+2(-añ-bú-cü+hs-ir+ká-lu+må-nä)e1267",
    ///     "+2(+aï+bö-dü-gs+iq-já+lt+mæ-oä)e1275",
    ///     "+2(-aí-bó-eü+gr-hq+ju-kt+næ-oå)e1256",
    ///     "+2(-aë+cö+dú+fs-ip-jå-kæ+nt+ou)e1247",
    ///     "+2(+aé-có+eú-fr+hp+jä-læ-mt+oá)e1264",
    ///     "+2(-aç-dó-eö+fq-gp+kä+lå-mu-ná)e1245",
    ///     "+2(-bë-cï-dñ+fá+gå+hæ-lp-nq-or)e1273",
    ///     "+2(+bé+cí-eñ-fu-gä+iæ+kp+mq-os)e1236",
    ///     "+2(-bç+dí+eï+ft-hä-iå-jp+mr+ns)e1253",
    ///     "+2(+Aa+Bb+Cc+Dd+Ee+Ff+Gg+Hh+Ii+Jj+Kk+Ll+Mm+Nn+Oo+Pp+Qq\
    ///         +Rr+Ss+Tt+Uu+Áá+Ää+Åå+Ææ+Çç+Éé+Ëë+Íí+Ïï+Ññ+Óó+Öö+Úú+Üü)I",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn norm() -> Self {
        Self::scalar() + Self::volume() + Self::pseudoscalar()
    }
    /// The multivector of bias $`v^6_\infty \equiv `$.
    #[must_use]
    #[inline]
    pub fn bias() -> Self {
        Self::e0()
    }
    /// The multivector of normal
    /// $`v^6_0 \equiv x\e_1 + y\e_2 + z\e_3 + ð\e_4 + ø\e_5 + þ\e_6 + œ\e_7`$.
    #[must_use]
    #[inline]
    pub fn normal() -> Self {
        Self::e1() + Self::e2() + Self::e3() + Self::e4() + Self::e5() + Self::e6() + Self::e7()
    }
    /// The multivector of $`6`$-volume $`v^6 \equiv v^6_0 + v^6_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume6() -> Self {
        Self::bias() + Self::normal()
    }
    /// The multivector of $`5`$-volume moment $`v^5_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume5_moment() -> Self {
        Self::e01()
            + Self::e02()
            + Self::e03()
            + Self::e04()
            + Self::e05()
            + Self::e06()
            + Self::e07()
    }
    /// The multivector of $`5`$-volume displacement $`v^5_0`$.
    #[must_use]
    #[inline]
    pub fn volume5_displacement() -> Self {
        Self::e23()
            + Self::e13()
            + Self::e12()
            + Self::e14()
            + Self::e24()
            + Self::e34()
            + Self::e15()
            + Self::e25()
            + Self::e35()
            + Self::e45()
            + Self::e16()
            + Self::e26()
            + Self::e36()
            + Self::e46()
            + Self::e56()
            + Self::e17()
            + Self::e27()
            + Self::e37()
            + Self::e47()
            + Self::e57()
            + Self::e67()
    }
    /// The multivector of $`5`$-volume $`v^5 \equiv v^5_0 + v^5_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume5() -> Self {
        Self::volume5_moment() + Self::volume5_displacement()
    }
    /// The multivector of $`4`$-volume moment $`v^4_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume4_moment() -> Self {
        Self::e012()
            + Self::e013()
            + Self::e014()
            + Self::e015()
            + Self::e016()
            + Self::e017()
            + Self::e023()
            + Self::e024()
            + Self::e025()
            + Self::e026()
            + Self::e027()
            + Self::e034()
            + Self::e035()
            + Self::e036()
            + Self::e037()
            + Self::e045()
            + Self::e046()
            + Self::e047()
            + Self::e056()
            + Self::e057()
            + Self::e067()
    }
    /// The multivector of $`4`$-volume displacement $`v^4_0`$.
    #[must_use]
    #[inline]
    pub fn volume4_displacement() -> Self {
        Self::e123()
            + Self::e124()
            + Self::e125()
            + Self::e126()
            + Self::e127()
            + Self::e134()
            + Self::e135()
            + Self::e136()
            + Self::e137()
            + Self::e145()
            + Self::e146()
            + Self::e147()
            + Self::e156()
            + Self::e157()
            + Self::e167()
            + Self::e234()
            + Self::e235()
            + Self::e236()
            + Self::e237()
            + Self::e245()
            + Self::e246()
            + Self::e247()
            + Self::e256()
            + Self::e257()
            + Self::e267()
            + Self::e345()
            + Self::e346()
            + Self::e347()
            + Self::e356()
            + Self::e357()
            + Self::e367()
            + Self::e456()
            + Self::e457()
            + Self::e467()
            + Self::e567()
    }
    /// The multivector of $`4`$-volume $`v^4 \equiv v^4_0 + v^4_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume4() -> Self {
        Self::volume4_moment() + Self::volume4_displacement()
    }
    /// The multivector of volume moment $`v_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume_moment() -> Self {
        Self::e0123()
            + Self::e0124()
            + Self::e0125()
            + Self::e0126()
            + Self::e0127()
            + Self::e0134()
            + Self::e0135()
            + Self::e0136()
            + Self::e0137()
            + Self::e0145()
            + Self::e0146()
            + Self::e0147()
            + Self::e0156()
            + Self::e0157()
            + Self::e0167()
            + Self::e0234()
            + Self::e0235()
            + Self::e0236()
            + Self::e0237()
            + Self::e0245()
            + Self::e0246()
            + Self::e0247()
            + Self::e0256()
            + Self::e0257()
            + Self::e0267()
            + Self::e0345()
            + Self::e0346()
            + Self::e0347()
            + Self::e0356()
            + Self::e0357()
            + Self::e0367()
            + Self::e0456()
            + Self::e0457()
            + Self::e0467()
            + Self::e0567()
    }
    /// The multivector of volume displacement $`v_0`$.
    #[must_use]
    #[inline]
    pub fn volume_displacement() -> Self {
        Self::e1234()
            + Self::e1253()
            + Self::e1236()
            + Self::e1273()
            + Self::e1245()
            + Self::e1264()
            + Self::e1247()
            + Self::e1256()
            + Self::e1275()
            + Self::e1267()
            + Self::e1354()
            + Self::e1346()
            + Self::e1374()
            + Self::e1365()
            + Self::e1357()
            + Self::e1376()
            + Self::e1456()
            + Self::e1475()
            + Self::e1467()
            + Self::e1576()
            + Self::e2345()
            + Self::e2364()
            + Self::e2347()
            + Self::e2356()
            + Self::e2375()
            + Self::e2367()
            + Self::e2465()
            + Self::e2457()
            + Self::e2476()
            + Self::e2567()
            + Self::e3456()
            + Self::e3475()
            + Self::e3467()
            + Self::e3576()
            + Self::e4567()
    }
    /// The multivector of volume $`v \equiv v_0 + v_\infty`$.
    #[must_use]
    #[inline]
    pub fn volume() -> Self {
        Self::volume_moment() + Self::volume_displacement()
    }
    /// The multivector of plane moment $`p_\infty`$.
    #[must_use]
    #[inline]
    pub fn plane_moment() -> Self {
        Self::e01243()
            + Self::e01235()
            + Self::e01263()
            + Self::e01237()
            + Self::e01254()
            + Self::e01246()
            + Self::e01274()
            + Self::e01265()
            + Self::e01257()
            + Self::e01276()
            + Self::e01345()
            + Self::e01364()
            + Self::e01347()
            + Self::e01356()
            + Self::e01375()
            + Self::e01367()
            + Self::e01465()
            + Self::e01457()
            + Self::e01476()
            + Self::e01567()
            + Self::e02354()
            + Self::e02346()
            + Self::e02374()
            + Self::e02365()
            + Self::e02357()
            + Self::e02376()
            + Self::e02456()
            + Self::e02475()
            + Self::e02467()
            + Self::e02576()
            + Self::e03465()
            + Self::e03457()
            + Self::e03476()
            + Self::e03567()
            + Self::e04576()
    }
    /// The multivector of plane displacement $`p_0`$.
    #[must_use]
    #[inline]
    pub fn plane_displacement() -> Self {
        Self::e12345()
            + Self::e12364()
            + Self::e12347()
            + Self::e12356()
            + Self::e12375()
            + Self::e12367()
            + Self::e12465()
            + Self::e12457()
            + Self::e12476()
            + Self::e12567()
            + Self::e13456()
            + Self::e13475()
            + Self::e13467()
            + Self::e13576()
            + Self::e14567()
            + Self::e23465()
            + Self::e23457()
            + Self::e23476()
            + Self::e23567()
            + Self::e24576()
            + Self::e34567()
    }
    /// The multivector of plane $`p \equiv p_0 + p_\infty`$.
    #[must_use]
    #[inline]
    pub fn plane() -> Self {
        Self::plane_moment() + Self::plane_displacement()
    }
    /// The multivector of line moment $`\ell_\infty`$.
    #[must_use]
    #[inline]
    pub fn line_moment() -> Self {
        Self::e012345()
            + Self::e012364()
            + Self::e012347()
            + Self::e012356()
            + Self::e012375()
            + Self::e012367()
            + Self::e012465()
            + Self::e012457()
            + Self::e012476()
            + Self::e012567()
            + Self::e013456()
            + Self::e013475()
            + Self::e013467()
            + Self::e013576()
            + Self::e014567()
            + Self::e023465()
            + Self::e023457()
            + Self::e023476()
            + Self::e023567()
            + Self::e024576()
            + Self::e034567()
    }
    /// The multivector of line displacement $`\ell_0`$.
    #[must_use]
    #[inline]
    pub fn line_displacement() -> Self {
        Self::e123456()
            + Self::e123475()
            + Self::e123467()
            + Self::e123576()
            + Self::e124567()
            + Self::e134576()
            + Self::e234567()
    }
    /// The multivector of line $`\ell \equiv \ell_0 + \ell_\infty`$.
    #[must_use]
    #[inline]
    pub fn line() -> Self {
        Self::line_moment() + Self::line_displacement()
    }
    // 7
    /// The multivector of direction $`P_\infty`$.
    #[must_use]
    #[inline]
    pub fn direction() -> Self {
        Self::e0123465()
            + Self::e0123457()
            + Self::e0123476()
            + Self::e0123567()
            + Self::e0124576()
            + Self::e0134567()
            + Self::e0234576()
    }
    /// The multivector of weight $`P_0`$.
    #[must_use]
    #[inline]
    pub fn weight() -> Self {
        Self::e1234567()
    }
    /// The multivector of point $`P \equiv P_0 + P_\infty`$.
    #[must_use]
    #[inline]
    pub fn point() -> Self {
        Self::direction() + Self::weight()
    }
    /// The multivector of single rotator $`r_1 \equiv s + v^5_0`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let single_rotator = Vee::normal().lhs() * Vee::normal().rhs();
    ///
    /// assert_eq!(
    ///     single_rotator.basis_blades(),
    ///     Vee::single_rotator().basis_blades()
    /// );
    /// format_eq!(single_rotator, [
    ///     "+x͔x͕+y͔y͕+z͔z͕+ð͔ð͕+ø͔ø͕+þ͔þ͕+œ͔œ͕",
    ///     "+(+x͔y͕-x͕y͔)e12",
    ///     "+(+x͔z͕-x͕z͔)e13",
    ///     "+(+x͔ð͕-x͕ð͔)e14",
    ///     "+(+x͔ø͕-x͕ø͔)e15",
    ///     "+(+x͔þ͕-x͕þ͔)e16",
    ///     "+(+x͔œ͕-x͕œ͔)e17",
    ///     "+(+y͔z͕-y͕z͔)e23",
    ///     "+(+y͔ð͕-y͕ð͔)e24",
    ///     "+(+y͔ø͕-y͕ø͔)e25",
    ///     "+(+y͔þ͕-y͕þ͔)e26",
    ///     "+(+y͔œ͕-y͕œ͔)e27",
    ///     "+(+z͔ð͕-z͕ð͔)e34",
    ///     "+(+z͔ø͕-z͕ø͔)e35",
    ///     "+(+z͔þ͕-z͕þ͔)e36",
    ///     "+(+z͔œ͕-z͕œ͔)e37",
    ///     "+(+ð͔ø͕-ð͕ø͔)e45",
    ///     "+(+ð͔þ͕-ð͕þ͔)e46",
    ///     "+(+ð͔œ͕-ð͕œ͔)e47",
    ///     "+(+ø͔þ͕-ø͕þ͔)e56",
    ///     "+(+ø͔œ͕-ø͕œ͔)e57",
    ///     "+(+þ͔œ͕-þ͕œ͔)e67",
    /// ]);
    ///
    /// let single_rotator = Vee::line_displacement().lhs() * Vee::line_displacement().rhs();
    ///
    /// assert_eq!(
    ///     single_rotator.basis_blades(),
    ///     Vee::single_rotator().basis_blades()
    /// );
    /// format_eq!(single_rotator, [
    ///     "-x͔x͕-y͔y͕-z͔z͕-ð͔ð͕-ø͔ø͕-þ͔þ͕-œ͔œ͕",
    ///     "+(-x͔y͕+x͕y͔)e12",
    ///     "+(-x͔z͕+x͕z͔)e13",
    ///     "+(-x͔ð͕+x͕ð͔)e14",
    ///     "+(-x͔ø͕+x͕ø͔)e15",
    ///     "+(-x͔þ͕+x͕þ͔)e16",
    ///     "+(-x͔œ͕+x͕œ͔)e17",
    ///     "+(-y͔z͕+y͕z͔)e23",
    ///     "+(-y͔ð͕+y͕ð͔)e24",
    ///     "+(-y͔ø͕+y͕ø͔)e25",
    ///     "+(-y͔þ͕+y͕þ͔)e26",
    ///     "+(-y͔œ͕+y͕œ͔)e27",
    ///     "+(-z͔ð͕+z͕ð͔)e34",
    ///     "+(-z͔ø͕+z͕ø͔)e35",
    ///     "+(-z͔þ͕+z͕þ͔)e36",
    ///     "+(-z͔œ͕+z͕œ͔)e37",
    ///     "+(-ð͔ø͕+ð͕ø͔)e45",
    ///     "+(-ð͔þ͕+ð͕þ͔)e46",
    ///     "+(-ð͔œ͕+ð͕œ͔)e47",
    ///     "+(-ø͔þ͕+ø͕þ͔)e56",
    ///     "+(-ø͔œ͕+ø͕œ͔)e57",
    ///     "+(-þ͔œ͕+þ͕œ͔)e67",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_rotator() -> Self {
        Self::scalar() + Self::volume5_displacement()
    }
    /// The multivector of double rotator $`r_2 \equiv s + v^5_0 + v_0`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP7 as Vee};
    ///
    /// let double_rotator = Vee::single_rotator().lhs() * Vee::single_rotator().rhs();
    ///
    /// assert_eq!(double_rotator.basis_blades(), Vee::double_rotator().basis_blades());
    /// format_eq!(double_rotator, [
    ///     "+v͔v͕-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕-π͔π͕-ρ͔ρ͕-σ͔σ͕-τ͔τ͕-υ͔υ͕-φ͔φ͕",
    ///     "+(+v͔α͕+v͕α͔-β͔η͕+β͕η͔-γ͔θ͕+γ͕θ͔-δ͔ι͕+δ͕ι͔-ε͔κ͕+ε͕κ͔-ζ͔λ͕+ζ͕λ͔)e12",
    ///     "+(+v͔β͕+v͕β͔+α͔η͕-α͕η͔-γ͔μ͕+γ͕μ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔-ζ͔ο͕+ζ͕ο͔)e13",
    ///     "+(+v͔γ͕+v͕γ͔+α͔θ͕-α͕θ͔+β͔μ͕-β͕μ͔-δ͔π͕+δ͕π͔-ε͔ρ͕+ε͕ρ͔-ζ͔σ͕+ζ͕σ͔)e14",
    ///     "+(+v͔δ͕+v͕δ͔+α͔ι͕-α͕ι͔+β͔ν͕-β͕ν͔+γ͔π͕-γ͕π͔-ε͔τ͕+ε͕τ͔-ζ͔υ͕+ζ͕υ͔)e15",
    ///     "+(+v͔ε͕+v͕ε͔+α͔κ͕-α͕κ͔+β͔ξ͕-β͕ξ͔+γ͔ρ͕-γ͕ρ͔+δ͔τ͕-δ͕τ͔-ζ͔φ͕+ζ͕φ͔)e16",
    ///     "+(+v͔ζ͕+v͕ζ͔+α͔λ͕-α͕λ͔+β͔ο͕-β͕ο͔+γ͔σ͕-γ͕σ͔+δ͔υ͕-δ͕υ͔+ε͔φ͕-ε͕φ͔)e17",
    ///     "+(+v͔η͕+v͕η͔-α͔β͕+α͕β͔-θ͔μ͕+θ͕μ͔-ι͔ν͕+ι͕ν͔-κ͔ξ͕+κ͕ξ͔-λ͔ο͕+λ͕ο͔)e23",
    ///     "+(+v͔θ͕+v͕θ͔-α͔γ͕+α͕γ͔+η͔μ͕-η͕μ͔-ι͔π͕+ι͕π͔-κ͔ρ͕+κ͕ρ͔-λ͔σ͕+λ͕σ͔)e24",
    ///     "+(+v͔ι͕+v͕ι͔-α͔δ͕+α͕δ͔+η͔ν͕-η͕ν͔+θ͔π͕-θ͕π͔-κ͔τ͕+κ͕τ͔-λ͔υ͕+λ͕υ͔)e25",
    ///     "+(+v͔κ͕+v͕κ͔-α͔ε͕+α͕ε͔+η͔ξ͕-η͕ξ͔+θ͔ρ͕-θ͕ρ͔+ι͔τ͕-ι͕τ͔-λ͔φ͕+λ͕φ͔)e26",
    ///     "+(+v͔λ͕+v͕λ͔-α͔ζ͕+α͕ζ͔+η͔ο͕-η͕ο͔+θ͔σ͕-θ͕σ͔+ι͔υ͕-ι͕υ͔+κ͔φ͕-κ͕φ͔)e27",
    ///     "+(+v͔μ͕+v͕μ͔-β͔γ͕+β͕γ͔-η͔θ͕+η͕θ͔-ν͔π͕+ν͕π͔-ξ͔ρ͕+ξ͕ρ͔-ο͔σ͕+ο͕σ͔)e34",
    ///     "+(+v͔ν͕+v͕ν͔-β͔δ͕+β͕δ͔-η͔ι͕+η͕ι͔+μ͔π͕-μ͕π͔-ξ͔τ͕+ξ͕τ͔-ο͔υ͕+ο͕υ͔)e35",
    ///     "+(+v͔ξ͕+v͕ξ͔-β͔ε͕+β͕ε͔-η͔κ͕+η͕κ͔+μ͔ρ͕-μ͕ρ͔+ν͔τ͕-ν͕τ͔-ο͔φ͕+ο͕φ͔)e36",
    ///     "+(+v͔ο͕+v͕ο͔-β͔ζ͕+β͕ζ͔-η͔λ͕+η͕λ͔+μ͔σ͕-μ͕σ͔+ν͔υ͕-ν͕υ͔+ξ͔φ͕-ξ͕φ͔)e37",
    ///     "+(+v͔π͕+v͕π͔-γ͔δ͕+γ͕δ͔-θ͔ι͕+θ͕ι͔-μ͔ν͕+μ͕ν͔-ρ͔τ͕+ρ͕τ͔-σ͔υ͕+σ͕υ͔)e45",
    ///     "+(+v͔ρ͕+v͕ρ͔-γ͔ε͕+γ͕ε͔-θ͔κ͕+θ͕κ͔-μ͔ξ͕+μ͕ξ͔+π͔τ͕-π͕τ͔-σ͔φ͕+σ͕φ͔)e46",
    ///     "+(+v͔σ͕+v͕σ͔-γ͔ζ͕+γ͕ζ͔-θ͔λ͕+θ͕λ͔-μ͔ο͕+μ͕ο͔+π͔υ͕-π͕υ͔+ρ͔φ͕-ρ͕φ͔)e47",
    ///     "+(+v͔τ͕+v͕τ͔-δ͔ε͕+δ͕ε͔-ι͔κ͕+ι͕κ͔-ν͔ξ͕+ν͕ξ͔-π͔ρ͕+π͕ρ͔-υ͔φ͕+υ͕φ͔)e56",
    ///     "+(+v͔υ͕+v͕υ͔-δ͔ζ͕+δ͕ζ͔-ι͔λ͕+ι͕λ͔-ν͔ο͕+ν͕ο͔-π͔σ͕+π͕σ͔+τ͔φ͕-τ͕φ͔)e57",
    ///     "+(+v͔φ͕+v͕φ͔-ε͔ζ͕+ε͕ζ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔-ρ͔σ͕+ρ͕σ͔-τ͔υ͕+τ͕υ͔)e67",
    ///     "+(+α͔μ͕+α͕μ͔-β͔θ͕-β͕θ͔+γ͔η͕+γ͕η͔)e1234",
    ///     "+(+π͔φ͕+π͕φ͔-ρ͔υ͕-ρ͕υ͔+σ͔τ͕+σ͕τ͔)e4567",
    ///     "+(-ν͔φ͕-ν͕φ͔+ξ͔υ͕+ξ͕υ͔-ο͔τ͕-ο͕τ͔)e3576",
    ///     "+(+μ͔φ͕+μ͕φ͔-ξ͔σ͕-ξ͕σ͔+ο͔ρ͕+ο͕ρ͔)e3467",
    ///     "+(-μ͔υ͕-μ͕υ͔+ν͔σ͕+ν͕σ͔-ο͔π͕-ο͕π͔)e3475",
    ///     "+(+μ͔τ͕+μ͕τ͔-ν͔ρ͕-ν͕ρ͔+ξ͔π͕+ξ͕π͔)e3456",
    ///     "+(+ι͔φ͕+ι͕φ͔-κ͔υ͕-κ͕υ͔+λ͔τ͕+λ͕τ͔)e2567",
    ///     "+(-θ͔φ͕-θ͕φ͔+κ͔σ͕+κ͕σ͔-λ͔ρ͕-λ͕ρ͔)e2476",
    ///     "+(+θ͔υ͕+θ͕υ͔-ι͔σ͕-ι͕σ͔+λ͔π͕+λ͕π͔)e2457",
    ///     "+(-θ͔τ͕-θ͕τ͔+ι͔ρ͕+ι͕ρ͔-κ͔π͕-κ͕π͔)e2465",
    ///     "+(+η͔φ͕+η͕φ͔-κ͔ο͕-κ͕ο͔+λ͔ξ͕+λ͕ξ͔)e2367",
    ///     "+(-η͔υ͕-η͕υ͔+ι͔ο͕+ι͕ο͔-λ͔ν͕-λ͕ν͔)e2375",
    ///     "+(+η͔τ͕+η͕τ͔-ι͔ξ͕-ι͕ξ͔+κ͔ν͕+κ͕ν͔)e2356",
    ///     "+(+η͔σ͕+η͕σ͔-θ͔ο͕-θ͕ο͔+λ͔μ͕+λ͕μ͔)e2347",
    ///     "+(-η͔ρ͕-η͕ρ͔+θ͔ξ͕+θ͕ξ͔-κ͔μ͕-κ͕μ͔)e2364",
    ///     "+(+η͔π͕+η͕π͔-θ͔ν͕-θ͕ν͔+ι͔μ͕+ι͕μ͔)e2345",
    ///     "+(-δ͔φ͕-δ͕φ͔+ε͔υ͕+ε͕υ͔-ζ͔τ͕-ζ͕τ͔)e1576",
    ///     "+(+γ͔φ͕+γ͕φ͔-ε͔σ͕-ε͕σ͔+ζ͔ρ͕+ζ͕ρ͔)e1467",
    ///     "+(-γ͔υ͕-γ͕υ͔+δ͔σ͕+δ͕σ͔-ζ͔π͕-ζ͕π͔)e1475",
    ///     "+(+γ͔τ͕+γ͕τ͔-δ͔ρ͕-δ͕ρ͔+ε͔π͕+ε͕π͔)e1456",
    ///     "+(-β͔φ͕-β͕φ͔+ε͔ο͕+ε͕ο͔-ζ͔ξ͕-ζ͕ξ͔)e1376",
    ///     "+(+β͔υ͕+β͕υ͔-δ͔ο͕-δ͕ο͔+ζ͔ν͕+ζ͕ν͔)e1357",
    ///     "+(-β͔τ͕-β͕τ͔+δ͔ξ͕+δ͕ξ͔-ε͔ν͕-ε͕ν͔)e1365",
    ///     "+(-β͔σ͕-β͕σ͔+γ͔ο͕+γ͕ο͔-ζ͔μ͕-ζ͕μ͔)e1374",
    ///     "+(+β͔ρ͕+β͕ρ͔-γ͔ξ͕-γ͕ξ͔+ε͔μ͕+ε͕μ͔)e1346",
    ///     "+(-β͔π͕-β͕π͔+γ͔ν͕+γ͕ν͔-δ͔μ͕-δ͕μ͔)e1354",
    ///     "+(+α͔φ͕+α͕φ͔-ε͔λ͕-ε͕λ͔+ζ͔κ͕+ζ͕κ͔)e1267",
    ///     "+(-α͔υ͕-α͕υ͔+δ͔λ͕+δ͕λ͔-ζ͔ι͕-ζ͕ι͔)e1275",
    ///     "+(+α͔τ͕+α͕τ͔-δ͔κ͕-δ͕κ͔+ε͔ι͕+ε͕ι͔)e1256",
    ///     "+(+α͔σ͕+α͕σ͔-γ͔λ͕-γ͕λ͔+ζ͔θ͕+ζ͕θ͔)e1247",
    ///     "+(-α͔ρ͕-α͕ρ͔+γ͔κ͕+γ͕κ͔-ε͔θ͕-ε͕θ͔)e1264",
    ///     "+(+α͔π͕+α͕π͔-γ͔ι͕-γ͕ι͔+δ͔θ͕+δ͕θ͔)e1245",
    ///     "+(-α͔ο͕-α͕ο͔+β͔λ͕+β͕λ͔-ζ͔η͕-ζ͕η͔)e1273",
    ///     "+(+α͔ξ͕+α͕ξ͔-β͔κ͕-β͕κ͔+ε͔η͕+ε͕η͔)e1236",
    ///     "+(-α͔ν͕-α͕ν͔+β͔ι͕+β͕ι͔-δ͔η͕-δ͕η͔)e1253",
    /// ]);
    ///
    /// let double_rotator = Vee::volume5_displacement().lhs() * Vee::volume5_displacement().rhs();
    ///
    /// assert_eq!(double_rotator.basis_blades(), Vee::double_rotator().basis_blades());
    /// format_eq!(double_rotator, [
    ///     "-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕-π͔π͕-ρ͔ρ͕-σ͔σ͕-τ͔τ͕-υ͔υ͕-φ͔φ͕",
    ///     "+(-β͔η͕+β͕η͔-γ͔θ͕+γ͕θ͔-δ͔ι͕+δ͕ι͔-ε͔κ͕+ε͕κ͔-ζ͔λ͕+ζ͕λ͔)e12",
    ///     "+(+α͔η͕-α͕η͔-γ͔μ͕+γ͕μ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔-ζ͔ο͕+ζ͕ο͔)e13",
    ///     "+(+α͔θ͕-α͕θ͔+β͔μ͕-β͕μ͔-δ͔π͕+δ͕π͔-ε͔ρ͕+ε͕ρ͔-ζ͔σ͕+ζ͕σ͔)e14",
    ///     "+(+α͔ι͕-α͕ι͔+β͔ν͕-β͕ν͔+γ͔π͕-γ͕π͔-ε͔τ͕+ε͕τ͔-ζ͔υ͕+ζ͕υ͔)e15",
    ///     "+(+α͔κ͕-α͕κ͔+β͔ξ͕-β͕ξ͔+γ͔ρ͕-γ͕ρ͔+δ͔τ͕-δ͕τ͔-ζ͔φ͕+ζ͕φ͔)e16",
    ///     "+(+α͔λ͕-α͕λ͔+β͔ο͕-β͕ο͔+γ͔σ͕-γ͕σ͔+δ͔υ͕-δ͕υ͔+ε͔φ͕-ε͕φ͔)e17",
    ///     "+(-α͔β͕+α͕β͔-θ͔μ͕+θ͕μ͔-ι͔ν͕+ι͕ν͔-κ͔ξ͕+κ͕ξ͔-λ͔ο͕+λ͕ο͔)e23",
    ///     "+(-α͔γ͕+α͕γ͔+η͔μ͕-η͕μ͔-ι͔π͕+ι͕π͔-κ͔ρ͕+κ͕ρ͔-λ͔σ͕+λ͕σ͔)e24",
    ///     "+(-α͔δ͕+α͕δ͔+η͔ν͕-η͕ν͔+θ͔π͕-θ͕π͔-κ͔τ͕+κ͕τ͔-λ͔υ͕+λ͕υ͔)e25",
    ///     "+(-α͔ε͕+α͕ε͔+η͔ξ͕-η͕ξ͔+θ͔ρ͕-θ͕ρ͔+ι͔τ͕-ι͕τ͔-λ͔φ͕+λ͕φ͔)e26",
    ///     "+(-α͔ζ͕+α͕ζ͔+η͔ο͕-η͕ο͔+θ͔σ͕-θ͕σ͔+ι͔υ͕-ι͕υ͔+κ͔φ͕-κ͕φ͔)e27",
    ///     "+(-β͔γ͕+β͕γ͔-η͔θ͕+η͕θ͔-ν͔π͕+ν͕π͔-ξ͔ρ͕+ξ͕ρ͔-ο͔σ͕+ο͕σ͔)e34",
    ///     "+(-β͔δ͕+β͕δ͔-η͔ι͕+η͕ι͔+μ͔π͕-μ͕π͔-ξ͔τ͕+ξ͕τ͔-ο͔υ͕+ο͕υ͔)e35",
    ///     "+(-β͔ε͕+β͕ε͔-η͔κ͕+η͕κ͔+μ͔ρ͕-μ͕ρ͔+ν͔τ͕-ν͕τ͔-ο͔φ͕+ο͕φ͔)e36",
    ///     "+(-β͔ζ͕+β͕ζ͔-η͔λ͕+η͕λ͔+μ͔σ͕-μ͕σ͔+ν͔υ͕-ν͕υ͔+ξ͔φ͕-ξ͕φ͔)e37",
    ///     "+(-γ͔δ͕+γ͕δ͔-θ͔ι͕+θ͕ι͔-μ͔ν͕+μ͕ν͔-ρ͔τ͕+ρ͕τ͔-σ͔υ͕+σ͕υ͔)e45",
    ///     "+(-γ͔ε͕+γ͕ε͔-θ͔κ͕+θ͕κ͔-μ͔ξ͕+μ͕ξ͔+π͔τ͕-π͕τ͔-σ͔φ͕+σ͕φ͔)e46",
    ///     "+(-γ͔ζ͕+γ͕ζ͔-θ͔λ͕+θ͕λ͔-μ͔ο͕+μ͕ο͔+π͔υ͕-π͕υ͔+ρ͔φ͕-ρ͕φ͔)e47",
    ///     "+(-δ͔ε͕+δ͕ε͔-ι͔κ͕+ι͕κ͔-ν͔ξ͕+ν͕ξ͔-π͔ρ͕+π͕ρ͔-υ͔φ͕+υ͕φ͔)e56",
    ///     "+(-δ͔ζ͕+δ͕ζ͔-ι͔λ͕+ι͕λ͔-ν͔ο͕+ν͕ο͔-π͔σ͕+π͕σ͔+τ͔φ͕-τ͕φ͔)e57",
    ///     "+(-ε͔ζ͕+ε͕ζ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔-ρ͔σ͕+ρ͕σ͔-τ͔υ͕+τ͕υ͔)e67",
    ///     "+(+α͔μ͕+α͕μ͔-β͔θ͕-β͕θ͔+γ͔η͕+γ͕η͔)e1234",
    ///     "+(+π͔φ͕+π͕φ͔-ρ͔υ͕-ρ͕υ͔+σ͔τ͕+σ͕τ͔)e4567",
    ///     "+(-ν͔φ͕-ν͕φ͔+ξ͔υ͕+ξ͕υ͔-ο͔τ͕-ο͕τ͔)e3576",
    ///     "+(+μ͔φ͕+μ͕φ͔-ξ͔σ͕-ξ͕σ͔+ο͔ρ͕+ο͕ρ͔)e3467",
    ///     "+(-μ͔υ͕-μ͕υ͔+ν͔σ͕+ν͕σ͔-ο͔π͕-ο͕π͔)e3475",
    ///     "+(+μ͔τ͕+μ͕τ͔-ν͔ρ͕-ν͕ρ͔+ξ͔π͕+ξ͕π͔)e3456",
    ///     "+(+ι͔φ͕+ι͕φ͔-κ͔υ͕-κ͕υ͔+λ͔τ͕+λ͕τ͔)e2567",
    ///     "+(-θ͔φ͕-θ͕φ͔+κ͔σ͕+κ͕σ͔-λ͔ρ͕-λ͕ρ͔)e2476",
    ///     "+(+θ͔υ͕+θ͕υ͔-ι͔σ͕-ι͕σ͔+λ͔π͕+λ͕π͔)e2457",
    ///     "+(-θ͔τ͕-θ͕τ͔+ι͔ρ͕+ι͕ρ͔-κ͔π͕-κ͕π͔)e2465",
    ///     "+(+η͔φ͕+η͕φ͔-κ͔ο͕-κ͕ο͔+λ͔ξ͕+λ͕ξ͔)e2367",
    ///     "+(-η͔υ͕-η͕υ͔+ι͔ο͕+ι͕ο͔-λ͔ν͕-λ͕ν͔)e2375",
    ///     "+(+η͔τ͕+η͕τ͔-ι͔ξ͕-ι͕ξ͔+κ͔ν͕+κ͕ν͔)e2356",
    ///     "+(+η͔σ͕+η͕σ͔-θ͔ο͕-θ͕ο͔+λ͔μ͕+λ͕μ͔)e2347",
    ///     "+(-η͔ρ͕-η͕ρ͔+θ͔ξ͕+θ͕ξ͔-κ͔μ͕-κ͕μ͔)e2364",
    ///     "+(+η͔π͕+η͕π͔-θ͔ν͕-θ͕ν͔+ι͔μ͕+ι͕μ͔)e2345",
    ///     "+(-δ͔φ͕-δ͕φ͔+ε͔υ͕+ε͕υ͔-ζ͔τ͕-ζ͕τ͔)e1576",
    ///     "+(+γ͔φ͕+γ͕φ͔-ε͔σ͕-ε͕σ͔+ζ͔ρ͕+ζ͕ρ͔)e1467",
    ///     "+(-γ͔υ͕-γ͕υ͔+δ͔σ͕+δ͕σ͔-ζ͔π͕-ζ͕π͔)e1475",
    ///     "+(+γ͔τ͕+γ͕τ͔-δ͔ρ͕-δ͕ρ͔+ε͔π͕+ε͕π͔)e1456",
    ///     "+(-β͔φ͕-β͕φ͔+ε͔ο͕+ε͕ο͔-ζ͔ξ͕-ζ͕ξ͔)e1376",
    ///     "+(+β͔υ͕+β͕υ͔-δ͔ο͕-δ͕ο͔+ζ͔ν͕+ζ͕ν͔)e1357",
    ///     "+(-β͔τ͕-β͕τ͔+δ͔ξ͕+δ͕ξ͔-ε͔ν͕-ε͕ν͔)e1365",
    ///     "+(-β͔σ͕-β͕σ͔+γ͔ο͕+γ͕ο͔-ζ͔μ͕-ζ͕μ͔)e1374",
    ///     "+(+β͔ρ͕+β͕ρ͔-γ͔ξ͕-γ͕ξ͔+ε͔μ͕+ε͕μ͔)e1346",
    ///     "+(-β͔π͕-β͕π͔+γ͔ν͕+γ͕ν͔-δ͔μ͕-δ͕μ͔)e1354",
    ///     "+(+α͔φ͕+α͕φ͔-ε͔λ͕-ε͕λ͔+ζ͔κ͕+ζ͕κ͔)e1267",
    ///     "+(-α͔υ͕-α͕υ͔+δ͔λ͕+δ͕λ͔-ζ͔ι͕-ζ͕ι͔)e1275",
    ///     "+(+α͔τ͕+α͕τ͔-δ͔κ͕-δ͕κ͔+ε͔ι͕+ε͕ι͔)e1256",
    ///     "+(+α͔σ͕+α͕σ͔-γ͔λ͕-γ͕λ͔+ζ͔θ͕+ζ͕θ͔)e1247",
    ///     "+(-α͔ρ͕-α͕ρ͔+γ͔κ͕+γ͕κ͔-ε͔θ͕-ε͕θ͔)e1264",
    ///     "+(+α͔π͕+α͕π͔-γ͔ι͕-γ͕ι͔+δ͔θ͕+δ͕θ͔)e1245",
    ///     "+(-α͔ο͕-α͕ο͔+β͔λ͕+β͕λ͔-ζ͔η͕-ζ͕η͔)e1273",
    ///     "+(+α͔ξ͕+α͕ξ͔-β͔κ͕-β͕κ͔+ε͔η͕+ε͕η͔)e1236",
    ///     "+(-α͔ν͕-α͕ν͔+β͔ι͕+β͕ι͔-δ͔η͕-δ͕η͔)e1253",
    /// ]);
    ///
    /// let double_rotator = Vee::plane_displacement().lhs() * Vee::plane_displacement().rhs();
    ///
    /// assert_eq!(double_rotator.basis_blades(), Vee::double_rotator().basis_blades());
    /// format_eq!(double_rotator, [
    ///     "+α͔α͕+β͔β͕+γ͔γ͕+δ͔δ͕+ε͔ε͕+ζ͔ζ͕+η͔η͕+θ͔θ͕+ι͔ι͕+κ͔κ͕+λ͔λ͕+μ͔μ͕+ν͔ν͕+ξ͔ξ͕+ο͔ο͕+π͔π͕+ρ͔ρ͕+σ͔σ͕+τ͔τ͕+υ͔υ͕+φ͔φ͕",
    ///     "+(+β͔η͕-β͕η͔+γ͔θ͕-γ͕θ͔+δ͔ι͕-δ͕ι͔+ε͔κ͕-ε͕κ͔+ζ͔λ͕-ζ͕λ͔)e12",
    ///     "+(-α͔η͕+α͕η͔+γ͔μ͕-γ͕μ͔+δ͔ν͕-δ͕ν͔+ε͔ξ͕-ε͕ξ͔+ζ͔ο͕-ζ͕ο͔)e13",
    ///     "+(-α͔θ͕+α͕θ͔-β͔μ͕+β͕μ͔+δ͔π͕-δ͕π͔+ε͔ρ͕-ε͕ρ͔+ζ͔σ͕-ζ͕σ͔)e14",
    ///     "+(-α͔ι͕+α͕ι͔-β͔ν͕+β͕ν͔-γ͔π͕+γ͕π͔+ε͔τ͕-ε͕τ͔+ζ͔υ͕-ζ͕υ͔)e15",
    ///     "+(-α͔κ͕+α͕κ͔-β͔ξ͕+β͕ξ͔-γ͔ρ͕+γ͕ρ͔-δ͔τ͕+δ͕τ͔+ζ͔φ͕-ζ͕φ͔)e16",
    ///     "+(-α͔λ͕+α͕λ͔-β͔ο͕+β͕ο͔-γ͔σ͕+γ͕σ͔-δ͔υ͕+δ͕υ͔-ε͔φ͕+ε͕φ͔)e17",
    ///     "+(+α͔β͕-α͕β͔+θ͔μ͕-θ͕μ͔+ι͔ν͕-ι͕ν͔+κ͔ξ͕-κ͕ξ͔+λ͔ο͕-λ͕ο͔)e23",
    ///     "+(+α͔γ͕-α͕γ͔-η͔μ͕+η͕μ͔+ι͔π͕-ι͕π͔+κ͔ρ͕-κ͕ρ͔+λ͔σ͕-λ͕σ͔)e24",
    ///     "+(+α͔δ͕-α͕δ͔-η͔ν͕+η͕ν͔-θ͔π͕+θ͕π͔+κ͔τ͕-κ͕τ͔+λ͔υ͕-λ͕υ͔)e25",
    ///     "+(+α͔ε͕-α͕ε͔-η͔ξ͕+η͕ξ͔-θ͔ρ͕+θ͕ρ͔-ι͔τ͕+ι͕τ͔+λ͔φ͕-λ͕φ͔)e26",
    ///     "+(+α͔ζ͕-α͕ζ͔-η͔ο͕+η͕ο͔-θ͔σ͕+θ͕σ͔-ι͔υ͕+ι͕υ͔-κ͔φ͕+κ͕φ͔)e27",
    ///     "+(+β͔γ͕-β͕γ͔+η͔θ͕-η͕θ͔+ν͔π͕-ν͕π͔+ξ͔ρ͕-ξ͕ρ͔+ο͔σ͕-ο͕σ͔)e34",
    ///     "+(+β͔δ͕-β͕δ͔+η͔ι͕-η͕ι͔-μ͔π͕+μ͕π͔+ξ͔τ͕-ξ͕τ͔+ο͔υ͕-ο͕υ͔)e35",
    ///     "+(+β͔ε͕-β͕ε͔+η͔κ͕-η͕κ͔-μ͔ρ͕+μ͕ρ͔-ν͔τ͕+ν͕τ͔+ο͔φ͕-ο͕φ͔)e36",
    ///     "+(+β͔ζ͕-β͕ζ͔+η͔λ͕-η͕λ͔-μ͔σ͕+μ͕σ͔-ν͔υ͕+ν͕υ͔-ξ͔φ͕+ξ͕φ͔)e37",
    ///     "+(+γ͔δ͕-γ͕δ͔+θ͔ι͕-θ͕ι͔+μ͔ν͕-μ͕ν͔+ρ͔τ͕-ρ͕τ͔+σ͔υ͕-σ͕υ͔)e45",
    ///     "+(+γ͔ε͕-γ͕ε͔+θ͔κ͕-θ͕κ͔+μ͔ξ͕-μ͕ξ͔-π͔τ͕+π͕τ͔+σ͔φ͕-σ͕φ͔)e46",
    ///     "+(+γ͔ζ͕-γ͕ζ͔+θ͔λ͕-θ͕λ͔+μ͔ο͕-μ͕ο͔-π͔υ͕+π͕υ͔-ρ͔φ͕+ρ͕φ͔)e47",
    ///     "+(+δ͔ε͕-δ͕ε͔+ι͔κ͕-ι͕κ͔+ν͔ξ͕-ν͕ξ͔+π͔ρ͕-π͕ρ͔+υ͔φ͕-υ͕φ͔)e56",
    ///     "+(+δ͔ζ͕-δ͕ζ͔+ι͔λ͕-ι͕λ͔+ν͔ο͕-ν͕ο͔+π͔σ͕-π͕σ͔-τ͔φ͕+τ͕φ͔)e57",
    ///     "+(+ε͔ζ͕-ε͕ζ͔+κ͔λ͕-κ͕λ͔+ξ͔ο͕-ξ͕ο͔+ρ͔σ͕-ρ͕σ͔+τ͔υ͕-τ͕υ͔)e67",
    ///     "+(-α͔μ͕-α͕μ͔+β͔θ͕+β͕θ͔-γ͔η͕-γ͕η͔)e1234",
    ///     "+(-π͔φ͕-π͕φ͔+ρ͔υ͕+ρ͕υ͔-σ͔τ͕-σ͕τ͔)e4567",
    ///     "+(+ν͔φ͕+ν͕φ͔-ξ͔υ͕-ξ͕υ͔+ο͔τ͕+ο͕τ͔)e3576",
    ///     "+(-μ͔φ͕-μ͕φ͔+ξ͔σ͕+ξ͕σ͔-ο͔ρ͕-ο͕ρ͔)e3467",
    ///     "+(+μ͔υ͕+μ͕υ͔-ν͔σ͕-ν͕σ͔+ο͔π͕+ο͕π͔)e3475",
    ///     "+(-μ͔τ͕-μ͕τ͔+ν͔ρ͕+ν͕ρ͔-ξ͔π͕-ξ͕π͔)e3456",
    ///     "+(-ι͔φ͕-ι͕φ͔+κ͔υ͕+κ͕υ͔-λ͔τ͕-λ͕τ͔)e2567",
    ///     "+(+θ͔φ͕+θ͕φ͔-κ͔σ͕-κ͕σ͔+λ͔ρ͕+λ͕ρ͔)e2476",
    ///     "+(-θ͔υ͕-θ͕υ͔+ι͔σ͕+ι͕σ͔-λ͔π͕-λ͕π͔)e2457",
    ///     "+(+θ͔τ͕+θ͕τ͔-ι͔ρ͕-ι͕ρ͔+κ͔π͕+κ͕π͔)e2465",
    ///     "+(-η͔φ͕-η͕φ͔+κ͔ο͕+κ͕ο͔-λ͔ξ͕-λ͕ξ͔)e2367",
    ///     "+(+η͔υ͕+η͕υ͔-ι͔ο͕-ι͕ο͔+λ͔ν͕+λ͕ν͔)e2375",
    ///     "+(-η͔τ͕-η͕τ͔+ι͔ξ͕+ι͕ξ͔-κ͔ν͕-κ͕ν͔)e2356",
    ///     "+(-η͔σ͕-η͕σ͔+θ͔ο͕+θ͕ο͔-λ͔μ͕-λ͕μ͔)e2347",
    ///     "+(+η͔ρ͕+η͕ρ͔-θ͔ξ͕-θ͕ξ͔+κ͔μ͕+κ͕μ͔)e2364",
    ///     "+(-η͔π͕-η͕π͔+θ͔ν͕+θ͕ν͔-ι͔μ͕-ι͕μ͔)e2345",
    ///     "+(+δ͔φ͕+δ͕φ͔-ε͔υ͕-ε͕υ͔+ζ͔τ͕+ζ͕τ͔)e1576",
    ///     "+(-γ͔φ͕-γ͕φ͔+ε͔σ͕+ε͕σ͔-ζ͔ρ͕-ζ͕ρ͔)e1467",
    ///     "+(+γ͔υ͕+γ͕υ͔-δ͔σ͕-δ͕σ͔+ζ͔π͕+ζ͕π͔)e1475",
    ///     "+(-γ͔τ͕-γ͕τ͔+δ͔ρ͕+δ͕ρ͔-ε͔π͕-ε͕π͔)e1456",
    ///     "+(+β͔φ͕+β͕φ͔-ε͔ο͕-ε͕ο͔+ζ͔ξ͕+ζ͕ξ͔)e1376",
    ///     "+(-β͔υ͕-β͕υ͔+δ͔ο͕+δ͕ο͔-ζ͔ν͕-ζ͕ν͔)e1357",
    ///     "+(+β͔τ͕+β͕τ͔-δ͔ξ͕-δ͕ξ͔+ε͔ν͕+ε͕ν͔)e1365",
    ///     "+(+β͔σ͕+β͕σ͔-γ͔ο͕-γ͕ο͔+ζ͔μ͕+ζ͕μ͔)e1374",
    ///     "+(-β͔ρ͕-β͕ρ͔+γ͔ξ͕+γ͕ξ͔-ε͔μ͕-ε͕μ͔)e1346",
    ///     "+(+β͔π͕+β͕π͔-γ͔ν͕-γ͕ν͔+δ͔μ͕+δ͕μ͔)e1354",
    ///     "+(-α͔φ͕-α͕φ͔+ε͔λ͕+ε͕λ͔-ζ͔κ͕-ζ͕κ͔)e1267",
    ///     "+(+α͔υ͕+α͕υ͔-δ͔λ͕-δ͕λ͔+ζ͔ι͕+ζ͕ι͔)e1275",
    ///     "+(-α͔τ͕-α͕τ͔+δ͔κ͕+δ͕κ͔-ε͔ι͕-ε͕ι͔)e1256",
    ///     "+(-α͔σ͕-α͕σ͔+γ͔λ͕+γ͕λ͔-ζ͔θ͕-ζ͕θ͔)e1247",
    ///     "+(+α͔ρ͕+α͕ρ͔-γ͔κ͕-γ͕κ͔+ε͔θ͕+ε͕θ͔)e1264",
    ///     "+(-α͔π͕-α͕π͔+γ͔ι͕+γ͕ι͔-δ͔θ͕-δ͕θ͔)e1245",
    ///     "+(+α͔ο͕+α͕ο͔-β͔λ͕-β͕λ͔+ζ͔η͕+ζ͕η͔)e1273",
    ///     "+(-α͔ξ͕-α͕ξ͔+β͔κ͕+β͕κ͔-ε͔η͕-ε͕η͔)e1236",
    ///     "+(+α͔ν͕+α͕ν͔-β͔ι͕-β͕ι͔+δ͔η͕+δ͕η͔)e1253",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_rotator() -> Self {
        Self::scalar() + Self::volume5_displacement() + Self::volume_displacement()
    }
    /// The multivector of triple rotator $`r_3 \equiv s + v^5_0 + v_0 + \ell_0`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP7 as Vee};
    ///
    /// let triple_rotator = Vee::single_rotator().lhs() * Vee::double_rotator().rhs();
    ///
    /// assert_eq!(triple_rotator.basis_blades(), Vee::triple_rotator().basis_blades());
    /// format_eq!(triple_rotator, [
    ///     "+v͔v͕-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕-π͔π͕-ρ͔ρ͕-σ͔σ͕-τ͔τ͕-υ͔υ͕-φ͔φ͕",
    ///     "+(+v͔α͕+v͕α͔-ç͕φ͔+é͕υ͔-ë͕τ͔-í͕σ͔+ï͕ρ͔-ñ͕π͔+ó͕ο͔-ö͕ξ͔+ú͕ν͔-ü͕μ͔-β͔η͕+β͕η͔-γ͔θ͕+γ͕θ͔-δ͔ι͕+δ͕ι͔-ε͔κ͕+ε͕κ͔-ζ͔λ͕+ζ͕λ͔)e12",
    ///     "+(+t͕φ͔-u͕υ͔+v͔β͕+v͕β͔+á͕τ͔+ä͕σ͔-å͕ρ͔+æ͕π͔-ó͕λ͔+ö͕κ͔-ú͕ι͔+ü͕θ͔+α͔η͕-α͕η͔-γ͔μ͕+γ͕μ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔-ζ͔ο͕+ζ͕ο͔)e13",
    ///     "+(-q͕φ͔+r͕υ͔-s͕τ͔+v͔γ͕+v͕γ͔-ä͕ο͔+å͕ξ͔-æ͕ν͔+í͕λ͔-ï͕κ͔+ñ͕ι͔-ü͕η͔+α͔θ͕-α͕θ͔+β͔μ͕-β͕μ͔-δ͔π͕+δ͕π͔-ε͔ρ͕+ε͕ρ͔-ζ͔σ͕+ζ͕σ͔)e14",
    ///     "+(+p͕φ͔-r͕σ͔+s͕ρ͔+u͕ο͔+v͔δ͕+v͕δ͔-á͕ξ͔+æ͕μ͔-é͕λ͔+ë͕κ͔-ñ͕θ͔+ú͕η͔+α͔ι͕-α͕ι͔+β͔ν͕-β͕ν͔+γ͔π͕-γ͕π͔-ε͔τ͕+ε͕τ͔-ζ͔υ͕+ζ͕υ͔)e15",
    ///     "+(-p͕υ͔+q͕σ͔-s͕π͔-t͕ο͔+v͔ε͕+v͕ε͔+á͕ν͔-å͕μ͔+ç͕λ͔-ë͕ι͔+ï͕θ͔-ö͕η͔+α͔κ͕-α͕κ͔+β͔ξ͕-β͕ξ͔+γ͔ρ͕-γ͕ρ͔+δ͔τ͕-δ͕τ͔-ζ͔φ͕+ζ͕φ͔)e16",
    ///     "+(+p͕τ͔-q͕ρ͔+r͕π͔+t͕ξ͔-u͕ν͔+v͔ζ͕+v͕ζ͔+ä͕μ͔-ç͕κ͔+é͕ι͔-í͕θ͔+ó͕η͔+α͔λ͕-α͕λ͔+β͔ο͕-β͕ο͔+γ͔σ͕-γ͕σ͔+δ͔υ͕-δ͕υ͔+ε͔φ͕-ε͕φ͔)e17",
    ///     "+(-j͕φ͔+k͕υ͔-l͕τ͔-m͕σ͔+n͕ρ͔-o͕π͔+v͔η͕+v͕η͔+ó͕ζ͔-ö͕ε͔+ú͕δ͔-ü͕γ͔-α͔β͕+α͕β͔-θ͔μ͕+θ͕μ͔-ι͔ν͕+ι͕ν͔-κ͔ξ͕+κ͕ξ͔-λ͔ο͕+λ͕ο͔)e23",
    ///     "+(+g͕φ͔-h͕υ͔+i͕τ͔+m͕ο͔-n͕ξ͔+o͕ν͔+v͔θ͕+v͕θ͔-í͕ζ͔+ï͕ε͔-ñ͕δ͔+ü͕β͔-α͔γ͕+α͕γ͔+η͔μ͕-η͕μ͔-ι͔π͕+ι͕π͔-κ͔ρ͕+κ͕ρ͔-λ͔σ͕+λ͕σ͔)e24",
    ///     "+(-f͕φ͔+h͕σ͔-i͕ρ͔-k͕ο͔+l͕ξ͔-o͕μ͔+v͔ι͕+v͕ι͔+é͕ζ͔-ë͕ε͔+ñ͕γ͔-ú͕β͔-α͔δ͕+α͕δ͔+η͔ν͕-η͕ν͔+θ͔π͕-θ͕π͔-κ͔τ͕+κ͕τ͔-λ͔υ͕+λ͕υ͔)e25",
    ///     "+(+f͕υ͔-g͕σ͔+i͕π͔+j͕ο͔-l͕ν͔+n͕μ͔+v͔κ͕+v͕κ͔-ç͕ζ͔+ë͕δ͔-ï͕γ͔+ö͕β͔-α͔ε͕+α͕ε͔+η͔ξ͕-η͕ξ͔+θ͔ρ͕-θ͕ρ͔+ι͔τ͕-ι͕τ͔-λ͔φ͕+λ͕φ͔)e26",
    ///     "+(-f͕τ͔+g͕ρ͔-h͕π͔-j͕ξ͔+k͕ν͔-m͕μ͔+v͔λ͕+v͕λ͔+ç͕ε͔-é͕δ͔+í͕γ͔-ó͕β͔-α͔ζ͕+α͕ζ͔+η͔ο͕-η͕ο͔+θ͔σ͕-θ͕σ͔+ι͔υ͕-ι͕υ͔+κ͔φ͕-κ͕φ͔)e27",
    ///     "+(-c͕φ͔+d͕υ͔-e͕τ͔-m͕λ͔+n͕κ͔-o͕ι͔+v͔μ͕+v͕μ͔+ä͕ζ͔-å͕ε͔+æ͕δ͔-ü͕α͔-β͔γ͕+β͕γ͔-η͔θ͕+η͕θ͔-ν͔π͕+ν͕π͔-ξ͔ρ͕+ξ͕ρ͔-ο͔σ͕+ο͕σ͔)e34",
    ///     "+(+b͕φ͔-d͕σ͔+e͕ρ͔+k͕λ͔-l͕κ͔+o͕θ͔-u͕ζ͔+v͔ν͕+v͕ν͔+á͕ε͔-æ͕γ͔+ú͕α͔-β͔δ͕+β͕δ͔-η͔ι͕+η͕ι͔+μ͔π͕-μ͕π͔-ξ͔τ͕+ξ͕τ͔-ο͔υ͕+ο͕υ͔)e35",
    ///     "+(-b͕υ͔+c͕σ͔-e͕π͔-j͕λ͔+l͕ι͔-n͕θ͔+t͕ζ͔+v͔ξ͕+v͕ξ͔-á͕δ͔+å͕γ͔-ö͕α͔-β͔ε͕+β͕ε͔-η͔κ͕+η͕κ͔+μ͔ρ͕-μ͕ρ͔+ν͔τ͕-ν͕τ͔-ο͔φ͕+ο͕φ͔)e36",
    ///     "+(+b͕τ͔-c͕ρ͔+d͕π͔+j͕κ͔-k͕ι͔+m͕θ͔-t͕ε͔+u͕δ͔+v͔ο͕+v͕ο͔-ä͕γ͔+ó͕α͔-β͔ζ͕+β͕ζ͔-η͔λ͕+η͕λ͔+μ͔σ͕-μ͕σ͔+ν͔υ͕-ν͕υ͔+ξ͔φ͕-ξ͕φ͔)e37",
    ///     "+(-a͕φ͔+d͕ο͔-e͕ξ͔-h͕λ͔+i͕κ͔-o͕η͔+r͕ζ͔-s͕ε͔+v͔π͕+v͕π͔+æ͕β͔-ñ͕α͔-γ͔δ͕+γ͕δ͔-θ͔ι͕+θ͕ι͔-μ͔ν͕+μ͕ν͔-ρ͔τ͕+ρ͕τ͔-σ͔υ͕+σ͕υ͔)e45",
    ///     "+(+a͕υ͔-c͕ο͔+e͕ν͔+g͕λ͔-i͕ι͔+n͕η͔-q͕ζ͔+s͕δ͔+v͔ρ͕+v͕ρ͔-å͕β͔+ï͕α͔-γ͔ε͕+γ͕ε͔-θ͔κ͕+θ͕κ͔-μ͔ξ͕+μ͕ξ͔+π͔τ͕-π͕τ͔-σ͔φ͕+σ͕φ͔)e46",
    ///     "+(-a͕τ͔+c͕ξ͔-d͕ν͔-g͕κ͔+h͕ι͔-m͕η͔+q͕ε͔-r͕δ͔+v͔σ͕+v͕σ͔+ä͕β͔-í͕α͔-γ͔ζ͕+γ͕ζ͔-θ͔λ͕+θ͕λ͔-μ͔ο͕+μ͕ο͔+π͔υ͕-π͕υ͔+ρ͔φ͕-ρ͕φ͔)e47",
    ///     "+(-a͕σ͔+b͕ο͔-e͕μ͔-f͕λ͔+i͕θ͔-l͕η͔+p͕ζ͔-s͕γ͔+v͔τ͕+v͕τ͔+á͕β͔-ë͕α͔-δ͔ε͕+δ͕ε͔-ι͔κ͕+ι͕κ͔-ν͔ξ͕+ν͕ξ͔-π͔ρ͕+π͕ρ͔-υ͔φ͕+υ͕φ͔)e56",
    ///     "+(+a͕ρ͔-b͕ξ͔+d͕μ͔+f͕κ͔-h͕θ͔+k͕η͔-p͕ε͔+r͕γ͔-u͕β͔+v͔υ͕+v͕υ͔+é͕α͔-δ͔ζ͕+δ͕ζ͔-ι͔λ͕+ι͕λ͔-ν͔ο͕+ν͕ο͔-π͔σ͕+π͕σ͔+τ͔φ͕-τ͕φ͔)e57",
    ///     "+(-a͕π͔+b͕ν͔-c͕μ͔-f͕ι͔+g͕θ͔-j͕η͔+p͕δ͔-q͕γ͔+t͕β͔+v͔φ͕+v͕φ͔-ç͕α͔-ε͔ζ͕+ε͕ζ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔-ρ͔σ͕+ρ͕σ͔-τ͔υ͕+τ͕υ͔)e67",
    ///     "+(-m͕ζ͔+n͕ε͔-o͕δ͔+v͔ü͕-ä͕λ͔+å͕κ͔-æ͕ι͔-í͕ο͔+ï͕ξ͔-ñ͕ν͔-ó͕σ͔+ö͕ρ͔-ú͕π͔+α͔μ͕+α͕μ͔-β͔θ͕-β͕θ͔+γ͔η͕+γ͕η͔)e1234",
    ///     "+(+a͕v͔+b͕μ͔+c͕ν͔+d͕ξ͔+e͕ο͔-f͕θ͔-g͕ι͔-h͕κ͔-i͕λ͔+p͕γ͔+q͕δ͔+r͕ε͔+s͕ζ͔+π͔φ͕+π͕φ͔-ρ͔υ͕-ρ͕υ͔+σ͔τ͕+σ͕τ͔)e4567",
    ///     "+(-a͕μ͔+b͕v͔+c͕π͔+d͕ρ͔+e͕σ͔+f͕η͔-j͕ι͔-k͕κ͔-l͕λ͔-p͕β͔+t͕δ͔+u͕ε͔+á͕ζ͔-ν͔φ͕-ν͕φ͔+ξ͔υ͕+ξ͕υ͔-ο͔τ͕-ο͕τ͔)e3576",
    ///     "+(-a͕ν͔-b͕π͔+c͕v͔+d͕τ͔+e͕υ͔+g͕η͔+j͕θ͔-m͕κ͔-n͕λ͔-q͕β͔-t͕γ͔+ä͕ε͔+å͕ζ͔+μ͔φ͕+μ͕φ͔-ξ͔σ͕-ξ͕σ͔+ο͔ρ͕+ο͕ρ͔)e3467",
    ///     "+(-a͕ξ͔-b͕ρ͔-c͕τ͔+d͕v͔+e͕φ͔+h͕η͔+k͕θ͔+m͕ι͔-o͕λ͔-r͕β͔-u͕γ͔-ä͕δ͔+æ͕ζ͔-μ͔υ͕-μ͕υ͔+ν͔σ͕+ν͕σ͔-ο͔π͕-ο͕π͔)e3475",
    ///     "+(-a͕ο͔-b͕σ͔-c͕υ͔-d͕φ͔+e͕v͔+i͕η͔+l͕θ͔+n͕ι͔+o͕κ͔-s͕β͔-á͕γ͔-å͕δ͔-æ͕ε͔+μ͔τ͕+μ͕τ͔-ν͔ρ͕-ν͕ρ͔+ξ͔π͕+ξ͕π͔)e3456",
    ///     "+(+a͕θ͔-b͕η͔+f͕v͔+g͕π͔+h͕ρ͔+i͕σ͔-j͕ν͔-k͕ξ͔-l͕ο͔+p͕α͔+ç͕δ͔+é͕ε͔+ë͕ζ͔+ι͔φ͕+ι͕φ͔-κ͔υ͕-κ͕υ͔+λ͔τ͕+λ͕τ͔)e2567",
    ///     "+(+a͕ι͔-c͕η͔-f͕π͔+g͕v͔+h͕τ͔+i͕υ͔+j͕μ͔-m͕ξ͔-n͕ο͔+q͕α͔-ç͕γ͔+í͕ε͔+ï͕ζ͔-θ͔φ͕-θ͕φ͔+κ͔σ͕+κ͕σ͔-λ͔ρ͕-λ͕ρ͔)e2476",
    ///     "+(+a͕κ͔-d͕η͔-f͕ρ͔-g͕τ͔+h͕v͔+i͕φ͔+k͕μ͔+m͕ν͔-o͕ο͔+r͕α͔-é͕γ͔-í͕δ͔+ñ͕ζ͔+θ͔υ͕+θ͕υ͔-ι͔σ͕-ι͕σ͔+λ͔π͕+λ͕π͔)e2457",
    ///     "+(+a͕λ͔-e͕η͔-f͕σ͔-g͕υ͔-h͕φ͔+i͕v͔+l͕μ͔+n͕ν͔+o͕ξ͔+s͕α͔-ë͕γ͔-ï͕δ͔-ñ͕ε͔-θ͔τ͕-θ͕τ͔+ι͔ρ͕+ι͕ρ͔-κ͔π͕-κ͕π͔)e2465",
    ///     "+(+b͕ι͔-c͕θ͔+f͕ν͔-g͕μ͔+j͕v͔+k͕τ͔+l͕υ͔-m͕ρ͔-n͕σ͔+t͕α͔+ç͕β͔+ó͕ε͔+ö͕ζ͔+η͔φ͕+η͕φ͔-κ͔ο͕-κ͕ο͔+λ͔ξ͕+λ͕ξ͔)e2367",
    ///     "+(+b͕κ͔-d͕θ͔+f͕ξ͔-h͕μ͔-j͕τ͔+k͕v͔+l͕φ͔+m͕π͔-o͕σ͔+u͕α͔+é͕β͔-ó͕δ͔+ú͕ζ͔-η͔υ͕-η͕υ͔+ι͔ο͕+ι͕ο͔-λ͔ν͕-λ͕ν͔)e2375",
    ///     "+(+b͕λ͔-e͕θ͔+f͕ο͔-i͕μ͔-j͕υ͔-k͕φ͔+l͕v͔+n͕π͔+o͕ρ͔+á͕α͔+ë͕β͔-ö͕δ͔-ú͕ε͔+η͔τ͕+η͕τ͔-ι͔ξ͕-ι͕ξ͔+κ͔ν͕+κ͕ν͔)e2356",
    ///     "+(+c͕κ͔-d͕ι͔+g͕ξ͔-h͕ν͔+j͕ρ͔-k͕π͔+m͕v͔+n͕φ͔-o͕υ͔+ä͕α͔+í͕β͔+ó͕γ͔+ü͕ζ͔+η͔σ͕+η͕σ͔-θ͔ο͕-θ͕ο͔+λ͔μ͕+λ͕μ͔)e2347",
    ///     "+(+c͕λ͔-e͕ι͔+g͕ο͔-i͕ν͔+j͕σ͔-l͕π͔-m͕φ͔+n͕v͔+o͕τ͔+å͕α͔+ï͕β͔+ö͕γ͔-ü͕ε͔-η͔ρ͕-η͕ρ͔+θ͔ξ͕+θ͕ξ͔-κ͔μ͕-κ͕μ͔)e2364",
    ///     "+(+d͕λ͔-e͕κ͔+h͕ο͔-i͕ξ͔+k͕σ͔-l͕ρ͔+m͕υ͔-n͕τ͔+o͕v͔+æ͕α͔+ñ͕β͔+ú͕γ͔+ü͕δ͔+η͔π͕+η͕π͔-θ͔ν͕-θ͕ν͔+ι͔μ͕+ι͕μ͔)e2345",
    ///     "+(-a͕γ͔+b͕β͔-f͕α͔+p͕v͔+q͕π͔+r͕ρ͔+s͕σ͔-t͕ν͔-u͕ξ͔-á͕ο͔+ç͕ι͔+é͕κ͔+ë͕λ͔-δ͔φ͕-δ͕φ͔+ε͔υ͕+ε͕υ͔-ζ͔τ͕-ζ͕τ͔)e1576",
    ///     "+(-a͕δ͔+c͕β͔-g͕α͔-p͕π͔+q͕v͔+r͕τ͔+s͕υ͔+t͕μ͔-ä͕ξ͔-å͕ο͔-ç͕θ͔+í͕κ͔+ï͕λ͔+γ͔φ͕+γ͕φ͔-ε͔σ͕-ε͕σ͔+ζ͔ρ͕+ζ͕ρ͔)e1467",
    ///     "+(-a͕ε͔+d͕β͔-h͕α͔-p͕ρ͔-q͕τ͔+r͕v͔+s͕φ͔+u͕μ͔+ä͕ν͔-æ͕ο͔-é͕θ͔-í͕ι͔+ñ͕λ͔-γ͔υ͕-γ͕υ͔+δ͔σ͕+δ͕σ͔-ζ͔π͕-ζ͕π͔)e1475",
    ///     "+(-a͕ζ͔+e͕β͔-i͕α͔-p͕σ͔-q͕υ͔-r͕φ͔+s͕v͔+á͕μ͔+å͕ν͔+æ͕ξ͔-ë͕θ͔-ï͕ι͔-ñ͕κ͔+γ͔τ͕+γ͕τ͔-δ͔ρ͕-δ͕ρ͔+ε͔π͕+ε͕π͔)e1456",
    ///     "+(-b͕δ͔+c͕γ͔-j͕α͔+p͕ν͔-q͕μ͔+t͕v͔+u͕τ͔+á͕υ͔-ä͕ρ͔-å͕σ͔+ç͕η͔+ó͕κ͔+ö͕λ͔-β͔φ͕-β͕φ͔+ε͔ο͕+ε͕ο͔-ζ͔ξ͕-ζ͕ξ͔)e1376",
    ///     "+(-b͕ε͔+d͕γ͔-k͕α͔+p͕ξ͔-r͕μ͔-t͕τ͔+u͕v͔+á͕φ͔+ä͕π͔-æ͕σ͔+é͕η͔-ó͕ι͔+ú͕λ͔+β͔υ͕+β͕υ͔-δ͔ο͕-δ͕ο͔+ζ͔ν͕+ζ͕ν͔)e1357",
    ///     "+(-b͕ζ͔+e͕γ͔-l͕α͔+p͕ο͔-s͕μ͔-t͕υ͔-u͕φ͔+v͔á͕+å͕π͔+æ͕ρ͔+ë͕η͔-ö͕ι͔-ú͕κ͔-β͔τ͕-β͕τ͔+δ͔ξ͕+δ͕ξ͔-ε͔ν͕-ε͕ν͔)e1365",
    ///     "+(-c͕ε͔+d͕δ͔-m͕α͔+q͕ξ͔-r͕ν͔+t͕ρ͔-u͕π͔+v͔ä͕+å͕φ͔-æ͕υ͔+í͕η͔+ó͕θ͔+ü͕λ͔-β͔σ͕-β͕σ͔+γ͔ο͕+γ͕ο͔-ζ͔μ͕-ζ͕μ͔)e1374",
    ///     "+(-c͕ζ͔+e͕δ͔-n͕α͔+q͕ο͔-s͕ν͔+t͕σ͔+v͔å͕-á͕π͔-ä͕φ͔+æ͕τ͔+ï͕η͔+ö͕θ͔-ü͕κ͔+β͔ρ͕+β͕ρ͔-γ͔ξ͕-γ͕ξ͔+ε͔μ͕+ε͕μ͔)e1346",
    ///     "+(-d͕ζ͔+e͕ε͔-o͕α͔+r͕ο͔-s͕ξ͔+u͕σ͔+v͔æ͕-á͕ρ͔+ä͕υ͔-å͕τ͔+ñ͕η͔+ú͕θ͔+ü͕ι͔-β͔π͕-β͕π͔+γ͔ν͕+γ͕ν͔-δ͔μ͕-δ͕μ͔)e1354",
    ///     "+(-f͕δ͔+g͕γ͔-j͕β͔-p͕ι͔+q͕θ͔-t͕η͔+v͔ç͕+é͕τ͔+ë͕υ͔-í͕ρ͔-ï͕σ͔+ó͕ξ͔+ö͕ο͔+α͔φ͕+α͕φ͔-ε͔λ͕-ε͕λ͔+ζ͔κ͕+ζ͕κ͔)e1267",
    ///     "+(-f͕ε͔+h͕γ͔-k͕β͔-p͕κ͔+r͕θ͔-u͕η͔+v͔é͕-ç͕τ͔+ë͕φ͔+í͕π͔-ñ͕σ͔-ó͕ν͔+ú͕ο͔-α͔υ͕-α͕υ͔+δ͔λ͕+δ͕λ͔-ζ͔ι͕-ζ͕ι͔)e1275",
    ///     "+(-f͕ζ͔+i͕γ͔-l͕β͔-p͕λ͔+s͕θ͔+v͔ë͕-á͕η͔-ç͕υ͔-é͕φ͔+ï͕π͔+ñ͕ρ͔-ö͕ν͔-ú͕ξ͔+α͔τ͕+α͕τ͔-δ͔κ͕-δ͕κ͔+ε͔ι͕+ε͕ι͔)e1256",
    ///     "+(-g͕ε͔+h͕δ͔-m͕β͔-q͕κ͔+r͕ι͔+v͔í͕-ä͕η͔+ç͕ρ͔-é͕π͔+ï͕φ͔-ñ͕υ͔+ó͕μ͔+ü͕ο͔+α͔σ͕+α͕σ͔-γ͔λ͕-γ͕λ͔+ζ͔θ͕+ζ͕θ͔)e1247",
    ///     "+(-g͕ζ͔+i͕δ͔-n͕β͔-q͕λ͔+s͕ι͔+v͔ï͕-å͕η͔+ç͕σ͔-ë͕π͔-í͕φ͔+ñ͕τ͔+ö͕μ͔-ü͕ξ͔-α͔ρ͕-α͕ρ͔+γ͔κ͕+γ͕κ͔-ε͔θ͕-ε͕θ͔)e1264",
    ///     "+(-h͕ζ͔+i͕ε͔-o͕β͔-r͕λ͔+s͕κ͔+v͔ñ͕-æ͕η͔+é͕σ͔-ë͕ρ͔+í͕υ͔-ï͕τ͔+ú͕μ͔+ü͕ν͔+α͔π͕+α͕π͔-γ͔ι͕-γ͕ι͔+δ͔θ͕+δ͕θ͔)e1245",
    ///     "+(-j͕ε͔+k͕δ͔-m͕γ͔-t͕κ͔+u͕ι͔+v͔ó͕-ä͕θ͔-ç͕ξ͔+é͕ν͔-í͕μ͔+ö͕φ͔-ú͕υ͔+ü͕σ͔-α͔ο͕-α͕ο͔+β͔λ͕+β͕λ͔-ζ͔η͕-ζ͕η͔)e1273",
    ///     "+(-j͕ζ͔+l͕δ͔-n͕γ͔-t͕λ͔+v͔ö͕+á͕ι͔-å͕θ͔-ç͕ο͔+ë͕ν͔-ï͕μ͔-ó͕φ͔+ú͕τ͔-ü͕ρ͔+α͔ξ͕+α͕ξ͔-β͔κ͕-β͕κ͔+ε͔η͕+ε͕η͔)e1236",
    ///     "+(-k͕ζ͔+l͕ε͔-o͕γ͔-u͕λ͔+v͔ú͕+á͕κ͔-æ͕θ͔-é͕ο͔+ë͕ξ͔-ñ͕μ͔+ó͕υ͔-ö͕τ͔+ü͕π͔-α͔ν͕-α͕ν͔+β͔ι͕+β͕ι͔-δ͔η͕-δ͕η͔)e1253",
    ///     "+(+a͕η͔+b͕θ͔+c͕ι͔+d͕κ͔+e͕λ͔+f͕μ͔+g͕ν͔+h͕ξ͔+i͕ο͔+j͕π͔+k͕ρ͔+l͕σ͔+m͕τ͔+n͕υ͔+o͕φ͔)e234567",
    ///     "+(-a͕β͔-b͕γ͔-c͕δ͔-d͕ε͔-e͕ζ͔+p͕μ͔+q͕ν͔+r͕ξ͔+s͕ο͔+t͕π͔+u͕ρ͔+á͕σ͔+ä͕τ͔+å͕υ͔+æ͕φ͔)e134576",
    ///     "+(+a͕α͔-f͕γ͔-g͕δ͔-h͕ε͔-i͕ζ͔-p͕θ͔-q͕ι͔-r͕κ͔-s͕λ͔+ç͕π͔+é͕ρ͔+ë͕σ͔+í͕τ͔+ï͕υ͔+ñ͕φ͔)e124567",
    ///     "+(+b͕α͔+f͕β͔-j͕δ͔-k͕ε͔-l͕ζ͔+p͕η͔-t͕ι͔-u͕κ͔-á͕λ͔-ç͕ν͔-é͕ξ͔-ë͕ο͔+ó͕τ͔+ö͕υ͔+ú͕φ͔)e123576",
    ///     "+(+c͕α͔+g͕β͔+j͕γ͔-m͕ε͔-n͕ζ͔+q͕η͔+t͕θ͔-ä͕κ͔-å͕λ͔+ç͕μ͔-í͕ξ͔-ï͕ο͔-ó͕ρ͔-ö͕σ͔+ü͕φ͔)e123467",
    ///     "+(+d͕α͔+h͕β͔+k͕γ͔+m͕δ͔-o͕ζ͔+r͕η͔+u͕θ͔+ä͕ι͔-æ͕λ͔+é͕μ͔+í͕ν͔-ñ͕ο͔+ó͕π͔-ú͕σ͔-ü͕υ͔)e123475",
    ///     "+(+e͕α͔+i͕β͔+l͕γ͔+n͕δ͔+o͕ε͔+s͕η͔+á͕θ͔+å͕ι͔+æ͕κ͔+ë͕μ͔+ï͕ν͔+ñ͕ξ͔+ö͕π͔+ú͕ρ͔+ü͕τ͔)e123456",
    /// ]);
    ///
    /// let triple_rotator = Vee::volume_displacement().lhs() * Vee::volume_displacement().rhs();
    ///
    /// assert_eq!(triple_rotator.basis_blades(), Vee::triple_rotator().basis_blades());
    /// format_eq!(triple_rotator, [
    ///     "+a͔a͕+b͔b͕+c͔c͕+d͔d͕+e͔e͕+f͔f͕+g͔g͕+h͔h͕+i͔i͕+j͔j͕+k͔k͕+l͔l͕+m͔m͕+n͔n͕+o͔o͕+p͔p͕+q͔q͕\
    ///      +r͔r͕+s͔s͕+t͔t͕+u͔u͕+á͔á͕+ä͔ä͕+å͔å͕+æ͔æ͕+ç͔ç͕+é͔é͕+ë͔ë͕+í͔í͕+ï͔ï͕+ñ͔ñ͕+ó͔ó͕+ö͔ö͕+ú͔ú͕+ü͔ü͕",
    ///     "+(+f͔p͕-f͕p͔+g͔q͕-g͕q͔+h͔r͕-h͕r͔+i͔s͕-i͕s͔+j͔t͕-j͕t͔+k͔u͕-k͕u͔+l͔á͕-l͕á͔+m͔ä͕-m͕ä͔+n͔å͕-n͕å͔+o͔æ͕-o͕æ͔)e12",
    ///     "+(-b͔p͕+b͕p͔-c͔q͕+c͕q͔-d͔r͕+d͕r͔-e͔s͕+e͕s͔+j͔ç͕-j͕ç͔+k͔é͕-k͕é͔+l͔ë͕-l͕ë͔+m͔í͕-m͕í͔+n͔ï͕-n͕ï͔+o͔ñ͕-o͕ñ͔)e13",
    ///     "+(+a͔p͕-a͕p͔-c͔t͕+c͕t͔-d͔u͕+d͕u͔-e͔á͕+e͕á͔-g͔ç͕+g͕ç͔-h͔é͕+h͕é͔-i͔ë͕+i͕ë͔+m͔ó͕-m͕ó͔+n͔ö͕-n͕ö͔+o͔ú͕-o͕ú͔)e14",
    ///     "+(+a͔q͕-a͕q͔+b͔t͕-b͕t͔-d͔ä͕+d͕ä͔-e͔å͕+e͕å͔+f͔ç͕-f͕ç͔-h͔í͕+h͕í͔-i͔ï͕+i͕ï͔-k͔ó͕+k͕ó͔-l͔ö͕+l͕ö͔+o͔ü͕-o͕ü͔)e15",
    ///     "+(+a͔r͕-a͕r͔+b͔u͕-b͕u͔+c͔ä͕-c͕ä͔-e͔æ͕+e͕æ͔+f͔é͕-f͕é͔+g͔í͕-g͕í͔-i͔ñ͕+i͕ñ͔+j͔ó͕-j͕ó͔-l͔ú͕+l͕ú͔-n͔ü͕+n͕ü͔)e16",
    ///     "+(+a͔s͕-a͕s͔+b͔á͕-b͕á͔+c͔å͕-c͕å͔+d͔æ͕-d͕æ͔+f͔ë͕-f͕ë͔+g͔ï͕-g͕ï͔+h͔ñ͕-h͕ñ͔+j͔ö͕-j͕ö͔+k͔ú͕-k͕ú͔+m͔ü͕-m͕ü͔)e17",
    ///     "+(+b͔f͕-b͕f͔+c͔g͕-c͕g͔+d͔h͕-d͕h͔+e͔i͕-e͕i͔+t͔ç͕-t͕ç͔+u͔é͕-u͕é͔+á͔ë͕-á͕ë͔+ä͔í͕-ä͕í͔+å͔ï͕-å͕ï͔+æ͔ñ͕-æ͕ñ͔)e23",
    ///     "+(-a͔f͕+a͕f͔+c͔j͕-c͕j͔+d͔k͕-d͕k͔+e͔l͕-e͕l͔-q͔ç͕+q͕ç͔-r͔é͕+r͕é͔-s͔ë͕+s͕ë͔+ä͔ó͕-ä͕ó͔+å͔ö͕-å͕ö͔+æ͔ú͕-æ͕ú͔)e24",
    ///     "+(-a͔g͕+a͕g͔-b͔j͕+b͕j͔+d͔m͕-d͕m͔+e͔n͕-e͕n͔+p͔ç͕-p͕ç͔-r͔í͕+r͕í͔-s͔ï͕+s͕ï͔-u͔ó͕+u͕ó͔-á͔ö͕+á͕ö͔+æ͔ü͕-æ͕ü͔)e25",
    ///     "+(-a͔h͕+a͕h͔-b͔k͕+b͕k͔-c͔m͕+c͕m͔+e͔o͕-e͕o͔+p͔é͕-p͕é͔+q͔í͕-q͕í͔-s͔ñ͕+s͕ñ͔+t͔ó͕-t͕ó͔-á͔ú͕+á͕ú͔-å͔ü͕+å͕ü͔)e26",
    ///     "+(-a͔i͕+a͕i͔-b͔l͕+b͕l͔-c͔n͕+c͕n͔-d͔o͕+d͕o͔+p͔ë͕-p͕ë͔+q͔ï͕-q͕ï͔+r͔ñ͕-r͕ñ͔+t͔ö͕-t͕ö͔+u͔ú͕-u͕ú͔+ä͔ü͕-ä͕ü͔)e27",
    ///     "+(+a͔b͕-a͕b͔+g͔j͕-g͕j͔+h͔k͕-h͕k͔+i͔l͕-i͕l͔+q͔t͕-q͕t͔+r͔u͕-r͕u͔+s͔á͕-s͕á͔+í͔ó͕-í͕ó͔+ï͔ö͕-ï͕ö͔+ñ͔ú͕-ñ͕ú͔)e34",
    ///     "+(+a͔c͕-a͕c͔-f͔j͕+f͕j͔+h͔m͕-h͕m͔+i͔n͕-i͕n͔-p͔t͕+p͕t͔+r͔ä͕-r͕ä͔+s͔å͕-s͕å͔-é͔ó͕+é͕ó͔-ë͔ö͕+ë͕ö͔+ñ͔ü͕-ñ͕ü͔)e35",
    ///     "+(+a͔d͕-a͕d͔-f͔k͕+f͕k͔-g͔m͕+g͕m͔+i͔o͕-i͕o͔-p͔u͕+p͕u͔-q͔ä͕+q͕ä͔+s͔æ͕-s͕æ͔+ç͔ó͕-ç͕ó͔-ë͔ú͕+ë͕ú͔-ï͔ü͕+ï͕ü͔)e36",
    ///     "+(+a͔e͕-a͕e͔-f͔l͕+f͕l͔-g͔n͕+g͕n͔-h͔o͕+h͕o͔-p͔á͕+p͕á͔-q͔å͕+q͕å͔-r͔æ͕+r͕æ͔+ç͔ö͕-ç͕ö͔+é͔ú͕-é͕ú͔+í͔ü͕-í͕ü͔)e37",
    ///     "+(+b͔c͕-b͕c͔+f͔g͕-f͕g͔+k͔m͕-k͕m͔+l͔n͕-l͕n͔+p͔q͕-p͕q͔+u͔ä͕-u͕ä͔+á͔å͕-á͕å͔+é͔í͕-é͕í͔+ë͔ï͕-ë͕ï͔+ú͔ü͕-ú͕ü͔)e45",
    ///     "+(+b͔d͕-b͕d͔+f͔h͕-f͕h͔-j͔m͕+j͕m͔+l͔o͕-l͕o͔+p͔r͕-p͕r͔-t͔ä͕+t͕ä͔+á͔æ͕-á͕æ͔-ç͔í͕+ç͕í͔+ë͔ñ͕-ë͕ñ͔-ö͔ü͕+ö͕ü͔)e46",
    ///     "+(+b͔e͕-b͕e͔+f͔i͕-f͕i͔-j͔n͕+j͕n͔-k͔o͕+k͕o͔+p͔s͕-p͕s͔-t͔å͕+t͕å͔-u͔æ͕+u͕æ͔-ç͔ï͕+ç͕ï͔-é͔ñ͕+é͕ñ͔+ó͔ü͕-ó͕ü͔)e47",
    ///     "+(+c͔d͕-c͕d͔+g͔h͕-g͕h͔+j͔k͕-j͕k͔+n͔o͕-n͕o͔+q͔r͕-q͕r͔+t͔u͕-t͕u͔+å͔æ͕-å͕æ͔+ç͔é͕-ç͕é͔+ï͔ñ͕-ï͕ñ͔+ö͔ú͕-ö͕ú͔)e56",
    ///     "+(+c͔e͕-c͕e͔+g͔i͕-g͕i͔+j͔l͕-j͕l͔-m͔o͕+m͕o͔+q͔s͕-q͕s͔+t͔á͕-t͕á͔-ä͔æ͕+ä͕æ͔+ç͔ë͕-ç͕ë͔-í͔ñ͕+í͕ñ͔-ó͔ú͕+ó͕ú͔)e57",
    ///     "+(+d͔e͕-d͕e͔+h͔i͕-h͕i͔+k͔l͕-k͕l͔+m͔n͕-m͕n͔+r͔s͕-r͕s͔+u͔á͕-u͕á͔+ä͔å͕-ä͕å͔+é͔ë͕-é͕ë͔+í͔ï͕-í͕ï͔+ó͔ö͕-ó͕ö͔)e67",
    ///     "+(-c͔ç͕-c͕ç͔-d͔é͕-d͕é͔-e͔ë͕-e͕ë͔+g͔t͕+g͕t͔+h͔u͕+h͕u͔+i͔á͕+i͕á͔-j͔q͕-j͕q͔-k͔r͕-k͕r͔-l͔s͕-l͕s͔)e1234",
    ///     "+(-j͔o͕-j͕o͔+k͔n͕+k͕n͔-l͔m͕-l͕m͔-t͔æ͕-t͕æ͔+u͔å͕+u͕å͔-á͔ä͕-á͕ä͔-ç͔ñ͕-ç͕ñ͔+é͔ï͕+é͕ï͔-ë͔í͕-ë͕í͔)e4567",
    ///     "+(+g͔o͕+g͕o͔-h͔n͕-h͕n͔+i͔m͕+i͕m͔+q͔æ͕+q͕æ͔-r͔å͕-r͕å͔+s͔ä͕+s͕ä͔-ç͔ú͕-ç͕ú͔+é͔ö͕+é͕ö͔-ë͔ó͕-ë͕ó͔)e3576",
    ///     "+(-f͔o͕-f͕o͔+h͔l͕+h͕l͔-i͔k͕-i͕k͔-p͔æ͕-p͕æ͔+r͔á͕+r͕á͔-s͔u͕-s͕u͔-ç͔ü͕-ç͕ü͔+í͔ö͕+í͕ö͔-ï͔ó͕-ï͕ó͔)e3467",
    ///     "+(+f͔n͕+f͕n͔-g͔l͕-g͕l͔+i͔j͕+i͕j͔+p͔å͕+p͕å͔-q͔á͕-q͕á͔+s͔t͕+s͕t͔-é͔ü͕-é͕ü͔+í͔ú͕+í͕ú͔-ñ͔ó͕-ñ͕ó͔)e3475",
    ///     "+(-f͔m͕-f͕m͔+g͔k͕+g͕k͔-h͔j͕-h͕j͔-p͔ä͕-p͕ä͔+q͔u͕+q͕u͔-r͔t͕-r͕t͔-ë͔ü͕-ë͕ü͔+ï͔ú͕+ï͕ú͔-ñ͔ö͕-ñ͕ö͔)e3456",
    ///     "+(-c͔o͕-c͕o͔+d͔n͕+d͕n͔-e͔m͕-e͕m͔+q͔ñ͕+q͕ñ͔-r͔ï͕-r͕ï͔+s͔í͕+s͕í͔+t͔ú͕+t͕ú͔-u͔ö͕-u͕ö͔+á͔ó͕+á͕ó͔)e2567",
    ///     "+(+b͔o͕+b͕o͔-d͔l͕-d͕l͔+e͔k͕+e͕k͔-p͔ñ͕-p͕ñ͔+r͔ë͕+r͕ë͔-s͔é͕-s͕é͔+t͔ü͕+t͕ü͔-ä͔ö͕-ä͕ö͔+å͔ó͕+å͕ó͔)e2476",
    ///     "+(-b͔n͕-b͕n͔+c͔l͕+c͕l͔-e͔j͕-e͕j͔+p͔ï͕+p͕ï͔-q͔ë͕-q͕ë͔+s͔ç͕+s͕ç͔+u͔ü͕+u͕ü͔-ä͔ú͕-ä͕ú͔+æ͔ó͕+æ͕ó͔)e2457",
    ///     "+(+b͔m͕+b͕m͔-c͔k͕-c͕k͔+d͔j͕+d͕j͔-p͔í͕-p͕í͔+q͔é͕+q͕é͔-r͔ç͕-r͕ç͔+á͔ü͕+á͕ü͔-å͔ú͕-å͕ú͔+æ͔ö͕+æ͕ö͔)e2465",
    ///     "+(-a͔o͕-a͕o͔+d͔i͕+d͕i͔-e͔h͕-e͕h͔-p͔ú͕-p͕ú͔-q͔ü͕-q͕ü͔+u͔ë͕+u͕ë͔-á͔é͕-á͕é͔+ä͔ï͕+ä͕ï͔-å͔í͕-å͕í͔)e2367",
    ///     "+(+a͔n͕+a͕n͔-c͔i͕-c͕i͔+e͔g͕+e͕g͔+p͔ö͕+p͕ö͔-r͔ü͕-r͕ü͔-t͔ë͕-t͕ë͔+á͔ç͕+á͕ç͔+ä͔ñ͕+ä͕ñ͔-æ͔í͕-æ͕í͔)e2375",
    ///     "+(-a͔m͕-a͕m͔+c͔h͕+c͕h͔-d͔g͕-d͕g͔-p͔ó͕-p͕ó͔-s͔ü͕-s͕ü͔+t͔é͕+t͕é͔-u͔ç͕-u͕ç͔+å͔ñ͕+å͕ñ͔-æ͔ï͕-æ͕ï͔)e2356",
    ///     "+(-a͔l͕-a͕l͔+b͔i͕+b͕i͔-e͔f͕-e͕f͔+q͔ö͕+q͕ö͔+r͔ú͕+r͕ú͔-t͔ï͕-t͕ï͔-u͔ñ͕-u͕ñ͔+å͔ç͕+å͕ç͔+æ͔é͕+æ͕é͔)e2347",
    ///     "+(+a͔k͕+a͕k͔-b͔h͕-b͕h͔+d͔f͕+d͕f͔-q͔ó͕-q͕ó͔+s͔ú͕+s͕ú͔+t͔í͕+t͕í͔-á͔ñ͕-á͕ñ͔-ä͔ç͕-ä͕ç͔+æ͔ë͕+æ͕ë͔)e2364",
    ///     "+(-a͔j͕-a͕j͔+b͔g͕+b͕g͔-c͔f͕-c͕f͔-r͔ó͕-r͕ó͔-s͔ö͕-s͕ö͔+u͔í͕+u͕í͔+á͔ï͕+á͕ï͔-ä͔é͕-ä͕é͔-å͔ë͕-å͕ë͔)e2345",
    ///     "+(-c͔æ͕-c͕æ͔+d͔å͕+d͕å͔-e͔ä͕-e͕ä͔-g͔ñ͕-g͕ñ͔+h͔ï͕+h͕ï͔-i͔í͕-i͕í͔-j͔ú͕-j͕ú͔+k͔ö͕+k͕ö͔-l͔ó͕-l͕ó͔)e1576",
    ///     "+(+b͔æ͕+b͕æ͔-d͔á͕-d͕á͔+e͔u͕+e͕u͔+f͔ñ͕+f͕ñ͔-h͔ë͕-h͕ë͔+i͔é͕+i͕é͔-j͔ü͕-j͕ü͔+m͔ö͕+m͕ö͔-n͔ó͕-n͕ó͔)e1467",
    ///     "+(-b͔å͕-b͕å͔+c͔á͕+c͕á͔-e͔t͕-e͕t͔-f͔ï͕-f͕ï͔+g͔ë͕+g͕ë͔-i͔ç͕-i͕ç͔-k͔ü͕-k͕ü͔+m͔ú͕+m͕ú͔-o͔ó͕-o͕ó͔)e1475",
    ///     "+(+b͔ä͕+b͕ä͔-c͔u͕-c͕u͔+d͔t͕+d͕t͔+f͔í͕+f͕í͔-g͔é͕-g͕é͔+h͔ç͕+h͕ç͔-l͔ü͕-l͕ü͔+n͔ú͕+n͕ú͔-o͔ö͕-o͕ö͔)e1456",
    ///     "+(-a͔æ͕-a͕æ͔+d͔s͕+d͕s͔-e͔r͕-e͕r͔+f͔ú͕+f͕ú͔+g͔ü͕+g͕ü͔-k͔ë͕-k͕ë͔+l͔é͕+l͕é͔-m͔ï͕-m͕ï͔+n͔í͕+n͕í͔)e1376",
    ///     "+(+a͔å͕+a͕å͔-c͔s͕-c͕s͔+e͔q͕+e͕q͔-f͔ö͕-f͕ö͔+h͔ü͕+h͕ü͔+j͔ë͕+j͕ë͔-l͔ç͕-l͕ç͔-m͔ñ͕-m͕ñ͔+o͔í͕+o͕í͔)e1357",
    ///     "+(-a͔ä͕-a͕ä͔+c͔r͕+c͕r͔-d͔q͕-d͕q͔+f͔ó͕+f͕ó͔+i͔ü͕+i͕ü͔-j͔é͕-j͕é͔+k͔ç͕+k͕ç͔-n͔ñ͕-n͕ñ͔+o͔ï͕+o͕ï͔)e1365",
    ///     "+(-a͔á͕-a͕á͔+b͔s͕+b͕s͔-e͔p͕-e͕p͔-g͔ö͕-g͕ö͔-h͔ú͕-h͕ú͔+j͔ï͕+j͕ï͔+k͔ñ͕+k͕ñ͔-n͔ç͕-n͕ç͔-o͔é͕-o͕é͔)e1374",
    ///     "+(+a͔u͕+a͕u͔-b͔r͕-b͕r͔+d͔p͕+d͕p͔+g͔ó͕+g͕ó͔-i͔ú͕-i͕ú͔-j͔í͕-j͕í͔+l͔ñ͕+l͕ñ͔+m͔ç͕+m͕ç͔-o͔ë͕-o͕ë͔)e1346",
    ///     "+(-a͔t͕-a͕t͔+b͔q͕+b͕q͔-c͔p͕-c͕p͔+h͔ó͕+h͕ó͔+i͔ö͕+i͕ö͔-k͔í͕-k͕í͔-l͔ï͕-l͕ï͔+m͔é͕+m͕é͔+n͔ë͕+n͕ë͔)e1354",
    ///     "+(-a͔ñ͕-a͕ñ͔-b͔ú͕-b͕ú͔-c͔ü͕-c͕ü͔+h͔s͕+h͕s͔-i͔r͕-i͕r͔+k͔á͕+k͕á͔-l͔u͕-l͕u͔+m͔å͕+m͕å͔-n͔ä͕-n͕ä͔)e1267",
    ///     "+(+a͔ï͕+a͕ï͔+b͔ö͕+b͕ö͔-d͔ü͕-d͕ü͔-g͔s͕-g͕s͔+i͔q͕+i͕q͔-j͔á͕-j͕á͔+l͔t͕+l͕t͔+m͔æ͕+m͕æ͔-o͔ä͕-o͕ä͔)e1275",
    ///     "+(-a͔í͕-a͕í͔-b͔ó͕-b͕ó͔-e͔ü͕-e͕ü͔+g͔r͕+g͕r͔-h͔q͕-h͕q͔+j͔u͕+j͕u͔-k͔t͕-k͕t͔+n͔æ͕+n͕æ͔-o͔å͕-o͕å͔)e1256",
    ///     "+(-a͔ë͕-a͕ë͔+c͔ö͕+c͕ö͔+d͔ú͕+d͕ú͔+f͔s͕+f͕s͔-i͔p͕-i͕p͔-j͔å͕-j͕å͔-k͔æ͕-k͕æ͔+n͔t͕+n͕t͔+o͔u͕+o͕u͔)e1247",
    ///     "+(+a͔é͕+a͕é͔-c͔ó͕-c͕ó͔+e͔ú͕+e͕ú͔-f͔r͕-f͕r͔+h͔p͕+h͕p͔+j͔ä͕+j͕ä͔-l͔æ͕-l͕æ͔-m͔t͕-m͕t͔+o͔á͕+o͕á͔)e1264",
    ///     "+(-a͔ç͕-a͕ç͔-d͔ó͕-d͕ó͔-e͔ö͕-e͕ö͔+f͔q͕+f͕q͔-g͔p͕-g͕p͔+k͔ä͕+k͕ä͔+l͔å͕+l͕å͔-m͔u͕-m͕u͔-n͔á͕-n͕á͔)e1245",
    ///     "+(-b͔ë͕-b͕ë͔-c͔ï͕-c͕ï͔-d͔ñ͕-d͕ñ͔+f͔á͕+f͕á͔+g͔å͕+g͕å͔+h͔æ͕+h͕æ͔-l͔p͕-l͕p͔-n͔q͕-n͕q͔-o͔r͕-o͕r͔)e1273",
    ///     "+(+b͔é͕+b͕é͔+c͔í͕+c͕í͔-e͔ñ͕-e͕ñ͔-f͔u͕-f͕u͔-g͔ä͕-g͕ä͔+i͔æ͕+i͕æ͔+k͔p͕+k͕p͔+m͔q͕+m͕q͔-o͔s͕-o͕s͔)e1236",
    ///     "+(-b͔ç͕-b͕ç͔+d͔í͕+d͕í͔+e͔ï͕+e͕ï͔+f͔t͕+f͕t͔-h͔ä͕-h͕ä͔-i͔å͕-i͕å͔-j͔p͕-j͕p͔+m͔r͕+m͕r͔+n͔s͕+n͕s͔)e1253",
    ///     "+(-p͔ü͕+p͕ü͔+q͔ú͕-q͕ú͔-r͔ö͕+r͕ö͔+s͔ó͕-s͕ó͔-t͔ñ͕+t͕ñ͔+u͔ï͕-u͕ï͔-á͔í͕+á͕í͔-ä͔ë͕+ä͕ë͔+å͔é͕-å͕é͔-æ͔ç͕+æ͕ç͔)e234567",
    ///     "+(+f͔ü͕-f͕ü͔-g͔ú͕+g͕ú͔+h͔ö͕-h͕ö͔-i͔ó͕+i͕ó͔+j͔ñ͕-j͕ñ͔-k͔ï͕+k͕ï͔+l͔í͕-l͕í͔+m͔ë͕-m͕ë͔-n͔é͕+n͕é͔+o͔ç͕-o͕ç͔)e134576",
    ///     "+(-b͔ü͕+b͕ü͔+c͔ú͕-c͕ú͔-d͔ö͕+d͕ö͔+e͔ó͕-e͕ó͔-j͔æ͕+j͕æ͔+k͔å͕-k͕å͔-l͔ä͕+l͕ä͔-m͔á͕+m͕á͔+n͔u͕-n͕u͔-o͔t͕+o͕t͔)e124567",
    ///     "+(+a͔ü͕-a͕ü͔-c͔ñ͕+c͕ñ͔+d͔ï͕-d͕ï͔-e͔í͕+e͕í͔+g͔æ͕-g͕æ͔-h͔å͕+h͕å͔+i͔ä͕-i͕ä͔+m͔s͕-m͕s͔-n͔r͕+n͕r͔+o͔q͕-o͕q͔)e123576",
    ///     "+(-a͔ú͕+a͕ú͔+b͔ñ͕-b͕ñ͔-d͔ë͕+d͕ë͔+e͔é͕-e͕é͔-f͔æ͕+f͕æ͔+h͔á͕-h͕á͔-i͔u͕+i͕u͔-k͔s͕+k͕s͔+l͔r͕-l͕r͔-o͔p͕+o͕p͔)e123467",
    ///     "+(+a͔ö͕-a͕ö͔-b͔ï͕+b͕ï͔+c͔ë͕-c͕ë͔-e͔ç͕+e͕ç͔+f͔å͕-f͕å͔-g͔á͕+g͕á͔+i͔t͕-i͕t͔+j͔s͕-j͕s͔-l͔q͕+l͕q͔+n͔p͕-n͕p͔)e123475",
    ///     "+(-a͔ó͕+a͕ó͔+b͔í͕-b͕í͔-c͔é͕+c͕é͔+d͔ç͕-d͕ç͔-f͔ä͕+f͕ä͔+g͔u͕-g͕u͔-h͔t͕+h͕t͔-j͔r͕+j͕r͔+k͔q͕-k͕q͔-m͔p͕+m͕p͔)e123456",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn triple_rotator() -> Self {
        Self::scalar()
            + Self::volume5_displacement()
            + Self::volume_displacement()
            + Self::line_displacement()
    }
    /// The multivector of translator $`t \equiv s + v^5_\infty`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let translator = Vee::point().lhs() * Vee::point().rhs();
    ///
    /// assert_eq!(translator.basis_blades(), Vee::translator().basis_blades());
    /// format_eq!(translator, [
    ///     "-w͔w͕",
    ///     "+(+X͔w͕-X͕w͔)e01",
    ///     "+(+Y͔w͕-Y͕w͔)e02",
    ///     "+(+Z͔w͕-Z͕w͔)e03",
    ///     "+(-w͔Ð͕+w͕Ð͔)e04",
    ///     "+(-w͔Ø͕+w͕Ø͔)e05",
    ///     "+(-w͔Þ͕+w͕Þ͔)e06",
    ///     "+(-w͔Œ͕+w͕Œ͔)e07",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn translator() -> Self {
        Self::scalar() + Self::volume5_moment()
    }
    /// The multivector of simple single motor $`m_{s1} \equiv s + v^5`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let simple_single_motor = Vee::volume6().lhs() * Vee::volume6().rhs();
    ///
    /// assert_eq!(
    ///     simple_single_motor.basis_blades(),
    ///     Vee::simple_single_motor().basis_blades()
    /// );
    /// format_eq!(simple_single_motor, [
    ///     "+x͔x͕+y͔y͕+z͔z͕+ð͔ð͕+ø͔ø͕+þ͔þ͕+œ͔œ͕",
    ///     "+(+W͔x͕-W͕x͔)e01",
    ///     "+(+W͔y͕-W͕y͔)e02",
    ///     "+(+W͔z͕-W͕z͔)e03",
    ///     "+(+W͔ð͕-W͕ð͔)e04",
    ///     "+(+W͔ø͕-W͕ø͔)e05",
    ///     "+(+W͔þ͕-W͕þ͔)e06",
    ///     "+(+W͔œ͕-W͕œ͔)e07",
    ///     "+(+x͔y͕-x͕y͔)e12",
    ///     "+(+x͔z͕-x͕z͔)e13",
    ///     "+(+x͔ð͕-x͕ð͔)e14",
    ///     "+(+x͔ø͕-x͕ø͔)e15",
    ///     "+(+x͔þ͕-x͕þ͔)e16",
    ///     "+(+x͔œ͕-x͕œ͔)e17",
    ///     "+(+y͔z͕-y͕z͔)e23",
    ///     "+(+y͔ð͕-y͕ð͔)e24",
    ///     "+(+y͔ø͕-y͕ø͔)e25",
    ///     "+(+y͔þ͕-y͕þ͔)e26",
    ///     "+(+y͔œ͕-y͕œ͔)e27",
    ///     "+(+z͔ð͕-z͕ð͔)e34",
    ///     "+(+z͔ø͕-z͕ø͔)e35",
    ///     "+(+z͔þ͕-z͕þ͔)e36",
    ///     "+(+z͔œ͕-z͕œ͔)e37",
    ///     "+(+ð͔ø͕-ð͕ø͔)e45",
    ///     "+(+ð͔þ͕-ð͕þ͔)e46",
    ///     "+(+ð͔œ͕-ð͕œ͔)e47",
    ///     "+(+ø͔þ͕-ø͕þ͔)e56",
    ///     "+(+ø͔œ͕-ø͕œ͔)e57",
    ///     "+(+þ͔œ͕-þ͕œ͔)e67",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_single_motor() -> Self {
        Self::scalar() + Self::volume5()
    }
    /// The multivector of single motor $`m_1 \equiv s + v^5 + v_\infty`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP7 as Vee};
    ///
    /// let single_motor = Vee::single_rotator().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(single_motor.basis_blades(), Vee::single_motor().basis_blades());
    /// format_eq!(single_motor, [
    ///     "+v͔v͕",
    ///     "+(+X͕v͔+Y͕α͔+Z͕β͔+Ð͕γ͔+Ø͕δ͔+Þ͕ε͔+Œ͕ζ͔)e01",
    ///     "+(-X͕α͔+Y͕v͔+Z͕η͔+Ð͕θ͔+Ø͕ι͔+Þ͕κ͔+Œ͕λ͔)e02",
    ///     "+(-X͕β͔-Y͕η͔+Z͕v͔+Ð͕μ͔+Ø͕ν͔+Þ͕ξ͔+Œ͕ο͔)e03",
    ///     "+(-X͕γ͔-Y͕θ͔-Z͕μ͔+v͔Ð͕+Ø͕π͔+Þ͕ρ͔+Œ͕σ͔)e04",
    ///     "+(-X͕δ͔-Y͕ι͔-Z͕ν͔+v͔Ø͕-Ð͕π͔+Þ͕τ͔+Œ͕υ͔)e05",
    ///     "+(-X͕ε͔-Y͕κ͔-Z͕ξ͔+v͔Þ͕-Ð͕ρ͔-Ø͕τ͔+Œ͕φ͔)e06",
    ///     "+(-X͕ζ͔-Y͕λ͔-Z͕ο͔+v͔Œ͕-Ð͕σ͔-Ø͕υ͔-Þ͕φ͔)e07",
    ///     "+v͕α͔e12",
    ///     "+v͕β͔e13",
    ///     "+v͕γ͔e14",
    ///     "+v͕δ͔e15",
    ///     "+v͕ε͔e16",
    ///     "+v͕ζ͔e17",
    ///     "+v͕η͔e23",
    ///     "+v͕θ͔e24",
    ///     "+v͕ι͔e25",
    ///     "+v͕κ͔e26",
    ///     "+v͕λ͔e27",
    ///     "+v͕μ͔e34",
    ///     "+v͕ν͔e35",
    ///     "+v͕ξ͔e36",
    ///     "+v͕ο͔e37",
    ///     "+v͕π͔e45",
    ///     "+v͕ρ͔e46",
    ///     "+v͕σ͔e47",
    ///     "+v͕τ͔e56",
    ///     "+v͕υ͔e57",
    ///     "+v͕φ͔e67",
    ///     "+(+X͕η͔-Y͕β͔+Z͕α͔)e0123",
    ///     "+(+X͕θ͔-Y͕γ͔+Ð͕α͔)e0124",
    ///     "+(+X͕ι͔-Y͕δ͔+Ø͕α͔)e0125",
    ///     "+(+X͕κ͔-Y͕ε͔+Þ͕α͔)e0126",
    ///     "+(+X͕λ͔-Y͕ζ͔+Œ͕α͔)e0127",
    ///     "+(+X͕μ͔-Z͕γ͔+Ð͕β͔)e0134",
    ///     "+(+X͕ν͔-Z͕δ͔+Ø͕β͔)e0135",
    ///     "+(+X͕ξ͔-Z͕ε͔+Þ͕β͔)e0136",
    ///     "+(+X͕ο͔-Z͕ζ͔+Œ͕β͔)e0137",
    ///     "+(+X͕π͔-Ð͕δ͔+Ø͕γ͔)e0145",
    ///     "+(+X͕ρ͔-Ð͕ε͔+Þ͕γ͔)e0146",
    ///     "+(+X͕σ͔-Ð͕ζ͔+Œ͕γ͔)e0147",
    ///     "+(+X͕τ͔-Ø͕ε͔+Þ͕δ͔)e0156",
    ///     "+(+X͕υ͔-Ø͕ζ͔+Œ͕δ͔)e0157",
    ///     "+(+X͕φ͔-Þ͕ζ͔+Œ͕ε͔)e0167",
    ///     "+(+Y͕μ͔-Z͕θ͔+Ð͕η͔)e0234",
    ///     "+(+Y͕ν͔-Z͕ι͔+Ø͕η͔)e0235",
    ///     "+(+Y͕ξ͔-Z͕κ͔+Þ͕η͔)e0236",
    ///     "+(+Y͕ο͔-Z͕λ͔+Œ͕η͔)e0237",
    ///     "+(+Y͕π͔-Ð͕ι͔+Ø͕θ͔)e0245",
    ///     "+(+Y͕ρ͔-Ð͕κ͔+Þ͕θ͔)e0246",
    ///     "+(+Y͕σ͔-Ð͕λ͔+Œ͕θ͔)e0247",
    ///     "+(+Y͕τ͔-Ø͕κ͔+Þ͕ι͔)e0256",
    ///     "+(+Y͕υ͔-Ø͕λ͔+Œ͕ι͔)e0257",
    ///     "+(+Y͕φ͔-Þ͕λ͔+Œ͕κ͔)e0267",
    ///     "+(+Z͕π͔-Ð͕ν͔+Ø͕μ͔)e0345",
    ///     "+(+Z͕ρ͔-Ð͕ξ͔+Þ͕μ͔)e0346",
    ///     "+(+Z͕σ͔-Ð͕ο͔+Œ͕μ͔)e0347",
    ///     "+(+Z͕τ͔-Ø͕ξ͔+Þ͕ν͔)e0356",
    ///     "+(+Z͕υ͔-Ø͕ο͔+Œ͕ν͔)e0357",
    ///     "+(+Z͕φ͔-Þ͕ο͔+Œ͕ξ͔)e0367",
    ///     "+(+Ð͕τ͔-Ø͕ρ͔+Þ͕π͔)e0456",
    ///     "+(+Ð͕υ͔-Ø͕σ͔+Œ͕π͔)e0457",
    ///     "+(+Ð͕φ͔-Þ͕σ͔+Œ͕ρ͔)e0467",
    ///     "+(+Ø͕φ͔-Þ͕υ͔+Œ͕τ͔)e0567",
    /// ]);
    ///
    /// let single_motor = Vee::line().lhs() * Vee::line().rhs();
    ///
    /// assert_eq!(single_motor.basis_blades(), Vee::single_motor().basis_blades());
    /// format_eq!(single_motor, [
    ///     "-x͔x͕-y͔y͕-z͔z͕-ð͔ð͕-ø͔ø͕-þ͔þ͕-œ͔œ͕",
    ///     "+(-y͔Α͕+y͕Α͔-z͔Β͕+z͕Β͔-ð͔Γ͕+ð͕Γ͔-ø͔Δ͕+ø͕Δ͔-þ͔Ε͕+þ͕Ε͔-œ͔Ζ͕+œ͕Ζ͔)e01",
    ///     "+(+x͔Α͕-x͕Α͔-z͔Η͕+z͕Η͔-ð͔Θ͕+ð͕Θ͔-ø͔Ι͕+ø͕Ι͔-þ͔Κ͕+þ͕Κ͔-œ͔Λ͕+œ͕Λ͔)e02",
    ///     "+(+x͔Β͕-x͕Β͔+y͔Η͕-y͕Η͔-ð͔Μ͕+ð͕Μ͔-ø͔Ν͕+ø͕Ν͔-þ͔Ξ͕+þ͕Ξ͔-œ͔Ο͕+œ͕Ο͔)e03",
    ///     "+(+x͔Γ͕-x͕Γ͔+y͔Θ͕-y͕Θ͔+z͔Μ͕-z͕Μ͔-ø͔Π͕+ø͕Π͔-þ͔Ρ͕+þ͕Ρ͔-œ͔Σ͕+œ͕Σ͔)e04",
    ///     "+(+x͔Δ͕-x͕Δ͔+y͔Ι͕-y͕Ι͔+z͔Ν͕-z͕Ν͔+ð͔Π͕-ð͕Π͔-þ͔Τ͕+þ͕Τ͔-œ͔Υ͕+œ͕Υ͔)e05",
    ///     "+(+x͔Ε͕-x͕Ε͔+y͔Κ͕-y͕Κ͔+z͔Ξ͕-z͕Ξ͔+ð͔Ρ͕-ð͕Ρ͔+ø͔Τ͕-ø͕Τ͔-œ͔Φ͕+œ͕Φ͔)e06",
    ///     "+(+x͔Ζ͕-x͕Ζ͔+y͔Λ͕-y͕Λ͔+z͔Ο͕-z͕Ο͔+ð͔Σ͕-ð͕Σ͔+ø͔Υ͕-ø͕Υ͔+þ͔Φ͕-þ͕Φ͔)e07",
    ///     "+(-x͔y͕+x͕y͔)e12",
    ///     "+(-x͔z͕+x͕z͔)e13",
    ///     "+(-x͔ð͕+x͕ð͔)e14",
    ///     "+(-x͔ø͕+x͕ø͔)e15",
    ///     "+(-x͔þ͕+x͕þ͔)e16",
    ///     "+(-x͔œ͕+x͕œ͔)e17",
    ///     "+(-y͔z͕+y͕z͔)e23",
    ///     "+(-y͔ð͕+y͕ð͔)e24",
    ///     "+(-y͔ø͕+y͕ø͔)e25",
    ///     "+(-y͔þ͕+y͕þ͔)e26",
    ///     "+(-y͔œ͕+y͕œ͔)e27",
    ///     "+(-z͔ð͕+z͕ð͔)e34",
    ///     "+(-z͔ø͕+z͕ø͔)e35",
    ///     "+(-z͔þ͕+z͕þ͔)e36",
    ///     "+(-z͔œ͕+z͕œ͔)e37",
    ///     "+(-ð͔ø͕+ð͕ø͔)e45",
    ///     "+(-ð͔þ͕+ð͕þ͔)e46",
    ///     "+(-ð͔œ͕+ð͕œ͔)e47",
    ///     "+(-ø͔þ͕+ø͕þ͔)e56",
    ///     "+(-ø͔œ͕+ø͕œ͔)e57",
    ///     "+(-þ͔œ͕+þ͕œ͔)e67",
    ///     "+(+x͔Η͕+x͕Η͔-y͔Β͕-y͕Β͔+z͔Α͕+z͕Α͔)e0123",
    ///     "+(+x͔Θ͕+x͕Θ͔-y͔Γ͕-y͕Γ͔+ð͔Α͕+ð͕Α͔)e0124",
    ///     "+(+x͔Ι͕+x͕Ι͔-y͔Δ͕-y͕Δ͔+ø͔Α͕+ø͕Α͔)e0125",
    ///     "+(+x͔Κ͕+x͕Κ͔-y͔Ε͕-y͕Ε͔+þ͔Α͕+þ͕Α͔)e0126",
    ///     "+(+x͔Λ͕+x͕Λ͔-y͔Ζ͕-y͕Ζ͔+œ͔Α͕+œ͕Α͔)e0127",
    ///     "+(+x͔Μ͕+x͕Μ͔-z͔Γ͕-z͕Γ͔+ð͔Β͕+ð͕Β͔)e0134",
    ///     "+(+x͔Ν͕+x͕Ν͔-z͔Δ͕-z͕Δ͔+ø͔Β͕+ø͕Β͔)e0135",
    ///     "+(+x͔Ξ͕+x͕Ξ͔-z͔Ε͕-z͕Ε͔+þ͔Β͕+þ͕Β͔)e0136",
    ///     "+(+x͔Ο͕+x͕Ο͔-z͔Ζ͕-z͕Ζ͔+œ͔Β͕+œ͕Β͔)e0137",
    ///     "+(+x͔Π͕+x͕Π͔-ð͔Δ͕-ð͕Δ͔+ø͔Γ͕+ø͕Γ͔)e0145",
    ///     "+(+x͔Ρ͕+x͕Ρ͔-ð͔Ε͕-ð͕Ε͔+þ͔Γ͕+þ͕Γ͔)e0146",
    ///     "+(+x͔Σ͕+x͕Σ͔-ð͔Ζ͕-ð͕Ζ͔+œ͔Γ͕+œ͕Γ͔)e0147",
    ///     "+(+x͔Τ͕+x͕Τ͔-ø͔Ε͕-ø͕Ε͔+þ͔Δ͕+þ͕Δ͔)e0156",
    ///     "+(+x͔Υ͕+x͕Υ͔-ø͔Ζ͕-ø͕Ζ͔+œ͔Δ͕+œ͕Δ͔)e0157",
    ///     "+(+x͔Φ͕+x͕Φ͔-þ͔Ζ͕-þ͕Ζ͔+œ͔Ε͕+œ͕Ε͔)e0167",
    ///     "+(+y͔Μ͕+y͕Μ͔-z͔Θ͕-z͕Θ͔+ð͔Η͕+ð͕Η͔)e0234",
    ///     "+(+y͔Ν͕+y͕Ν͔-z͔Ι͕-z͕Ι͔+ø͔Η͕+ø͕Η͔)e0235",
    ///     "+(+y͔Ξ͕+y͕Ξ͔-z͔Κ͕-z͕Κ͔+þ͔Η͕+þ͕Η͔)e0236",
    ///     "+(+y͔Ο͕+y͕Ο͔-z͔Λ͕-z͕Λ͔+œ͔Η͕+œ͕Η͔)e0237",
    ///     "+(+y͔Π͕+y͕Π͔-ð͔Ι͕-ð͕Ι͔+ø͔Θ͕+ø͕Θ͔)e0245",
    ///     "+(+y͔Ρ͕+y͕Ρ͔-ð͔Κ͕-ð͕Κ͔+þ͔Θ͕+þ͕Θ͔)e0246",
    ///     "+(+y͔Σ͕+y͕Σ͔-ð͔Λ͕-ð͕Λ͔+œ͔Θ͕+œ͕Θ͔)e0247",
    ///     "+(+y͔Τ͕+y͕Τ͔-ø͔Κ͕-ø͕Κ͔+þ͔Ι͕+þ͕Ι͔)e0256",
    ///     "+(+y͔Υ͕+y͕Υ͔-ø͔Λ͕-ø͕Λ͔+œ͔Ι͕+œ͕Ι͔)e0257",
    ///     "+(+y͔Φ͕+y͕Φ͔-þ͔Λ͕-þ͕Λ͔+œ͔Κ͕+œ͕Κ͔)e0267",
    ///     "+(+z͔Π͕+z͕Π͔-ð͔Ν͕-ð͕Ν͔+ø͔Μ͕+ø͕Μ͔)e0345",
    ///     "+(+z͔Ρ͕+z͕Ρ͔-ð͔Ξ͕-ð͕Ξ͔+þ͔Μ͕+þ͕Μ͔)e0346",
    ///     "+(+z͔Σ͕+z͕Σ͔-ð͔Ο͕-ð͕Ο͔+œ͔Μ͕+œ͕Μ͔)e0347",
    ///     "+(+z͔Τ͕+z͕Τ͔-ø͔Ξ͕-ø͕Ξ͔+þ͔Ν͕+þ͕Ν͔)e0356",
    ///     "+(+z͔Υ͕+z͕Υ͔-ø͔Ο͕-ø͕Ο͔+œ͔Ν͕+œ͕Ν͔)e0357",
    ///     "+(+z͔Φ͕+z͕Φ͔-þ͔Ο͕-þ͕Ο͔+œ͔Ξ͕+œ͕Ξ͔)e0367",
    ///     "+(+ð͔Τ͕+ð͕Τ͔-ø͔Ρ͕-ø͕Ρ͔+þ͔Π͕+þ͕Π͔)e0456",
    ///     "+(+ð͔Υ͕+ð͕Υ͔-ø͔Σ͕-ø͕Σ͔+œ͔Π͕+œ͕Π͔)e0457",
    ///     "+(+ð͔Φ͕+ð͕Φ͔-þ͔Σ͕-þ͕Σ͔+œ͔Ρ͕+œ͕Ρ͔)e0467",
    ///     "+(+ø͔Φ͕+ø͕Φ͔-þ͔Υ͕-þ͕Υ͔+œ͔Τ͕+œ͕Τ͔)e0567",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_motor() -> Self {
        Self::scalar() + Self::volume5() + Self::volume_moment()
    }
    /// The multivector of double motor $`m_2 \equiv s + v^5 + v + \ell_\infty`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP7 as Vee};
    ///
    /// let double_motor = Vee::double_rotator().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(double_motor.basis_blades(), Vee::double_motor().basis_blades());
    /// format_eq!(double_motor, [
    ///     "+v͔v͕",
    ///     "+(+X͕v͔+Y͕α͔+Z͕β͔+Ð͕γ͔+Ø͕δ͔+Þ͕ε͔+Œ͕ζ͔)e01",
    ///     "+(-X͕α͔+Y͕v͔+Z͕η͔+Ð͕θ͔+Ø͕ι͔+Þ͕κ͔+Œ͕λ͔)e02",
    ///     "+(-X͕β͔-Y͕η͔+Z͕v͔+Ð͕μ͔+Ø͕ν͔+Þ͕ξ͔+Œ͕ο͔)e03",
    ///     "+(-X͕γ͔-Y͕θ͔-Z͕μ͔+v͔Ð͕+Ø͕π͔+Þ͕ρ͔+Œ͕σ͔)e04",
    ///     "+(-X͕δ͔-Y͕ι͔-Z͕ν͔+v͔Ø͕-Ð͕π͔+Þ͕τ͔+Œ͕υ͔)e05",
    ///     "+(-X͕ε͔-Y͕κ͔-Z͕ξ͔+v͔Þ͕-Ð͕ρ͔-Ø͕τ͔+Œ͕φ͔)e06",
    ///     "+(-X͕ζ͔-Y͕λ͔-Z͕ο͔+v͔Œ͕-Ð͕σ͔-Ø͕υ͔-Þ͕φ͔)e07",
    ///     "+v͕α͔e12",
    ///     "+v͕β͔e13",
    ///     "+v͕γ͔e14",
    ///     "+v͕δ͔e15",
    ///     "+v͕ε͔e16",
    ///     "+v͕ζ͔e17",
    ///     "+v͕η͔e23",
    ///     "+v͕θ͔e24",
    ///     "+v͕ι͔e25",
    ///     "+v͕κ͔e26",
    ///     "+v͕λ͔e27",
    ///     "+v͕μ͔e34",
    ///     "+v͕ν͔e35",
    ///     "+v͕ξ͔e36",
    ///     "+v͕ο͔e37",
    ///     "+v͕π͔e45",
    ///     "+v͕ρ͔e46",
    ///     "+v͕σ͔e47",
    ///     "+v͕τ͔e56",
    ///     "+v͕υ͔e57",
    ///     "+v͕φ͔e67",
    ///     "+v͕ü͔e1234",
    ///     "+(+X͕η͔-Y͕β͔+Z͕α͔+Ð͕ü͔-Ø͕ú͔+Þ͕ö͔-ó͔Œ͕)e0123",
    ///     "+(+X͕θ͔-Y͕γ͔-Z͕ü͔+Ð͕α͔+Ø͕ñ͔-Þ͕ï͔+í͔Œ͕)e0124",
    ///     "+(+X͕ι͔-Y͕δ͔+Z͕ú͔-Ð͕ñ͔+Ø͕α͔+Þ͕ë͔-é͔Œ͕)e0125",
    ///     "+(+X͕κ͔-Y͕ε͔-Z͕ö͔+Ð͕ï͔-Ø͕ë͔+Þ͕α͔+ç͔Œ͕)e0126",
    ///     "+(+X͕λ͔-Y͕ζ͔+Z͕ó͔-Ð͕í͔+Ø͕é͔-Þ͕ç͔+Œ͕α͔)e0127",
    ///     "+(+X͕μ͔+Y͕ü͔-Z͕γ͔+Ð͕β͔-Ø͕æ͔+Þ͕å͔-ä͔Œ͕)e0134",
    ///     "+(+X͕ν͔-Y͕ú͔-Z͕δ͔+u͔Œ͕+Ð͕æ͔+Ø͕β͔-Þ͕á͔)e0135",
    ///     "+(+X͕ξ͔+Y͕ö͔-Z͕ε͔-t͔Œ͕-Ð͕å͔+Ø͕á͔+Þ͕β͔)e0136",
    ///     "+(+X͕ο͔-Y͕ó͔-Z͕ζ͔+t͔Þ͕-u͔Ø͕+Ð͕ä͔+Œ͕β͔)e0137",
    ///     "+(+X͕π͔+Y͕ñ͔-Z͕æ͔-r͔Œ͕+s͔Þ͕-Ð͕δ͔+Ø͕γ͔)e0145",
    ///     "+(+X͕ρ͔-Y͕ï͔+Z͕å͔+q͔Œ͕-s͔Ø͕-Ð͕ε͔+Þ͕γ͔)e0146",
    ///     "+(+X͕σ͔+Y͕í͔-Z͕ä͔-q͔Þ͕+r͔Ø͕-Ð͕ζ͔+Œ͕γ͔)e0147",
    ///     "+(+X͕τ͔+Y͕ë͔-Z͕á͔-p͔Œ͕+s͔Ð͕-Ø͕ε͔+Þ͕δ͔)e0156",
    ///     "+(+X͕υ͔-Y͕é͔+Z͕u͔+p͔Þ͕-r͔Ð͕-Ø͕ζ͔+Œ͕δ͔)e0157",
    ///     "+(+X͕φ͔+Y͕ç͔-Z͕t͔-p͔Ø͕+q͔Ð͕-Þ͕ζ͔+Œ͕ε͔)e0167",
    ///     "+(-X͕ü͔+Y͕μ͔-Z͕θ͔+m͔Œ͕-n͔Þ͕+o͔Ø͕+Ð͕η͔)e0234",
    ///     "+(+X͕ú͔+Y͕ν͔-Z͕ι͔-k͔Œ͕+l͔Þ͕-o͔Ð͕+Ø͕η͔)e0235",
    ///     "+(-X͕ö͔+Y͕ξ͔-Z͕κ͔+j͔Œ͕-l͔Ø͕+n͔Ð͕+Þ͕η͔)e0236",
    ///     "+(+X͕ó͔+Y͕ο͔-Z͕λ͔-j͔Þ͕+k͔Ø͕-m͔Ð͕+Œ͕η͔)e0237",
    ///     "+(-X͕ñ͔+Y͕π͔+Z͕o͔+h͔Œ͕-i͔Þ͕-Ð͕ι͔+Ø͕θ͔)e0245",
    ///     "+(+X͕ï͔+Y͕ρ͔-Z͕n͔-g͔Œ͕+i͔Ø͕-Ð͕κ͔+Þ͕θ͔)e0246",
    ///     "+(-X͕í͔+Y͕σ͔+Z͕m͔+g͔Þ͕-h͔Ø͕-Ð͕λ͔+Œ͕θ͔)e0247",
    ///     "+(-X͕ë͔+Y͕τ͔+Z͕l͔+f͔Œ͕-i͔Ð͕-Ø͕κ͔+Þ͕ι͔)e0256",
    ///     "+(+X͕é͔+Y͕υ͔-Z͕k͔-f͔Þ͕+h͔Ð͕-Ø͕λ͔+Œ͕ι͔)e0257",
    ///     "+(-X͕ç͔+Y͕φ͔+Z͕j͔+f͔Ø͕-g͔Ð͕-Þ͕λ͔+Œ͕κ͔)e0267",
    ///     "+(+X͕æ͔-Y͕o͔+Z͕π͔-d͔Œ͕+e͔Þ͕-Ð͕ν͔+Ø͕μ͔)e0345",
    ///     "+(-X͕å͔+Y͕n͔+Z͕ρ͔+c͔Œ͕-e͔Ø͕-Ð͕ξ͔+Þ͕μ͔)e0346",
    ///     "+(+X͕ä͔-Y͕m͔+Z͕σ͔-c͔Þ͕+d͔Ø͕-Ð͕ο͔+Œ͕μ͔)e0347",
    ///     "+(+X͕á͔-Y͕l͔+Z͕τ͔-b͔Œ͕+e͔Ð͕-Ø͕ξ͔+Þ͕ν͔)e0356",
    ///     "+(-X͕u͔+Y͕k͔+Z͕υ͔+b͔Þ͕-d͔Ð͕-Ø͕ο͔+Œ͕ν͔)e0357",
    ///     "+(+X͕t͔-Y͕j͔+Z͕φ͔-b͔Ø͕+c͔Ð͕-Þ͕ο͔+Œ͕ξ͔)e0367",
    ///     "+(-X͕s͔+Y͕i͔-Z͕e͔+a͔Œ͕+Ð͕τ͔-Ø͕ρ͔+Þ͕π͔)e0456",
    ///     "+(+X͕r͔-Y͕h͔+Z͕d͔-a͔Þ͕+Ð͕υ͔-Ø͕σ͔+Œ͕π͔)e0457",
    ///     "+(-X͕q͔+Y͕g͔-Z͕c͔+a͔Ø͕+Ð͕φ͔-Þ͕σ͔+Œ͕ρ͔)e0467",
    ///     "+(+X͕p͔-Y͕f͔+Z͕b͔-a͔Ð͕+Ø͕φ͔-Þ͕υ͔+Œ͕τ͔)e0567",
    ///     "+a͔v͕e4567",
    ///     "+b͔v͕e3576",
    ///     "+c͔v͕e3467",
    ///     "+d͔v͕e3475",
    ///     "+e͔v͕e3456",
    ///     "+f͔v͕e2567",
    ///     "+g͔v͕e2476",
    ///     "+h͔v͕e2457",
    ///     "+i͔v͕e2465",
    ///     "+j͔v͕e2367",
    ///     "+k͔v͕e2375",
    ///     "+l͔v͕e2356",
    ///     "+m͔v͕e2347",
    ///     "+n͔v͕e2364",
    ///     "+o͔v͕e2345",
    ///     "+p͔v͕e1576",
    ///     "+q͔v͕e1467",
    ///     "+r͔v͕e1475",
    ///     "+s͔v͕e1456",
    ///     "+t͔v͕e1376",
    ///     "+u͔v͕e1357",
    ///     "+v͕á͔e1365",
    ///     "+v͕ä͔e1374",
    ///     "+v͕å͔e1346",
    ///     "+v͕æ͔e1354",
    ///     "+v͕ç͔e1267",
    ///     "+v͕é͔e1275",
    ///     "+v͕ë͔e1256",
    ///     "+v͕í͔e1247",
    ///     "+v͕ï͔e1264",
    ///     "+v͕ñ͔e1245",
    ///     "+v͕ó͔e1273",
    ///     "+v͕ö͔e1236",
    ///     "+v͕ú͔e1253",
    ///     "+(+Z͕a͔+b͔Ð͕+c͔Ø͕+d͔Þ͕+e͔Œ͕)e034567",
    ///     "+(-Y͕a͔+f͔Ð͕+g͔Ø͕+h͔Þ͕+i͔Œ͕)e024576",
    ///     "+(-Y͕b͔-Z͕f͔+j͔Ø͕+k͔Þ͕+l͔Œ͕)e023567",
    ///     "+(-Y͕c͔-Z͕g͔-j͔Ð͕+m͔Þ͕+n͔Œ͕)e023476",
    ///     "+(-Y͕d͔-Z͕h͔-k͔Ð͕-m͔Ø͕+o͔Œ͕)e023457",
    ///     "+(-Y͕e͔-Z͕i͔-l͔Ð͕-n͔Ø͕-o͔Þ͕)e023465",
    ///     "+(+X͕a͔+p͔Ð͕+q͔Ø͕+r͔Þ͕+s͔Œ͕)e014567",
    ///     "+(+X͕b͔-Z͕p͔+t͔Ø͕+u͔Þ͕+á͔Œ͕)e013576",
    ///     "+(+X͕c͔-Z͕q͔-t͔Ð͕+Þ͕ä͔+å͔Œ͕)e013467",
    ///     "+(+X͕d͔-Z͕r͔-u͔Ð͕-Ø͕ä͔+æ͔Œ͕)e013475",
    ///     "+(+X͕e͔-Z͕s͔-Ð͕á͔-Ø͕å͔-Þ͕æ͔)e013456",
    ///     "+(+X͕f͔+Y͕p͔+Ø͕ç͔+Þ͕é͔+ë͔Œ͕)e012567",
    ///     "+(+X͕g͔+Y͕q͔-Ð͕ç͔+Þ͕í͔+ï͔Œ͕)e012476",
    ///     "+(+X͕h͔+Y͕r͔-Ð͕é͔-Ø͕í͔+ñ͔Œ͕)e012457",
    ///     "+(+X͕i͔+Y͕s͔-Ð͕ë͔-Ø͕ï͔-Þ͕ñ͔)e012465",
    ///     "+(+X͕j͔+Y͕t͔+Z͕ç͔+Þ͕ó͔+ö͔Œ͕)e012367",
    ///     "+(+X͕k͔+Y͕u͔+Z͕é͔-Ø͕ó͔+ú͔Œ͕)e012375",
    ///     "+(+X͕l͔+Y͕á͔+Z͕ë͔-Ø͕ö͔-Þ͕ú͔)e012356",
    ///     "+(+X͕m͔+Y͕ä͔+Z͕í͔+Ð͕ó͔+ü͔Œ͕)e012347",
    ///     "+(+X͕n͔+Y͕å͔+Z͕ï͔+Ð͕ö͔-Þ͕ü͔)e012364",
    ///     "+(+X͕o͔+Y͕æ͔+Z͕ñ͔+Ð͕ú͔+Ø͕ü͔)e012345",
    /// ]);
    ///
    /// let simple_double_motor = Vee::volume5().lhs() * Vee::volume5().rhs();
    ///
    /// assert_eq!(simple_double_motor.basis_blades(), Vee::simple_double_motor().basis_blades());
    /// format_eq!(simple_double_motor, [
    ///     "-α͔α͕-β͔β͕-γ͔γ͕-δ͔δ͕-ε͔ε͕-ζ͔ζ͕-η͔η͕-θ͔θ͕-ι͔ι͕-κ͔κ͕-λ͔λ͕-μ͔μ͕-ν͔ν͕-ξ͔ξ͕-ο͔ο͕-π͔π͕-ρ͔ρ͕-σ͔σ͕-τ͔τ͕-υ͔υ͕-φ͔φ͕",
    ///     "+(-Y͔α͕+Y͕α͔-Z͔β͕+Z͕β͔-Ð͔γ͕+Ð͕γ͔-Ø͔δ͕+Ø͕δ͔-Þ͔ε͕+Þ͕ε͔-Œ͔ζ͕+Œ͕ζ͔)e01",
    ///     "+(+X͔α͕-X͕α͔-Z͔η͕+Z͕η͔-Ð͔θ͕+Ð͕θ͔-Ø͔ι͕+Ø͕ι͔-Þ͔κ͕+Þ͕κ͔-Œ͔λ͕+Œ͕λ͔)e02",
    ///     "+(+X͔β͕-X͕β͔+Y͔η͕-Y͕η͔-Ð͔μ͕+Ð͕μ͔-Ø͔ν͕+Ø͕ν͔-Þ͔ξ͕+Þ͕ξ͔-Œ͔ο͕+Œ͕ο͔)e03",
    ///     "+(+X͔γ͕-X͕γ͔+Y͔θ͕-Y͕θ͔+Z͔μ͕-Z͕μ͔-Ø͔π͕+Ø͕π͔-Þ͔ρ͕+Þ͕ρ͔-Œ͔σ͕+Œ͕σ͔)e04",
    ///     "+(+X͔δ͕-X͕δ͔+Y͔ι͕-Y͕ι͔+Z͔ν͕-Z͕ν͔+Ð͔π͕-Ð͕π͔-Þ͔τ͕+Þ͕τ͔-Œ͔υ͕+Œ͕υ͔)e05",
    ///     "+(+X͔ε͕-X͕ε͔+Y͔κ͕-Y͕κ͔+Z͔ξ͕-Z͕ξ͔+Ð͔ρ͕-Ð͕ρ͔+Ø͔τ͕-Ø͕τ͔-Œ͔φ͕+Œ͕φ͔)e06",
    ///     "+(+X͔ζ͕-X͕ζ͔+Y͔λ͕-Y͕λ͔+Z͔ο͕-Z͕ο͔+Ð͔σ͕-Ð͕σ͔+Ø͔υ͕-Ø͕υ͔+Þ͔φ͕-Þ͕φ͔)e07",
    ///     "+(-β͔η͕+β͕η͔-γ͔θ͕+γ͕θ͔-δ͔ι͕+δ͕ι͔-ε͔κ͕+ε͕κ͔-ζ͔λ͕+ζ͕λ͔)e12",
    ///     "+(+α͔η͕-α͕η͔-γ͔μ͕+γ͕μ͔-δ͔ν͕+δ͕ν͔-ε͔ξ͕+ε͕ξ͔-ζ͔ο͕+ζ͕ο͔)e13",
    ///     "+(+α͔θ͕-α͕θ͔+β͔μ͕-β͕μ͔-δ͔π͕+δ͕π͔-ε͔ρ͕+ε͕ρ͔-ζ͔σ͕+ζ͕σ͔)e14",
    ///     "+(+α͔ι͕-α͕ι͔+β͔ν͕-β͕ν͔+γ͔π͕-γ͕π͔-ε͔τ͕+ε͕τ͔-ζ͔υ͕+ζ͕υ͔)e15",
    ///     "+(+α͔κ͕-α͕κ͔+β͔ξ͕-β͕ξ͔+γ͔ρ͕-γ͕ρ͔+δ͔τ͕-δ͕τ͔-ζ͔φ͕+ζ͕φ͔)e16",
    ///     "+(+α͔λ͕-α͕λ͔+β͔ο͕-β͕ο͔+γ͔σ͕-γ͕σ͔+δ͔υ͕-δ͕υ͔+ε͔φ͕-ε͕φ͔)e17",
    ///     "+(-α͔β͕+α͕β͔-θ͔μ͕+θ͕μ͔-ι͔ν͕+ι͕ν͔-κ͔ξ͕+κ͕ξ͔-λ͔ο͕+λ͕ο͔)e23",
    ///     "+(-α͔γ͕+α͕γ͔+η͔μ͕-η͕μ͔-ι͔π͕+ι͕π͔-κ͔ρ͕+κ͕ρ͔-λ͔σ͕+λ͕σ͔)e24",
    ///     "+(-α͔δ͕+α͕δ͔+η͔ν͕-η͕ν͔+θ͔π͕-θ͕π͔-κ͔τ͕+κ͕τ͔-λ͔υ͕+λ͕υ͔)e25",
    ///     "+(-α͔ε͕+α͕ε͔+η͔ξ͕-η͕ξ͔+θ͔ρ͕-θ͕ρ͔+ι͔τ͕-ι͕τ͔-λ͔φ͕+λ͕φ͔)e26",
    ///     "+(-α͔ζ͕+α͕ζ͔+η͔ο͕-η͕ο͔+θ͔σ͕-θ͕σ͔+ι͔υ͕-ι͕υ͔+κ͔φ͕-κ͕φ͔)e27",
    ///     "+(-β͔γ͕+β͕γ͔-η͔θ͕+η͕θ͔-ν͔π͕+ν͕π͔-ξ͔ρ͕+ξ͕ρ͔-ο͔σ͕+ο͕σ͔)e34",
    ///     "+(-β͔δ͕+β͕δ͔-η͔ι͕+η͕ι͔+μ͔π͕-μ͕π͔-ξ͔τ͕+ξ͕τ͔-ο͔υ͕+ο͕υ͔)e35",
    ///     "+(-β͔ε͕+β͕ε͔-η͔κ͕+η͕κ͔+μ͔ρ͕-μ͕ρ͔+ν͔τ͕-ν͕τ͔-ο͔φ͕+ο͕φ͔)e36",
    ///     "+(-β͔ζ͕+β͕ζ͔-η͔λ͕+η͕λ͔+μ͔σ͕-μ͕σ͔+ν͔υ͕-ν͕υ͔+ξ͔φ͕-ξ͕φ͔)e37",
    ///     "+(-γ͔δ͕+γ͕δ͔-θ͔ι͕+θ͕ι͔-μ͔ν͕+μ͕ν͔-ρ͔τ͕+ρ͕τ͔-σ͔υ͕+σ͕υ͔)e45",
    ///     "+(-γ͔ε͕+γ͕ε͔-θ͔κ͕+θ͕κ͔-μ͔ξ͕+μ͕ξ͔+π͔τ͕-π͕τ͔-σ͔φ͕+σ͕φ͔)e46",
    ///     "+(-γ͔ζ͕+γ͕ζ͔-θ͔λ͕+θ͕λ͔-μ͔ο͕+μ͕ο͔+π͔υ͕-π͕υ͔+ρ͔φ͕-ρ͕φ͔)e47",
    ///     "+(-δ͔ε͕+δ͕ε͔-ι͔κ͕+ι͕κ͔-ν͔ξ͕+ν͕ξ͔-π͔ρ͕+π͕ρ͔-υ͔φ͕+υ͕φ͔)e56",
    ///     "+(-δ͔ζ͕+δ͕ζ͔-ι͔λ͕+ι͕λ͔-ν͔ο͕+ν͕ο͔-π͔σ͕+π͕σ͔+τ͔φ͕-τ͕φ͔)e57",
    ///     "+(-ε͔ζ͕+ε͕ζ͔-κ͔λ͕+κ͕λ͔-ξ͔ο͕+ξ͕ο͔-ρ͔σ͕+ρ͕σ͔-τ͔υ͕+τ͕υ͔)e67",
    ///     "+(+α͔μ͕+α͕μ͔-β͔θ͕-β͕θ͔+γ͔η͕+γ͕η͔)e1234",
    ///     "+(+X͔η͕+X͕η͔-Y͔β͕-Y͕β͔+Z͔α͕+Z͕α͔)e0123",
    ///     "+(+X͔θ͕+X͕θ͔-Y͔γ͕-Y͕γ͔+Ð͔α͕+Ð͕α͔)e0124",
    ///     "+(+X͔ι͕+X͕ι͔-Y͔δ͕-Y͕δ͔+Ø͔α͕+Ø͕α͔)e0125",
    ///     "+(+X͔κ͕+X͕κ͔-Y͔ε͕-Y͕ε͔+Þ͔α͕+Þ͕α͔)e0126",
    ///     "+(+X͔λ͕+X͕λ͔-Y͔ζ͕-Y͕ζ͔+Œ͔α͕+Œ͕α͔)e0127",
    ///     "+(+X͔μ͕+X͕μ͔-Z͔γ͕-Z͕γ͔+Ð͔β͕+Ð͕β͔)e0134",
    ///     "+(+X͔ν͕+X͕ν͔-Z͔δ͕-Z͕δ͔+Ø͔β͕+Ø͕β͔)e0135",
    ///     "+(+X͔ξ͕+X͕ξ͔-Z͔ε͕-Z͕ε͔+Þ͔β͕+Þ͕β͔)e0136",
    ///     "+(+X͔ο͕+X͕ο͔-Z͔ζ͕-Z͕ζ͔+Œ͔β͕+Œ͕β͔)e0137",
    ///     "+(+X͔π͕+X͕π͔-Ð͔δ͕-Ð͕δ͔+Ø͔γ͕+Ø͕γ͔)e0145",
    ///     "+(+X͔ρ͕+X͕ρ͔-Ð͔ε͕-Ð͕ε͔+Þ͔γ͕+Þ͕γ͔)e0146",
    ///     "+(+X͔σ͕+X͕σ͔-Ð͔ζ͕-Ð͕ζ͔+Œ͔γ͕+Œ͕γ͔)e0147",
    ///     "+(+X͔τ͕+X͕τ͔-Ø͔ε͕-Ø͕ε͔+Þ͔δ͕+Þ͕δ͔)e0156",
    ///     "+(+X͔υ͕+X͕υ͔-Ø͔ζ͕-Ø͕ζ͔+Œ͔δ͕+Œ͕δ͔)e0157",
    ///     "+(+X͔φ͕+X͕φ͔-Þ͔ζ͕-Þ͕ζ͔+Œ͔ε͕+Œ͕ε͔)e0167",
    ///     "+(+Y͔μ͕+Y͕μ͔-Z͔θ͕-Z͕θ͔+Ð͔η͕+Ð͕η͔)e0234",
    ///     "+(+Y͔ν͕+Y͕ν͔-Z͔ι͕-Z͕ι͔+Ø͔η͕+Ø͕η͔)e0235",
    ///     "+(+Y͔ξ͕+Y͕ξ͔-Z͔κ͕-Z͕κ͔+Þ͔η͕+Þ͕η͔)e0236",
    ///     "+(+Y͔ο͕+Y͕ο͔-Z͔λ͕-Z͕λ͔+Œ͔η͕+Œ͕η͔)e0237",
    ///     "+(+Y͔π͕+Y͕π͔-Ð͔ι͕-Ð͕ι͔+Ø͔θ͕+Ø͕θ͔)e0245",
    ///     "+(+Y͔ρ͕+Y͕ρ͔-Ð͔κ͕-Ð͕κ͔+Þ͔θ͕+Þ͕θ͔)e0246",
    ///     "+(+Y͔σ͕+Y͕σ͔-Ð͔λ͕-Ð͕λ͔+Œ͔θ͕+Œ͕θ͔)e0247",
    ///     "+(+Y͔τ͕+Y͕τ͔-Ø͔κ͕-Ø͕κ͔+Þ͔ι͕+Þ͕ι͔)e0256",
    ///     "+(+Y͔υ͕+Y͕υ͔-Ø͔λ͕-Ø͕λ͔+Œ͔ι͕+Œ͕ι͔)e0257",
    ///     "+(+Y͔φ͕+Y͕φ͔-Þ͔λ͕-Þ͕λ͔+Œ͔κ͕+Œ͕κ͔)e0267",
    ///     "+(+Z͔π͕+Z͕π͔-Ð͔ν͕-Ð͕ν͔+Ø͔μ͕+Ø͕μ͔)e0345",
    ///     "+(+Z͔ρ͕+Z͕ρ͔-Ð͔ξ͕-Ð͕ξ͔+Þ͔μ͕+Þ͕μ͔)e0346",
    ///     "+(+Z͔σ͕+Z͕σ͔-Ð͔ο͕-Ð͕ο͔+Œ͔μ͕+Œ͕μ͔)e0347",
    ///     "+(+Z͔τ͕+Z͕τ͔-Ø͔ξ͕-Ø͕ξ͔+Þ͔ν͕+Þ͕ν͔)e0356",
    ///     "+(+Z͔υ͕+Z͕υ͔-Ø͔ο͕-Ø͕ο͔+Œ͔ν͕+Œ͕ν͔)e0357",
    ///     "+(+Z͔φ͕+Z͕φ͔-Þ͔ο͕-Þ͕ο͔+Œ͔ξ͕+Œ͕ξ͔)e0367",
    ///     "+(+Ð͔τ͕+Ð͕τ͔-Ø͔ρ͕-Ø͕ρ͔+Þ͔π͕+Þ͕π͔)e0456",
    ///     "+(+Ð͔υ͕+Ð͕υ͔-Ø͔σ͕-Ø͕σ͔+Œ͔π͕+Œ͕π͔)e0457",
    ///     "+(+Ð͔φ͕+Ð͕φ͔-Þ͔σ͕-Þ͕σ͔+Œ͔ρ͕+Œ͕ρ͔)e0467",
    ///     "+(+Ø͔φ͕+Ø͕φ͔-Þ͔υ͕-Þ͕υ͔+Œ͔τ͕+Œ͕τ͔)e0567",
    ///     "+(+π͔φ͕+π͕φ͔-ρ͔υ͕-ρ͕υ͔+σ͔τ͕+σ͕τ͔)e4567",
    ///     "+(-ν͔φ͕-ν͕φ͔+ξ͔υ͕+ξ͕υ͔-ο͔τ͕-ο͕τ͔)e3576",
    ///     "+(+μ͔φ͕+μ͕φ͔-ξ͔σ͕-ξ͕σ͔+ο͔ρ͕+ο͕ρ͔)e3467",
    ///     "+(-μ͔υ͕-μ͕υ͔+ν͔σ͕+ν͕σ͔-ο͔π͕-ο͕π͔)e3475",
    ///     "+(+μ͔τ͕+μ͕τ͔-ν͔ρ͕-ν͕ρ͔+ξ͔π͕+ξ͕π͔)e3456",
    ///     "+(+ι͔φ͕+ι͕φ͔-κ͔υ͕-κ͕υ͔+λ͔τ͕+λ͕τ͔)e2567",
    ///     "+(-θ͔φ͕-θ͕φ͔+κ͔σ͕+κ͕σ͔-λ͔ρ͕-λ͕ρ͔)e2476",
    ///     "+(+θ͔υ͕+θ͕υ͔-ι͔σ͕-ι͕σ͔+λ͔π͕+λ͕π͔)e2457",
    ///     "+(-θ͔τ͕-θ͕τ͔+ι͔ρ͕+ι͕ρ͔-κ͔π͕-κ͕π͔)e2465",
    ///     "+(+η͔φ͕+η͕φ͔-κ͔ο͕-κ͕ο͔+λ͔ξ͕+λ͕ξ͔)e2367",
    ///     "+(-η͔υ͕-η͕υ͔+ι͔ο͕+ι͕ο͔-λ͔ν͕-λ͕ν͔)e2375",
    ///     "+(+η͔τ͕+η͕τ͔-ι͔ξ͕-ι͕ξ͔+κ͔ν͕+κ͕ν͔)e2356",
    ///     "+(+η͔σ͕+η͕σ͔-θ͔ο͕-θ͕ο͔+λ͔μ͕+λ͕μ͔)e2347",
    ///     "+(-η͔ρ͕-η͕ρ͔+θ͔ξ͕+θ͕ξ͔-κ͔μ͕-κ͕μ͔)e2364",
    ///     "+(+η͔π͕+η͕π͔-θ͔ν͕-θ͕ν͔+ι͔μ͕+ι͕μ͔)e2345",
    ///     "+(-δ͔φ͕-δ͕φ͔+ε͔υ͕+ε͕υ͔-ζ͔τ͕-ζ͕τ͔)e1576",
    ///     "+(+γ͔φ͕+γ͕φ͔-ε͔σ͕-ε͕σ͔+ζ͔ρ͕+ζ͕ρ͔)e1467",
    ///     "+(-γ͔υ͕-γ͕υ͔+δ͔σ͕+δ͕σ͔-ζ͔π͕-ζ͕π͔)e1475",
    ///     "+(+γ͔τ͕+γ͕τ͔-δ͔ρ͕-δ͕ρ͔+ε͔π͕+ε͕π͔)e1456",
    ///     "+(-β͔φ͕-β͕φ͔+ε͔ο͕+ε͕ο͔-ζ͔ξ͕-ζ͕ξ͔)e1376",
    ///     "+(+β͔υ͕+β͕υ͔-δ͔ο͕-δ͕ο͔+ζ͔ν͕+ζ͕ν͔)e1357",
    ///     "+(-β͔τ͕-β͕τ͔+δ͔ξ͕+δ͕ξ͔-ε͔ν͕-ε͕ν͔)e1365",
    ///     "+(-β͔σ͕-β͕σ͔+γ͔ο͕+γ͕ο͔-ζ͔μ͕-ζ͕μ͔)e1374",
    ///     "+(+β͔ρ͕+β͕ρ͔-γ͔ξ͕-γ͕ξ͔+ε͔μ͕+ε͕μ͔)e1346",
    ///     "+(-β͔π͕-β͕π͔+γ͔ν͕+γ͕ν͔-δ͔μ͕-δ͕μ͔)e1354",
    ///     "+(+α͔φ͕+α͕φ͔-ε͔λ͕-ε͕λ͔+ζ͔κ͕+ζ͕κ͔)e1267",
    ///     "+(-α͔υ͕-α͕υ͔+δ͔λ͕+δ͕λ͔-ζ͔ι͕-ζ͕ι͔)e1275",
    ///     "+(+α͔τ͕+α͕τ͔-δ͔κ͕-δ͕κ͔+ε͔ι͕+ε͕ι͔)e1256",
    ///     "+(+α͔σ͕+α͕σ͔-γ͔λ͕-γ͕λ͔+ζ͔θ͕+ζ͕θ͔)e1247",
    ///     "+(-α͔ρ͕-α͕ρ͔+γ͔κ͕+γ͕κ͔-ε͔θ͕-ε͕θ͔)e1264",
    ///     "+(+α͔π͕+α͕π͔-γ͔ι͕-γ͕ι͔+δ͔θ͕+δ͕θ͔)e1245",
    ///     "+(-α͔ο͕-α͕ο͔+β͔λ͕+β͕λ͔-ζ͔η͕-ζ͕η͔)e1273",
    ///     "+(+α͔ξ͕+α͕ξ͔-β͔κ͕-β͕κ͔+ε͔η͕+ε͕η͔)e1236",
    ///     "+(-α͔ν͕-α͕ν͔+β͔ι͕+β͕ι͔-δ͔η͕-δ͕η͔)e1253",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_double_motor() -> Self {
        Self::scalar() + Self::volume5() + Self::volume()
    }
    /// The multivector of double motor $`m_2 \equiv s + v^5 + v + \ell_\infty`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP7 as Vee};
    ///
    /// let double_motor = Vee::plane().lhs() * Vee::plane().rhs();
    ///
    /// assert_eq!(double_motor.basis_blades(), Vee::double_motor().basis_blades());
    /// format_eq!(double_motor, [
    ///     "+α͔α͕+β͔β͕+γ͔γ͕+δ͔δ͕+ε͔ε͕+ζ͔ζ͕+η͔η͕+θ͔θ͕+ι͔ι͕+κ͔κ͕+λ͔λ͕+μ͔μ͕+ν͔ν͕+ξ͔ξ͕+ο͔ο͕+π͔π͕+ρ͔ρ͕+σ͔σ͕+τ͔τ͕+υ͔υ͕+φ͔φ͕",
    ///     "+(-A͔η͕+A͕η͔-B͔θ͕+B͕θ͔-C͔ι͕+C͕ι͔-D͔κ͕+D͕κ͔-E͔λ͕+E͕λ͔-F͔μ͕+F͕μ͔-G͔ν͕+G͕ν͔-H͔ξ͕\
    ///        +H͕ξ͔-I͔ο͕+I͕ο͔-J͔π͕+J͕π͔-K͔ρ͕+K͕ρ͔-L͔σ͕+L͕σ͔-M͔τ͕+M͕τ͔-N͔υ͕+N͕υ͔-O͔φ͕+O͕φ͔)e01",
    ///     "+(+A͔β͕-A͕β͔+B͔γ͕-B͕γ͔+C͔δ͕-C͕δ͔+D͔ε͕-D͕ε͔+E͔ζ͕-E͕ζ͔-P͔μ͕+P͕μ͔-Q͔ν͕+Q͕ν͔-R͔ξ͕\
    ///        +R͕ξ͔-S͔ο͕+S͕ο͔-T͔π͕+T͕π͔-U͔ρ͕+U͕ρ͔-Á͔σ͕+Á͕σ͔-Ä͔τ͕+Ä͕τ͔-Å͔υ͕+Å͕υ͔-Æ͔φ͕+Æ͕φ͔)e02",
    ///     "+(-A͔α͕+A͕α͔+F͔γ͕-F͕γ͔+G͔δ͕-G͕δ͔+H͔ε͕-H͕ε͔+I͔ζ͕-I͕ζ͔+P͔θ͕-P͕θ͔+Q͔ι͕-Q͕ι͔+R͔κ͕\
    ///        -R͕κ͔+S͔λ͕-S͕λ͔-Ç͔π͕+Ç͕π͔-É͔ρ͕+É͕ρ͔-Ë͔σ͕+Ë͕σ͔-Í͔τ͕+Í͕τ͔-Ï͔υ͕+Ï͕υ͔-Ñ͔φ͕+Ñ͕φ͔)e03",
    ///     "+(-B͔α͕+B͕α͔-F͔β͕+F͕β͔+J͔δ͕-J͕δ͔+K͔ε͕-K͕ε͔+L͔ζ͕-L͕ζ͔-P͔η͕+P͕η͔+T͔ι͕-T͕ι͔+U͔κ͕\
    ///        -U͕κ͔+Á͔λ͕-Á͕λ͔+Ç͔ν͕-Ç͕ν͔+É͔ξ͕-É͕ξ͔+Ë͔ο͕-Ë͕ο͔-Ó͔τ͕+Ó͕τ͔-Ö͔υ͕+Ö͕υ͔-Ú͔φ͕+Ú͕φ͔)e04",
    ///     "+(-C͔α͕+C͕α͔-G͔β͕+G͕β͔-J͔γ͕+J͕γ͔+M͔ε͕-M͕ε͔+N͔ζ͕-N͕ζ͔-Q͔η͕+Q͕η͔-T͔θ͕+T͕θ͔+Ä͔κ͕\
    ///        -Ä͕κ͔+Å͔λ͕-Å͕λ͔-Ç͔μ͕+Ç͕μ͔+Í͔ξ͕-Í͕ξ͔+Ï͔ο͕-Ï͕ο͔+Ó͔ρ͕-Ó͕ρ͔+Ö͔σ͕-Ö͕σ͔-Ü͔φ͕+Ü͕φ͔)e05",
    ///     "+(-D͔α͕+D͕α͔-H͔β͕+H͕β͔-K͔γ͕+K͕γ͔-M͔δ͕+M͕δ͔+O͔ζ͕-O͕ζ͔-R͔η͕+R͕η͔-U͔θ͕+U͕θ͔-Ä͔ι͕\
    ///        +Ä͕ι͔+Æ͔λ͕-Æ͕λ͔-É͔μ͕+É͕μ͔-Í͔ν͕+Í͕ν͔+Ñ͔ο͕-Ñ͕ο͔-Ó͔π͕+Ó͕π͔+Ú͔σ͕-Ú͕σ͔+Ü͔υ͕-Ü͕υ͔)e06",
    ///     "+(-E͔α͕+E͕α͔-I͔β͕+I͕β͔-L͔γ͕+L͕γ͔-N͔δ͕+N͕δ͔-O͔ε͕+O͕ε͔-S͔η͕+S͕η͔-Á͔θ͕+Á͕θ͔-Å͔ι͕\
    ///        +Å͕ι͔-Æ͔κ͕+Æ͕κ͔-Ë͔μ͕+Ë͕μ͔-Ï͔ν͕+Ï͕ν͔-Ñ͔ξ͕+Ñ͕ξ͔-Ö͔π͕+Ö͕π͔-Ú͔ρ͕+Ú͕ρ͔-Ü͔τ͕+Ü͕τ͔)e07",
    ///     "+(+β͔η͕-β͕η͔+γ͔θ͕-γ͕θ͔+δ͔ι͕-δ͕ι͔+ε͔κ͕-ε͕κ͔+ζ͔λ͕-ζ͕λ͔)e12",
    ///     "+(-α͔η͕+α͕η͔+γ͔μ͕-γ͕μ͔+δ͔ν͕-δ͕ν͔+ε͔ξ͕-ε͕ξ͔+ζ͔ο͕-ζ͕ο͔)e13",
    ///     "+(-α͔θ͕+α͕θ͔-β͔μ͕+β͕μ͔+δ͔π͕-δ͕π͔+ε͔ρ͕-ε͕ρ͔+ζ͔σ͕-ζ͕σ͔)e14",
    ///     "+(-α͔ι͕+α͕ι͔-β͔ν͕+β͕ν͔-γ͔π͕+γ͕π͔+ε͔τ͕-ε͕τ͔+ζ͔υ͕-ζ͕υ͔)e15",
    ///     "+(-α͔κ͕+α͕κ͔-β͔ξ͕+β͕ξ͔-γ͔ρ͕+γ͕ρ͔-δ͔τ͕+δ͕τ͔+ζ͔φ͕-ζ͕φ͔)e16",
    ///     "+(-α͔λ͕+α͕λ͔-β͔ο͕+β͕ο͔-γ͔σ͕+γ͕σ͔-δ͔υ͕+δ͕υ͔-ε͔φ͕+ε͕φ͔)e17",
    ///     "+(+α͔β͕-α͕β͔+θ͔μ͕-θ͕μ͔+ι͔ν͕-ι͕ν͔+κ͔ξ͕-κ͕ξ͔+λ͔ο͕-λ͕ο͔)e23",
    ///     "+(+α͔γ͕-α͕γ͔-η͔μ͕+η͕μ͔+ι͔π͕-ι͕π͔+κ͔ρ͕-κ͕ρ͔+λ͔σ͕-λ͕σ͔)e24",
    ///     "+(+α͔δ͕-α͕δ͔-η͔ν͕+η͕ν͔-θ͔π͕+θ͕π͔+κ͔τ͕-κ͕τ͔+λ͔υ͕-λ͕υ͔)e25",
    ///     "+(+α͔ε͕-α͕ε͔-η͔ξ͕+η͕ξ͔-θ͔ρ͕+θ͕ρ͔-ι͔τ͕+ι͕τ͔+λ͔φ͕-λ͕φ͔)e26",
    ///     "+(+α͔ζ͕-α͕ζ͔-η͔ο͕+η͕ο͔-θ͔σ͕+θ͕σ͔-ι͔υ͕+ι͕υ͔-κ͔φ͕+κ͕φ͔)e27",
    ///     "+(+β͔γ͕-β͕γ͔+η͔θ͕-η͕θ͔+ν͔π͕-ν͕π͔+ξ͔ρ͕-ξ͕ρ͔+ο͔σ͕-ο͕σ͔)e34",
    ///     "+(+β͔δ͕-β͕δ͔+η͔ι͕-η͕ι͔-μ͔π͕+μ͕π͔+ξ͔τ͕-ξ͕τ͔+ο͔υ͕-ο͕υ͔)e35",
    ///     "+(+β͔ε͕-β͕ε͔+η͔κ͕-η͕κ͔-μ͔ρ͕+μ͕ρ͔-ν͔τ͕+ν͕τ͔+ο͔φ͕-ο͕φ͔)e36",
    ///     "+(+β͔ζ͕-β͕ζ͔+η͔λ͕-η͕λ͔-μ͔σ͕+μ͕σ͔-ν͔υ͕+ν͕υ͔-ξ͔φ͕+ξ͕φ͔)e37",
    ///     "+(+γ͔δ͕-γ͕δ͔+θ͔ι͕-θ͕ι͔+μ͔ν͕-μ͕ν͔+ρ͔τ͕-ρ͕τ͔+σ͔υ͕-σ͕υ͔)e45",
    ///     "+(+γ͔ε͕-γ͕ε͔+θ͔κ͕-θ͕κ͔+μ͔ξ͕-μ͕ξ͔-π͔τ͕+π͕τ͔+σ͔φ͕-σ͕φ͔)e46",
    ///     "+(+γ͔ζ͕-γ͕ζ͔+θ͔λ͕-θ͕λ͔+μ͔ο͕-μ͕ο͔-π͔υ͕+π͕υ͔-ρ͔φ͕+ρ͕φ͔)e47",
    ///     "+(+δ͔ε͕-δ͕ε͔+ι͔κ͕-ι͕κ͔+ν͔ξ͕-ν͕ξ͔+π͔ρ͕-π͕ρ͔+υ͔φ͕-υ͕φ͔)e56",
    ///     "+(+δ͔ζ͕-δ͕ζ͔+ι͔λ͕-ι͕λ͔+ν͔ο͕-ν͕ο͔+π͔σ͕-π͕σ͔-τ͔φ͕+τ͕φ͔)e57",
    ///     "+(+ε͔ζ͕-ε͕ζ͔+κ͔λ͕-κ͕λ͔+ξ͔ο͕-ξ͕ο͔+ρ͔σ͕-ρ͕σ͔+τ͔υ͕-τ͕υ͔)e67",
    ///     "+(-α͔μ͕-α͕μ͔+β͔θ͕+β͕θ͔-γ͔η͕-γ͕η͔)e1234",
    ///     "+(-B͔μ͕-B͕μ͔-C͔ν͕-C͕ν͔-D͔ξ͕-D͕ξ͔-E͔ο͕-E͕ο͔+F͔θ͕+F͕θ͔+G͔ι͕+G͕ι͔+H͔κ͕+H͕κ͔+I͔λ͕+I͕λ͔-P͔γ͕-P͕γ͔-Q͔δ͕-Q͕δ͔-R͔ε͕-R͕ε͔-S͔ζ͕-S͕ζ͔)e0123",
    ///     "+(+A͔μ͕+A͕μ͔-C͔π͕-C͕π͔-D͔ρ͕-D͕ρ͔-E͔σ͕-E͕σ͔-F͔η͕-F͕η͔+J͔ι͕+J͕ι͔+K͔κ͕+K͕κ͔+L͔λ͕+L͕λ͔+P͔β͕+P͕β͔-T͔δ͕-T͕δ͔-U͔ε͕-U͕ε͔-Á͔ζ͕-Á͕ζ͔)e0124",
    ///     "+(+A͔ν͕+A͕ν͔+B͔π͕+B͕π͔-D͔τ͕-D͕τ͔-E͔υ͕-E͕υ͔-G͔η͕-G͕η͔-J͔θ͕-J͕θ͔+M͔κ͕+M͕κ͔+N͔λ͕+N͕λ͔+Q͔β͕+Q͕β͔+T͔γ͕+T͕γ͔-Ä͔ε͕-Ä͕ε͔-Å͔ζ͕-Å͕ζ͔)e0125",
    ///     "+(+A͔ξ͕+A͕ξ͔+B͔ρ͕+B͕ρ͔+C͔τ͕+C͕τ͔-E͔φ͕-E͕φ͔-H͔η͕-H͕η͔-K͔θ͕-K͕θ͔-M͔ι͕-M͕ι͔+O͔λ͕+O͕λ͔+R͔β͕+R͕β͔+U͔γ͕+U͕γ͔+Ä͔δ͕+Ä͕δ͔-Æ͔ζ͕-Æ͕ζ͔)e0126",
    ///     "+(+A͔ο͕+A͕ο͔+B͔σ͕+B͕σ͔+C͔υ͕+C͕υ͔+D͔φ͕+D͕φ͔-I͔η͕-I͕η͔-L͔θ͕-L͕θ͔-N͔ι͕-N͕ι͔-O͔κ͕-O͕κ͔+S͔β͕+S͕β͔+Á͔γ͕+Á͕γ͔+Å͔δ͕+Å͕δ͔+Æ͔ε͕+Æ͕ε͔)e0127",
    ///     "+(-A͔θ͕-A͕θ͔+B͔η͕+B͕η͔-G͔π͕-G͕π͔-H͔ρ͕-H͕ρ͔-I͔σ͕-I͕σ͔+J͔ν͕+J͕ν͔+K͔ξ͕+K͕ξ͔+L͔ο͕+L͕ο͔-P͔α͕-P͕α͔-Ç͔δ͕-Ç͕δ͔-É͔ε͕-É͕ε͔-Ë͔ζ͕-Ë͕ζ͔)e0134",
    ///     "+(-A͔ι͕-A͕ι͔+C͔η͕+C͕η͔+F͔π͕+F͕π͔-H͔τ͕-H͕τ͔-I͔υ͕-I͕υ͔-J͔μ͕-J͕μ͔+M͔ξ͕+M͕ξ͔+N͔ο͕+N͕ο͔-Q͔α͕-Q͕α͔+Ç͔γ͕+Ç͕γ͔-Í͔ε͕-Í͕ε͔-Ï͔ζ͕-Ï͕ζ͔)e0135",
    ///     "+(-A͔κ͕-A͕κ͔+D͔η͕+D͕η͔+F͔ρ͕+F͕ρ͔+G͔τ͕+G͕τ͔-I͔φ͕-I͕φ͔-K͔μ͕-K͕μ͔-M͔ν͕-M͕ν͔+O͔ο͕+O͕ο͔-R͔α͕-R͕α͔+É͔γ͕+É͕γ͔+Í͔δ͕+Í͕δ͔-Ñ͔ζ͕-Ñ͕ζ͔)e0136",
    ///     "+(-A͔λ͕-A͕λ͔+E͔η͕+E͕η͔+F͔σ͕+F͕σ͔+G͔υ͕+G͕υ͔+H͔φ͕+H͕φ͔-L͔μ͕-L͕μ͔-N͔ν͕-N͕ν͔-O͔ξ͕-O͕ξ͔-S͔α͕-S͕α͔+Ë͔γ͕+Ë͕γ͔+Ï͔δ͕+Ï͕δ͔+Ñ͔ε͕+Ñ͕ε͔)e0137",
    ///     "+(-B͔ι͕-B͕ι͔+C͔θ͕+C͕θ͔-F͔ν͕-F͕ν͔+G͔μ͕+G͕μ͔-K͔τ͕-K͕τ͔-L͔υ͕-L͕υ͔+M͔ρ͕+M͕ρ͔+N͔σ͕+N͕σ͔-T͔α͕-T͕α͔-Ç͔β͕-Ç͕β͔-Ó͔ε͕-Ó͕ε͔-Ö͔ζ͕-Ö͕ζ͔)e0145",
    ///     "+(-B͔κ͕-B͕κ͔+D͔θ͕+D͕θ͔-F͔ξ͕-F͕ξ͔+H͔μ͕+H͕μ͔+J͔τ͕+J͕τ͔-L͔φ͕-L͕φ͔-M͔π͕-M͕π͔+O͔σ͕+O͕σ͔-U͔α͕-U͕α͔-É͔β͕-É͕β͔+Ó͔δ͕+Ó͕δ͔-Ú͔ζ͕-Ú͕ζ͔)e0146",
    ///     "+(-B͔λ͕-B͕λ͔+E͔θ͕+E͕θ͔-F͔ο͕-F͕ο͔+I͔μ͕+I͕μ͔+J͔υ͕+J͕υ͔+K͔φ͕+K͕φ͔-N͔π͕-N͕π͔-O͔ρ͕-O͕ρ͔-Á͔α͕-Á͕α͔-Ë͔β͕-Ë͕β͔+Ö͔δ͕+Ö͕δ͔+Ú͔ε͕+Ú͕ε͔)e0147",
    ///     "+(-C͔κ͕-C͕κ͔+D͔ι͕+D͕ι͔-G͔ξ͕-G͕ξ͔+H͔ν͕+H͕ν͔-J͔ρ͕-J͕ρ͔+K͔π͕+K͕π͔-N͔φ͕-N͕φ͔+O͔υ͕+O͕υ͔-Ä͔α͕-Ä͕α͔-Í͔β͕-Í͕β͔-Ó͔γ͕-Ó͕γ͔-Ü͔ζ͕-Ü͕ζ͔)e0156",
    ///     "+(-C͔λ͕-C͕λ͔+E͔ι͕+E͕ι͔-G͔ο͕-G͕ο͔+I͔ν͕+I͕ν͔-J͔σ͕-J͕σ͔+L͔π͕+L͕π͔+M͔φ͕+M͕φ͔-O͔τ͕-O͕τ͔-Å͔α͕-Å͕α͔-Ï͔β͕-Ï͕β͔-Ö͔γ͕-Ö͕γ͔+Ü͔ε͕+Ü͕ε͔)e0157",
    ///     "+(-D͔λ͕-D͕λ͔+E͔κ͕+E͕κ͔-H͔ο͕-H͕ο͔+I͔ξ͕+I͕ξ͔-K͔σ͕-K͕σ͔+L͔ρ͕+L͕ρ͔-M͔υ͕-M͕υ͔+N͔τ͕+N͕τ͔-Æ͔α͕-Æ͕α͔-Ñ͔β͕-Ñ͕β͔-Ú͔γ͕-Ú͕γ͔-Ü͔δ͕-Ü͕δ͔)e0167",
    ///     "+(+A͔γ͕+A͕γ͔-B͔β͕-B͕β͔+F͔α͕+F͕α͔-Q͔π͕-Q͕π͔-R͔ρ͕-R͕ρ͔-S͔σ͕-S͕σ͔+T͔ν͕+T͕ν͔+U͔ξ͕+U͕ξ͔+Á͔ο͕+Á͕ο͔-Ç͔ι͕-Ç͕ι͔-É͔κ͕-É͕κ͔-Ë͔λ͕-Ë͕λ͔)e0234",
    ///     "+(+A͔δ͕+A͕δ͔-C͔β͕-C͕β͔+G͔α͕+G͕α͔+P͔π͕+P͕π͔-R͔τ͕-R͕τ͔-S͔υ͕-S͕υ͔-T͔μ͕-T͕μ͔+Ä͔ξ͕+Ä͕ξ͔+Å͔ο͕+Å͕ο͔+Ç͔θ͕+Ç͕θ͔-Í͔κ͕-Í͕κ͔-Ï͔λ͕-Ï͕λ͔)e0235",
    ///     "+(+A͔ε͕+A͕ε͔-D͔β͕-D͕β͔+H͔α͕+H͕α͔+P͔ρ͕+P͕ρ͔+Q͔τ͕+Q͕τ͔-S͔φ͕-S͕φ͔-U͔μ͕-U͕μ͔-Ä͔ν͕-Ä͕ν͔+Æ͔ο͕+Æ͕ο͔+É͔θ͕+É͕θ͔+Í͔ι͕+Í͕ι͔-Ñ͔λ͕-Ñ͕λ͔)e0236",
    ///     "+(+A͔ζ͕+A͕ζ͔-E͔β͕-E͕β͔+I͔α͕+I͕α͔+P͔σ͕+P͕σ͔+Q͔υ͕+Q͕υ͔+R͔φ͕+R͕φ͔-Á͔μ͕-Á͕μ͔-Å͔ν͕-Å͕ν͔-Æ͔ξ͕-Æ͕ξ͔+Ë͔θ͕+Ë͕θ͔+Ï͔ι͕+Ï͕ι͔+Ñ͔κ͕+Ñ͕κ͔)e0237",
    ///     "+(+B͔δ͕+B͕δ͔-C͔γ͕-C͕γ͔+J͔α͕+J͕α͔-P͔ν͕-P͕ν͔+Q͔μ͕+Q͕μ͔-U͔τ͕-U͕τ͔-Á͔υ͕-Á͕υ͔+Ä͔ρ͕+Ä͕ρ͔+Å͔σ͕+Å͕σ͔-Ç͔η͕-Ç͕η͔-Ó͔κ͕-Ó͕κ͔-Ö͔λ͕-Ö͕λ͔)e0245",
    ///     "+(+B͔ε͕+B͕ε͔-D͔γ͕-D͕γ͔+K͔α͕+K͕α͔-P͔ξ͕-P͕ξ͔+R͔μ͕+R͕μ͔+T͔τ͕+T͕τ͔-Á͔φ͕-Á͕φ͔-Ä͔π͕-Ä͕π͔+Æ͔σ͕+Æ͕σ͔-É͔η͕-É͕η͔+Ó͔ι͕+Ó͕ι͔-Ú͔λ͕-Ú͕λ͔)e0246",
    ///     "+(+B͔ζ͕+B͕ζ͔-E͔γ͕-E͕γ͔+L͔α͕+L͕α͔-P͔ο͕-P͕ο͔+S͔μ͕+S͕μ͔+T͔υ͕+T͕υ͔+U͔φ͕+U͕φ͔-Å͔π͕-Å͕π͔-Æ͔ρ͕-Æ͕ρ͔-Ë͔η͕-Ë͕η͔+Ö͔ι͕+Ö͕ι͔+Ú͔κ͕+Ú͕κ͔)e0247",
    ///     "+(+C͔ε͕+C͕ε͔-D͔δ͕-D͕δ͔+M͔α͕+M͕α͔-Q͔ξ͕-Q͕ξ͔+R͔ν͕+R͕ν͔-T͔ρ͕-T͕ρ͔+U͔π͕+U͕π͔-Å͔φ͕-Å͕φ͔+Æ͔υ͕+Æ͕υ͔-Í͔η͕-Í͕η͔-Ó͔θ͕-Ó͕θ͔-Ü͔λ͕-Ü͕λ͔)e0256",
    ///     "+(+C͔ζ͕+C͕ζ͔-E͔δ͕-E͕δ͔+N͔α͕+N͕α͔-Q͔ο͕-Q͕ο͔+S͔ν͕+S͕ν͔-T͔σ͕-T͕σ͔+Á͔π͕+Á͕π͔+Ä͔φ͕+Ä͕φ͔-Æ͔τ͕-Æ͕τ͔-Ï͔η͕-Ï͕η͔-Ö͔θ͕-Ö͕θ͔+Ü͔κ͕+Ü͕κ͔)e0257",
    ///     "+(+D͔ζ͕+D͕ζ͔-E͔ε͕-E͕ε͔+O͔α͕+O͕α͔-R͔ο͕-R͕ο͔+S͔ξ͕+S͕ξ͔-U͔σ͕-U͕σ͔+Á͔ρ͕+Á͕ρ͔-Ä͔υ͕-Ä͕υ͔+Å͔τ͕+Å͕τ͔-Ñ͔η͕-Ñ͕η͔-Ú͔θ͕-Ú͕θ͔-Ü͔ι͕-Ü͕ι͔)e0267",
    ///     "+(+F͔δ͕+F͕δ͔-G͔γ͕-G͕γ͔+J͔β͕+J͕β͔+P͔ι͕+P͕ι͔-Q͔θ͕-Q͕θ͔+T͔η͕+T͕η͔-É͔τ͕-É͕τ͔-Ë͔υ͕-Ë͕υ͔+Í͔ρ͕+Í͕ρ͔+Ï͔σ͕+Ï͕σ͔-Ó͔ξ͕-Ó͕ξ͔-Ö͔ο͕-Ö͕ο͔)e0345",
    ///     "+(+F͔ε͕+F͕ε͔-H͔γ͕-H͕γ͔+K͔β͕+K͕β͔+P͔κ͕+P͕κ͔-R͔θ͕-R͕θ͔+U͔η͕+U͕η͔+Ç͔τ͕+Ç͕τ͔-Ë͔φ͕-Ë͕φ͔-Í͔π͕-Í͕π͔+Ñ͔σ͕+Ñ͕σ͔+Ó͔ν͕+Ó͕ν͔-Ú͔ο͕-Ú͕ο͔)e0346",
    ///     "+(+F͔ζ͕+F͕ζ͔-I͔γ͕-I͕γ͔+L͔β͕+L͕β͔+P͔λ͕+P͕λ͔-S͔θ͕-S͕θ͔+Á͔η͕+Á͕η͔+Ç͔υ͕+Ç͕υ͔+É͔φ͕+É͕φ͔-Ï͔π͕-Ï͕π͔-Ñ͔ρ͕-Ñ͕ρ͔+Ö͔ν͕+Ö͕ν͔+Ú͔ξ͕+Ú͕ξ͔)e0347",
    ///     "+(+G͔ε͕+G͕ε͔-H͔δ͕-H͕δ͔+M͔β͕+M͕β͔+Q͔κ͕+Q͕κ͔-R͔ι͕-R͕ι͔+Ä͔η͕+Ä͕η͔-Ç͔ρ͕-Ç͕ρ͔+É͔π͕+É͕π͔-Ï͔φ͕-Ï͕φ͔+Ñ͔υ͕+Ñ͕υ͔-Ó͔μ͕-Ó͕μ͔-Ü͔ο͕-Ü͕ο͔)e0356",
    ///     "+(+G͔ζ͕+G͕ζ͔-I͔δ͕-I͕δ͔+N͔β͕+N͕β͔+Q͔λ͕+Q͕λ͔-S͔ι͕-S͕ι͔+Å͔η͕+Å͕η͔-Ç͔σ͕-Ç͕σ͔+Ë͔π͕+Ë͕π͔+Í͔φ͕+Í͕φ͔-Ñ͔τ͕-Ñ͕τ͔-Ö͔μ͕-Ö͕μ͔+Ü͔ξ͕+Ü͕ξ͔)e0357",
    ///     "+(+H͔ζ͕+H͕ζ͔-I͔ε͕-I͕ε͔+O͔β͕+O͕β͔+R͔λ͕+R͕λ͔-S͔κ͕-S͕κ͔+Æ͔η͕+Æ͕η͔-É͔σ͕-É͕σ͔+Ë͔ρ͕+Ë͕ρ͔-Í͔υ͕-Í͕υ͔+Ï͔τ͕+Ï͕τ͔-Ú͔μ͕-Ú͕μ͔-Ü͔ν͕-Ü͕ν͔)e0367",
    ///     "+(+J͔ε͕+J͕ε͔-K͔δ͕-K͕δ͔+M͔γ͕+M͕γ͔+T͔κ͕+T͕κ͔-U͔ι͕-U͕ι͔+Ä͔θ͕+Ä͕θ͔+Ç͔ξ͕+Ç͕ξ͔-É͔ν͕-É͕ν͔+Í͔μ͕+Í͕μ͔-Ö͔φ͕-Ö͕φ͔+Ú͔υ͕+Ú͕υ͔-Ü͔σ͕-Ü͕σ͔)e0456",
    ///     "+(+J͔ζ͕+J͕ζ͔-L͔δ͕-L͕δ͔+N͔γ͕+N͕γ͔+T͔λ͕+T͕λ͔-Á͔ι͕-Á͕ι͔+Å͔θ͕+Å͕θ͔+Ç͔ο͕+Ç͕ο͔-Ë͔ν͕-Ë͕ν͔+Ï͔μ͕+Ï͕μ͔+Ó͔φ͕+Ó͕φ͔-Ú͔τ͕-Ú͕τ͔+Ü͔ρ͕+Ü͕ρ͔)e0457",
    ///     "+(+K͔ζ͕+K͕ζ͔-L͔ε͕-L͕ε͔+O͔γ͕+O͕γ͔+U͔λ͕+U͕λ͔-Á͔κ͕-Á͕κ͔+Æ͔θ͕+Æ͕θ͔+É͔ο͕+É͕ο͔-Ë͔ξ͕-Ë͕ξ͔+Ñ͔μ͕+Ñ͕μ͔-Ó͔υ͕-Ó͕υ͔+Ö͔τ͕+Ö͕τ͔-Ü͔π͕-Ü͕π͔)e0467",
    ///     "+(+M͔ζ͕+M͕ζ͔-N͔ε͕-N͕ε͔+O͔δ͕+O͕δ͔+Ä͔λ͕+Ä͕λ͔-Å͔κ͕-Å͕κ͔+Æ͔ι͕+Æ͕ι͔+Í͔ο͕+Í͕ο͔-Ï͔ξ͕-Ï͕ξ͔+Ñ͔ν͕+Ñ͕ν͔+Ó͔σ͕+Ó͕σ͔-Ö͔ρ͕-Ö͕ρ͔+Ú͔π͕+Ú͕π͔)e0567",
    ///     "+(-π͔φ͕-π͕φ͔+ρ͔υ͕+ρ͕υ͔-σ͔τ͕-σ͕τ͔)e4567",
    ///     "+(+ν͔φ͕+ν͕φ͔-ξ͔υ͕-ξ͕υ͔+ο͔τ͕+ο͕τ͔)e3576",
    ///     "+(-μ͔φ͕-μ͕φ͔+ξ͔σ͕+ξ͕σ͔-ο͔ρ͕-ο͕ρ͔)e3467",
    ///     "+(+μ͔υ͕+μ͕υ͔-ν͔σ͕-ν͕σ͔+ο͔π͕+ο͕π͔)e3475",
    ///     "+(-μ͔τ͕-μ͕τ͔+ν͔ρ͕+ν͕ρ͔-ξ͔π͕-ξ͕π͔)e3456",
    ///     "+(-ι͔φ͕-ι͕φ͔+κ͔υ͕+κ͕υ͔-λ͔τ͕-λ͕τ͔)e2567",
    ///     "+(+θ͔φ͕+θ͕φ͔-κ͔σ͕-κ͕σ͔+λ͔ρ͕+λ͕ρ͔)e2476",
    ///     "+(-θ͔υ͕-θ͕υ͔+ι͔σ͕+ι͕σ͔-λ͔π͕-λ͕π͔)e2457",
    ///     "+(+θ͔τ͕+θ͕τ͔-ι͔ρ͕-ι͕ρ͔+κ͔π͕+κ͕π͔)e2465",
    ///     "+(-η͔φ͕-η͕φ͔+κ͔ο͕+κ͕ο͔-λ͔ξ͕-λ͕ξ͔)e2367",
    ///     "+(+η͔υ͕+η͕υ͔-ι͔ο͕-ι͕ο͔+λ͔ν͕+λ͕ν͔)e2375",
    ///     "+(-η͔τ͕-η͕τ͔+ι͔ξ͕+ι͕ξ͔-κ͔ν͕-κ͕ν͔)e2356",
    ///     "+(-η͔σ͕-η͕σ͔+θ͔ο͕+θ͕ο͔-λ͔μ͕-λ͕μ͔)e2347",
    ///     "+(+η͔ρ͕+η͕ρ͔-θ͔ξ͕-θ͕ξ͔+κ͔μ͕+κ͕μ͔)e2364",
    ///     "+(-η͔π͕-η͕π͔+θ͔ν͕+θ͕ν͔-ι͔μ͕-ι͕μ͔)e2345",
    ///     "+(+δ͔φ͕+δ͕φ͔-ε͔υ͕-ε͕υ͔+ζ͔τ͕+ζ͕τ͔)e1576",
    ///     "+(-γ͔φ͕-γ͕φ͔+ε͔σ͕+ε͕σ͔-ζ͔ρ͕-ζ͕ρ͔)e1467",
    ///     "+(+γ͔υ͕+γ͕υ͔-δ͔σ͕-δ͕σ͔+ζ͔π͕+ζ͕π͔)e1475",
    ///     "+(-γ͔τ͕-γ͕τ͔+δ͔ρ͕+δ͕ρ͔-ε͔π͕-ε͕π͔)e1456",
    ///     "+(+β͔φ͕+β͕φ͔-ε͔ο͕-ε͕ο͔+ζ͔ξ͕+ζ͕ξ͔)e1376",
    ///     "+(-β͔υ͕-β͕υ͔+δ͔ο͕+δ͕ο͔-ζ͔ν͕-ζ͕ν͔)e1357",
    ///     "+(+β͔τ͕+β͕τ͔-δ͔ξ͕-δ͕ξ͔+ε͔ν͕+ε͕ν͔)e1365",
    ///     "+(+β͔σ͕+β͕σ͔-γ͔ο͕-γ͕ο͔+ζ͔μ͕+ζ͕μ͔)e1374",
    ///     "+(-β͔ρ͕-β͕ρ͔+γ͔ξ͕+γ͕ξ͔-ε͔μ͕-ε͕μ͔)e1346",
    ///     "+(+β͔π͕+β͕π͔-γ͔ν͕-γ͕ν͔+δ͔μ͕+δ͕μ͔)e1354",
    ///     "+(-α͔φ͕-α͕φ͔+ε͔λ͕+ε͕λ͔-ζ͔κ͕-ζ͕κ͔)e1267",
    ///     "+(+α͔υ͕+α͕υ͔-δ͔λ͕-δ͕λ͔+ζ͔ι͕+ζ͕ι͔)e1275",
    ///     "+(-α͔τ͕-α͕τ͔+δ͔κ͕+δ͕κ͔-ε͔ι͕-ε͕ι͔)e1256",
    ///     "+(-α͔σ͕-α͕σ͔+γ͔λ͕+γ͕λ͔-ζ͔θ͕-ζ͕θ͔)e1247",
    ///     "+(+α͔ρ͕+α͕ρ͔-γ͔κ͕-γ͕κ͔+ε͔θ͕+ε͕θ͔)e1264",
    ///     "+(-α͔π͕-α͕π͔+γ͔ι͕+γ͕ι͔-δ͔θ͕-δ͕θ͔)e1245",
    ///     "+(+α͔ο͕+α͕ο͔-β͔λ͕-β͕λ͔+ζ͔η͕+ζ͕η͔)e1273",
    ///     "+(-α͔ξ͕-α͕ξ͔+β͔κ͕+β͕κ͔-ε͔η͕-ε͕η͔)e1236",
    ///     "+(+α͔ν͕+α͕ν͔-β͔ι͕-β͕ι͔+δ͔η͕+δ͕η͔)e1253",
    ///     "+(+Ç͔φ͕-Ç͕φ͔-É͔υ͕+É͕υ͔+Ë͔τ͕-Ë͕τ͔+Í͔σ͕-Í͕σ͔-Ï͔ρ͕+Ï͕ρ͔+Ñ͔π͕-Ñ͕π͔-Ó͔ο͕+Ó͕ο͔+Ö͔ξ͕-Ö͕ξ͔-Ú͔ν͕+Ú͕ν͔+Ü͔μ͕-Ü͕μ͔)e034567",
    ///     "+(-T͔φ͕+T͕φ͔+U͔υ͕-U͕υ͔-Á͔τ͕+Á͕τ͔-Ä͔σ͕+Ä͕σ͔+Å͔ρ͕-Å͕ρ͔-Æ͔π͕+Æ͕π͔+Ó͔λ͕-Ó͕λ͔-Ö͔κ͕+Ö͕κ͔+Ú͔ι͕-Ú͕ι͔-Ü͔θ͕+Ü͕θ͔)e024576",
    ///     "+(+Q͔φ͕-Q͕φ͔-R͔υ͕+R͕υ͔+S͔τ͕-S͕τ͔+Ä͔ο͕-Ä͕ο͔-Å͔ξ͕+Å͕ξ͔+Æ͔ν͕-Æ͕ν͔-Í͔λ͕+Í͕λ͔+Ï͔κ͕-Ï͕κ͔-Ñ͔ι͕+Ñ͕ι͔+Ü͔η͕-Ü͕η͔)e023567",
    ///     "+(-P͔φ͕+P͕φ͔+R͔σ͕-R͕σ͔-S͔ρ͕+S͕ρ͔-U͔ο͕+U͕ο͔+Á͔ξ͕-Á͕ξ͔-Æ͔μ͕+Æ͕μ͔+É͔λ͕-É͕λ͔-Ë͔κ͕+Ë͕κ͔+Ñ͔θ͕-Ñ͕θ͔-Ú͔η͕+Ú͕η͔)e023476",
    ///     "+(+P͔υ͕-P͕υ͔-Q͔σ͕+Q͕σ͔+S͔π͕-S͕π͔+T͔ο͕-T͕ο͔-Á͔ν͕+Á͕ν͔+Å͔μ͕-Å͕μ͔-Ç͔λ͕+Ç͕λ͔+Ë͔ι͕-Ë͕ι͔-Ï͔θ͕+Ï͕θ͔+Ö͔η͕-Ö͕η͔)e023457",
    ///     "+(-P͔τ͕+P͕τ͔+Q͔ρ͕-Q͕ρ͔-R͔π͕+R͕π͔-T͔ξ͕+T͕ξ͔+U͔ν͕-U͕ν͔-Ä͔μ͕+Ä͕μ͔+Ç͔κ͕-Ç͕κ͔-É͔ι͕+É͕ι͔+Í͔θ͕-Í͕θ͔-Ó͔η͕+Ó͕η͔)e023465",
    ///     "+(+J͔φ͕-J͕φ͔-K͔υ͕+K͕υ͔+L͔τ͕-L͕τ͔+M͔σ͕-M͕σ͔-N͔ρ͕+N͕ρ͔+O͔π͕-O͕π͔-Ó͔ζ͕+Ó͕ζ͔+Ö͔ε͕-Ö͕ε͔-Ú͔δ͕+Ú͕δ͔+Ü͔γ͕-Ü͕γ͔)e014567",
    ///     "+(-G͔φ͕+G͕φ͔+H͔υ͕-H͕υ͔-I͔τ͕+I͕τ͔-M͔ο͕+M͕ο͔+N͔ξ͕-N͕ξ͔-O͔ν͕+O͕ν͔+Í͔ζ͕-Í͕ζ͔-Ï͔ε͕+Ï͕ε͔+Ñ͔δ͕-Ñ͕δ͔-Ü͔β͕+Ü͕β͔)e013576",
    ///     "+(+F͔φ͕-F͕φ͔-H͔σ͕+H͕σ͔+I͔ρ͕-I͕ρ͔+K͔ο͕-K͕ο͔-L͔ξ͕+L͕ξ͔+O͔μ͕-O͕μ͔-É͔ζ͕+É͕ζ͔+Ë͔ε͕-Ë͕ε͔-Ñ͔γ͕+Ñ͕γ͔+Ú͔β͕-Ú͕β͔)e013467",
    ///     "+(-F͔υ͕+F͕υ͔+G͔σ͕-G͕σ͔-I͔π͕+I͕π͔-J͔ο͕+J͕ο͔+L͔ν͕-L͕ν͔-N͔μ͕+N͕μ͔+Ç͔ζ͕-Ç͕ζ͔-Ë͔δ͕+Ë͕δ͔+Ï͔γ͕-Ï͕γ͔-Ö͔β͕+Ö͕β͔)e013475",
    ///     "+(+F͔τ͕-F͕τ͔-G͔ρ͕+G͕ρ͔+H͔π͕-H͕π͔+J͔ξ͕-J͕ξ͔-K͔ν͕+K͕ν͔+M͔μ͕-M͕μ͔-Ç͔ε͕+Ç͕ε͔+É͔δ͕-É͕δ͔-Í͔γ͕+Í͕γ͔+Ó͔β͕-Ó͕β͔)e013456",
    ///     "+(+C͔φ͕-C͕φ͔-D͔υ͕+D͕υ͔+E͔τ͕-E͕τ͔+M͔λ͕-M͕λ͔-N͔κ͕+N͕κ͔+O͔ι͕-O͕ι͔-Ä͔ζ͕+Ä͕ζ͔+Å͔ε͕-Å͕ε͔-Æ͔δ͕+Æ͕δ͔+Ü͔α͕-Ü͕α͔)e012567",
    ///     "+(-B͔φ͕+B͕φ͔+D͔σ͕-D͕σ͔-E͔ρ͕+E͕ρ͔-K͔λ͕+K͕λ͔+L͔κ͕-L͕κ͔-O͔θ͕+O͕θ͔+U͔ζ͕-U͕ζ͔-Á͔ε͕+Á͕ε͔+Æ͔γ͕-Æ͕γ͔-Ú͔α͕+Ú͕α͔)e012476",
    ///     "+(+B͔υ͕-B͕υ͔-C͔σ͕+C͕σ͔+E͔π͕-E͕π͔+J͔λ͕-J͕λ͔-L͔ι͕+L͕ι͔+N͔θ͕-N͕θ͔-T͔ζ͕+T͕ζ͔+Á͔δ͕-Á͕δ͔-Å͔γ͕+Å͕γ͔+Ö͔α͕-Ö͕α͔)e012457",
    ///     "+(-B͔τ͕+B͕τ͔+C͔ρ͕-C͕ρ͔-D͔π͕+D͕π͔-J͔κ͕+J͕κ͔+K͔ι͕-K͕ι͔-M͔θ͕+M͕θ͔+T͔ε͕-T͕ε͔-U͔δ͕+U͕δ͔+Ä͔γ͕-Ä͕γ͔-Ó͔α͕+Ó͕α͔)e012465",
    ///     "+(+A͔φ͕-A͕φ͔-D͔ο͕+D͕ο͔+E͔ξ͕-E͕ξ͔+H͔λ͕-H͕λ͔-I͔κ͕+I͕κ͔+O͔η͕-O͕η͔-R͔ζ͕+R͕ζ͔+S͔ε͕-S͕ε͔-Æ͔β͕+Æ͕β͔+Ñ͔α͕-Ñ͕α͔)e012367",
    ///     "+(-A͔υ͕+A͕υ͔+C͔ο͕-C͕ο͔-E͔ν͕+E͕ν͔-G͔λ͕+G͕λ͔+I͔ι͕-I͕ι͔-N͔η͕+N͕η͔+Q͔ζ͕-Q͕ζ͔-S͔δ͕+S͕δ͔+Å͔β͕-Å͕β͔-Ï͔α͕+Ï͕α͔)e012375",
    ///     "+(+A͔τ͕-A͕τ͔-C͔ξ͕+C͕ξ͔+D͔ν͕-D͕ν͔+G͔κ͕-G͕κ͔-H͔ι͕+H͕ι͔+M͔η͕-M͕η͔-Q͔ε͕+Q͕ε͔+R͔δ͕-R͕δ͔-Ä͔β͕+Ä͕β͔+Í͔α͕-Í͕α͔)e012356",
    ///     "+(+A͔σ͕-A͕σ͔-B͔ο͕+B͕ο͔+E͔μ͕-E͕μ͔+F͔λ͕-F͕λ͔-I͔θ͕+I͕θ͔+L͔η͕-L͕η͔-P͔ζ͕+P͕ζ͔+S͔γ͕-S͕γ͔-Á͔β͕+Á͕β͔+Ë͔α͕-Ë͕α͔)e012347",
    ///     "+(-A͔ρ͕+A͕ρ͔+B͔ξ͕-B͕ξ͔-D͔μ͕+D͕μ͔-F͔κ͕+F͕κ͔+H͔θ͕-H͕θ͔-K͔η͕+K͕η͔+P͔ε͕-P͕ε͔-R͔γ͕+R͕γ͔+U͔β͕-U͕β͔-É͔α͕+É͕α͔)e012364",
    ///     "+(+A͔π͕-A͕π͔-B͔ν͕+B͕ν͔+C͔μ͕-C͕μ͔+F͔ι͕-F͕ι͔-G͔θ͕+G͕θ͔+J͔η͕-J͕η͔-P͔δ͕+P͕δ͔+Q͔γ͕-Q͕γ͔-T͔β͕+T͕β͔+Ç͔α͕-Ç͕α͔)e012345",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_motor() -> Self {
        Self::scalar() + Self::volume5() + Self::volume() + Self::line_moment()
    }
    /// The multivector of double motor $`m_2 \equiv s + v^5 + v + \ell`$.
    ///
    /// ```
    /// use vee::{format_eq, PgaP7 as Vee};
    ///
    /// let simple_triple_motor = Vee::volume4().lhs() * Vee::volume4().rhs();
    ///
    /// assert_eq!(simple_triple_motor.basis_blades(), Vee::simple_triple_motor().basis_blades());
    /// format_eq!(simple_triple_motor, [
    ///     "-a͔a͕-b͔b͕-c͔c͕-d͔d͕-e͔e͕-f͔f͕-g͔g͕-h͔h͕-i͔i͕-j͔j͕-k͔k͕-l͔l͕-m͔m͕-n͔n͕-o͔o͕-p͔p͕-q͔q͕\
    ///      -r͔r͕-s͔s͕-t͔t͕-u͔u͕-á͔á͕-ä͔ä͕-å͔å͕-æ͔æ͕-ç͔ç͕-é͔é͕-ë͔ë͕-í͔í͕-ï͔ï͕-ñ͔ñ͕-ó͔ó͕-ö͔ö͕-ú͔ú͕-ü͔ü͕",
    ///     "+(+a͔Η͕-a͕Η͔+b͔Θ͕-b͕Θ͔+c͔Ι͕-c͕Ι͔+d͔Κ͕-d͕Κ͔+e͔Λ͕-e͕Λ͔+f͔Μ͕-f͕Μ͔+g͔Ν͕-g͕Ν͔+h͔Ξ͕\
    ///        -h͕Ξ͔+i͔Ο͕-i͕Ο͔+j͔Π͕-j͕Π͔+k͔Ρ͕-k͕Ρ͔+l͔Σ͕-l͕Σ͔+m͔Τ͕-m͕Τ͔+n͔Υ͕-n͕Υ͔+o͔Φ͕-o͕Φ͔)e01",
    ///     "+(-a͔Β͕+a͕Β͔-b͔Γ͕+b͕Γ͔-c͔Δ͕+c͕Δ͔-d͔Ε͕+d͕Ε͔-e͔Ζ͕+e͕Ζ͔+p͔Μ͕-p͕Μ͔+q͔Ν͕-q͕Ν͔+r͔Ξ͕\
    ///        -r͕Ξ͔+s͔Ο͕-s͕Ο͔+t͔Π͕-t͕Π͔+u͔Ρ͕-u͕Ρ͔+á͔Σ͕-á͕Σ͔+ä͔Τ͕-ä͕Τ͔+å͔Υ͕-å͕Υ͔+æ͔Φ͕-æ͕Φ͔)e02",
    ///     "+(+a͔Α͕-a͕Α͔-f͔Γ͕+f͕Γ͔-g͔Δ͕+g͕Δ͔-h͔Ε͕+h͕Ε͔-i͔Ζ͕+i͕Ζ͔-p͔Θ͕+p͕Θ͔-q͔Ι͕+q͕Ι͔-r͔Κ͕\
    ///        +r͕Κ͔-s͔Λ͕+s͕Λ͔+ç͔Π͕-ç͕Π͔+é͔Ρ͕-é͕Ρ͔+ë͔Σ͕-ë͕Σ͔+í͔Τ͕-í͕Τ͔+ï͔Υ͕-ï͕Υ͔+ñ͔Φ͕-ñ͕Φ͔)e03",
    ///     "+(+b͔Α͕-b͕Α͔+f͔Β͕-f͕Β͔-j͔Δ͕+j͕Δ͔-k͔Ε͕+k͕Ε͔-l͔Ζ͕+l͕Ζ͔+p͔Η͕-p͕Η͔-t͔Ι͕+t͕Ι͔-u͔Κ͕\
    ///        +u͕Κ͔-á͔Λ͕+á͕Λ͔-ç͔Ν͕+ç͕Ν͔-é͔Ξ͕+é͕Ξ͔-ë͔Ο͕+ë͕Ο͔+ó͔Τ͕-ó͕Τ͔+ö͔Υ͕-ö͕Υ͔+ú͔Φ͕-ú͕Φ͔)e04",
    ///     "+(+c͔Α͕-c͕Α͔+g͔Β͕-g͕Β͔+j͔Γ͕-j͕Γ͔-m͔Ε͕+m͕Ε͔-n͔Ζ͕+n͕Ζ͔+q͔Η͕-q͕Η͔+t͔Θ͕-t͕Θ͔-ä͔Κ͕\
    ///        +ä͕Κ͔-å͔Λ͕+å͕Λ͔+ç͔Μ͕-ç͕Μ͔-í͔Ξ͕+í͕Ξ͔-ï͔Ο͕+ï͕Ο͔-ó͔Ρ͕+ó͕Ρ͔-ö͔Σ͕+ö͕Σ͔+ü͔Φ͕-ü͕Φ͔)e05",
    ///     "+(+d͔Α͕-d͕Α͔+h͔Β͕-h͕Β͔+k͔Γ͕-k͕Γ͔+m͔Δ͕-m͕Δ͔-o͔Ζ͕+o͕Ζ͔+r͔Η͕-r͕Η͔+u͔Θ͕-u͕Θ͔+ä͔Ι͕\
    ///        -ä͕Ι͔-æ͔Λ͕+æ͕Λ͔+é͔Μ͕-é͕Μ͔+í͔Ν͕-í͕Ν͔-ñ͔Ο͕+ñ͕Ο͔+ó͔Π͕-ó͕Π͔-ú͔Σ͕+ú͕Σ͔-ü͔Υ͕+ü͕Υ͔)e06",
    ///     "+(+e͔Α͕-e͕Α͔+i͔Β͕-i͕Β͔+l͔Γ͕-l͕Γ͔+n͔Δ͕-n͕Δ͔+o͔Ε͕-o͕Ε͔+s͔Η͕-s͕Η͔+á͔Θ͕-á͕Θ͔+å͔Ι͕\
    ///        -å͕Ι͔+æ͔Κ͕-æ͕Κ͔+ë͔Μ͕-ë͕Μ͔+ï͔Ν͕-ï͕Ν͔+ñ͔Ξ͕-ñ͕Ξ͔+ö͔Π͕-ö͕Π͔+ú͔Ρ͕-ú͕Ρ͔+ü͔Τ͕-ü͕Τ͔)e07",
    ///     "+(-f͔p͕+f͕p͔-g͔q͕+g͕q͔-h͔r͕+h͕r͔-i͔s͕+i͕s͔-j͔t͕+j͕t͔-k͔u͕+k͕u͔-l͔á͕+l͕á͔-m͔ä͕+m͕ä͔-n͔å͕+n͕å͔-o͔æ͕+o͕æ͔)e12",
    ///     "+(+b͔p͕-b͕p͔+c͔q͕-c͕q͔+d͔r͕-d͕r͔+e͔s͕-e͕s͔-j͔ç͕+j͕ç͔-k͔é͕+k͕é͔-l͔ë͕+l͕ë͔-m͔í͕+m͕í͔-n͔ï͕+n͕ï͔-o͔ñ͕+o͕ñ͔)e13",
    ///     "+(-a͔p͕+a͕p͔+c͔t͕-c͕t͔+d͔u͕-d͕u͔+e͔á͕-e͕á͔+g͔ç͕-g͕ç͔+h͔é͕-h͕é͔+i͔ë͕-i͕ë͔-m͔ó͕+m͕ó͔-n͔ö͕+n͕ö͔-o͔ú͕+o͕ú͔)e14",
    ///     "+(-a͔q͕+a͕q͔-b͔t͕+b͕t͔+d͔ä͕-d͕ä͔+e͔å͕-e͕å͔-f͔ç͕+f͕ç͔+h͔í͕-h͕í͔+i͔ï͕-i͕ï͔+k͔ó͕-k͕ó͔+l͔ö͕-l͕ö͔-o͔ü͕+o͕ü͔)e15",
    ///     "+(-a͔r͕+a͕r͔-b͔u͕+b͕u͔-c͔ä͕+c͕ä͔+e͔æ͕-e͕æ͔-f͔é͕+f͕é͔-g͔í͕+g͕í͔+i͔ñ͕-i͕ñ͔-j͔ó͕+j͕ó͔+l͔ú͕-l͕ú͔+n͔ü͕-n͕ü͔)e16",
    ///     "+(-a͔s͕+a͕s͔-b͔á͕+b͕á͔-c͔å͕+c͕å͔-d͔æ͕+d͕æ͔-f͔ë͕+f͕ë͔-g͔ï͕+g͕ï͔-h͔ñ͕+h͕ñ͔-j͔ö͕+j͕ö͔-k͔ú͕+k͕ú͔-m͔ü͕+m͕ü͔)e17",
    ///     "+(-b͔f͕+b͕f͔-c͔g͕+c͕g͔-d͔h͕+d͕h͔-e͔i͕+e͕i͔-t͔ç͕+t͕ç͔-u͔é͕+u͕é͔-á͔ë͕+á͕ë͔-ä͔í͕+ä͕í͔-å͔ï͕+å͕ï͔-æ͔ñ͕+æ͕ñ͔)e23",
    ///     "+(+a͔f͕-a͕f͔-c͔j͕+c͕j͔-d͔k͕+d͕k͔-e͔l͕+e͕l͔+q͔ç͕-q͕ç͔+r͔é͕-r͕é͔+s͔ë͕-s͕ë͔-ä͔ó͕+ä͕ó͔-å͔ö͕+å͕ö͔-æ͔ú͕+æ͕ú͔)e24",
    ///     "+(+a͔g͕-a͕g͔+b͔j͕-b͕j͔-d͔m͕+d͕m͔-e͔n͕+e͕n͔-p͔ç͕+p͕ç͔+r͔í͕-r͕í͔+s͔ï͕-s͕ï͔+u͔ó͕-u͕ó͔+á͔ö͕-á͕ö͔-æ͔ü͕+æ͕ü͔)e25",
    ///     "+(+a͔h͕-a͕h͔+b͔k͕-b͕k͔+c͔m͕-c͕m͔-e͔o͕+e͕o͔-p͔é͕+p͕é͔-q͔í͕+q͕í͔+s͔ñ͕-s͕ñ͔-t͔ó͕+t͕ó͔+á͔ú͕-á͕ú͔+å͔ü͕-å͕ü͔)e26",
    ///     "+(+a͔i͕-a͕i͔+b͔l͕-b͕l͔+c͔n͕-c͕n͔+d͔o͕-d͕o͔-p͔ë͕+p͕ë͔-q͔ï͕+q͕ï͔-r͔ñ͕+r͕ñ͔-t͔ö͕+t͕ö͔-u͔ú͕+u͕ú͔-ä͔ü͕+ä͕ü͔)e27",
    ///     "+(-a͔b͕+a͕b͔-g͔j͕+g͕j͔-h͔k͕+h͕k͔-i͔l͕+i͕l͔-q͔t͕+q͕t͔-r͔u͕+r͕u͔-s͔á͕+s͕á͔-í͔ó͕+í͕ó͔-ï͔ö͕+ï͕ö͔-ñ͔ú͕+ñ͕ú͔)e34",
    ///     "+(-a͔c͕+a͕c͔+f͔j͕-f͕j͔-h͔m͕+h͕m͔-i͔n͕+i͕n͔+p͔t͕-p͕t͔-r͔ä͕+r͕ä͔-s͔å͕+s͕å͔+é͔ó͕-é͕ó͔+ë͔ö͕-ë͕ö͔-ñ͔ü͕+ñ͕ü͔)e35",
    ///     "+(-a͔d͕+a͕d͔+f͔k͕-f͕k͔+g͔m͕-g͕m͔-i͔o͕+i͕o͔+p͔u͕-p͕u͔+q͔ä͕-q͕ä͔-s͔æ͕+s͕æ͔-ç͔ó͕+ç͕ó͔+ë͔ú͕-ë͕ú͔+ï͔ü͕-ï͕ü͔)e36",
    ///     "+(-a͔e͕+a͕e͔+f͔l͕-f͕l͔+g͔n͕-g͕n͔+h͔o͕-h͕o͔+p͔á͕-p͕á͔+q͔å͕-q͕å͔+r͔æ͕-r͕æ͔-ç͔ö͕+ç͕ö͔-é͔ú͕+é͕ú͔-í͔ü͕+í͕ü͔)e37",
    ///     "+(-b͔c͕+b͕c͔-f͔g͕+f͕g͔-k͔m͕+k͕m͔-l͔n͕+l͕n͔-p͔q͕+p͕q͔-u͔ä͕+u͕ä͔-á͔å͕+á͕å͔-é͔í͕+é͕í͔-ë͔ï͕+ë͕ï͔-ú͔ü͕+ú͕ü͔)e45",
    ///     "+(-b͔d͕+b͕d͔-f͔h͕+f͕h͔+j͔m͕-j͕m͔-l͔o͕+l͕o͔-p͔r͕+p͕r͔+t͔ä͕-t͕ä͔-á͔æ͕+á͕æ͔+ç͔í͕-ç͕í͔-ë͔ñ͕+ë͕ñ͔+ö͔ü͕-ö͕ü͔)e46",
    ///     "+(-b͔e͕+b͕e͔-f͔i͕+f͕i͔+j͔n͕-j͕n͔+k͔o͕-k͕o͔-p͔s͕+p͕s͔+t͔å͕-t͕å͔+u͔æ͕-u͕æ͔+ç͔ï͕-ç͕ï͔+é͔ñ͕-é͕ñ͔-ó͔ü͕+ó͕ü͔)e47",
    ///     "+(-c͔d͕+c͕d͔-g͔h͕+g͕h͔-j͔k͕+j͕k͔-n͔o͕+n͕o͔-q͔r͕+q͕r͔-t͔u͕+t͕u͔-å͔æ͕+å͕æ͔-ç͔é͕+ç͕é͔-ï͔ñ͕+ï͕ñ͔-ö͔ú͕+ö͕ú͔)e56",
    ///     "+(-c͔e͕+c͕e͔-g͔i͕+g͕i͔-j͔l͕+j͕l͔+m͔o͕-m͕o͔-q͔s͕+q͕s͔-t͔á͕+t͕á͔+ä͔æ͕-ä͕æ͔-ç͔ë͕+ç͕ë͔+í͔ñ͕-í͕ñ͔+ó͔ú͕-ó͕ú͔)e57",
    ///     "+(-d͔e͕+d͕e͔-h͔i͕+h͕i͔-k͔l͕+k͕l͔-m͔n͕+m͕n͔-r͔s͕+r͕s͔-u͔á͕+u͕á͔-ä͔å͕+ä͕å͔-é͔ë͕+é͕ë͔-í͔ï͕+í͕ï͔-ó͔ö͕+ó͕ö͔)e67",
    ///     "+(+c͔ç͕+c͕ç͔+d͔é͕+d͕é͔+e͔ë͕+e͕ë͔-g͔t͕-g͕t͔-h͔u͕-h͕u͔-i͔á͕-i͕á͔+j͔q͕+j͕q͔+k͔r͕+k͕r͔+l͔s͕+l͕s͔)e1234",
    ///     "+(+b͔Μ͕+b͕Μ͔+c͔Ν͕+c͕Ν͔+d͔Ξ͕+d͕Ξ͔+e͔Ο͕+e͕Ο͔-f͔Θ͕-f͕Θ͔-g͔Ι͕-g͕Ι͔-h͔Κ͕-h͕Κ͔-i͔Λ͕-i͕Λ͔+p͔Γ͕+p͕Γ͔+q͔Δ͕+q͕Δ͔+r͔Ε͕+r͕Ε͔+s͔Ζ͕+s͕Ζ͔)e0123",
    ///     "+(-a͔Μ͕-a͕Μ͔+c͔Π͕+c͕Π͔+d͔Ρ͕+d͕Ρ͔+e͔Σ͕+e͕Σ͔+f͔Η͕+f͕Η͔-j͔Ι͕-j͕Ι͔-k͔Κ͕-k͕Κ͔-l͔Λ͕-l͕Λ͔-p͔Β͕-p͕Β͔+t͔Δ͕+t͕Δ͔+u͔Ε͕+u͕Ε͔+á͔Ζ͕+á͕Ζ͔)e0124",
    ///     "+(-a͔Ν͕-a͕Ν͔-b͔Π͕-b͕Π͔+d͔Τ͕+d͕Τ͔+e͔Υ͕+e͕Υ͔+g͔Η͕+g͕Η͔+j͔Θ͕+j͕Θ͔-m͔Κ͕-m͕Κ͔-n͔Λ͕-n͕Λ͔-q͔Β͕-q͕Β͔-t͔Γ͕-t͕Γ͔+ä͔Ε͕+ä͕Ε͔+å͔Ζ͕+å͕Ζ͔)e0125",
    ///     "+(-a͔Ξ͕-a͕Ξ͔-b͔Ρ͕-b͕Ρ͔-c͔Τ͕-c͕Τ͔+e͔Φ͕+e͕Φ͔+h͔Η͕+h͕Η͔+k͔Θ͕+k͕Θ͔+m͔Ι͕+m͕Ι͔-o͔Λ͕-o͕Λ͔-r͔Β͕-r͕Β͔-u͔Γ͕-u͕Γ͔-ä͔Δ͕-ä͕Δ͔+æ͔Ζ͕+æ͕Ζ͔)e0126",
    ///     "+(-a͔Ο͕-a͕Ο͔-b͔Σ͕-b͕Σ͔-c͔Υ͕-c͕Υ͔-d͔Φ͕-d͕Φ͔+i͔Η͕+i͕Η͔+l͔Θ͕+l͕Θ͔+n͔Ι͕+n͕Ι͔+o͔Κ͕+o͕Κ͔-s͔Β͕-s͕Β͔-á͔Γ͕-á͕Γ͔-å͔Δ͕-å͕Δ͔-æ͔Ε͕-æ͕Ε͔)e0127",
    ///     "+(+a͔Θ͕+a͕Θ͔-b͔Η͕-b͕Η͔+g͔Π͕+g͕Π͔+h͔Ρ͕+h͕Ρ͔+i͔Σ͕+i͕Σ͔-j͔Ν͕-j͕Ν͔-k͔Ξ͕-k͕Ξ͔-l͔Ο͕-l͕Ο͔+p͔Α͕+p͕Α͔+ç͔Δ͕+ç͕Δ͔+é͔Ε͕+é͕Ε͔+ë͔Ζ͕+ë͕Ζ͔)e0134",
    ///     "+(+a͔Ι͕+a͕Ι͔-c͔Η͕-c͕Η͔-f͔Π͕-f͕Π͔+h͔Τ͕+h͕Τ͔+i͔Υ͕+i͕Υ͔+j͔Μ͕+j͕Μ͔-m͔Ξ͕-m͕Ξ͔-n͔Ο͕-n͕Ο͔+q͔Α͕+q͕Α͔-ç͔Γ͕-ç͕Γ͔+í͔Ε͕+í͕Ε͔+ï͔Ζ͕+ï͕Ζ͔)e0135",
    ///     "+(+a͔Κ͕+a͕Κ͔-d͔Η͕-d͕Η͔-f͔Ρ͕-f͕Ρ͔-g͔Τ͕-g͕Τ͔+i͔Φ͕+i͕Φ͔+k͔Μ͕+k͕Μ͔+m͔Ν͕+m͕Ν͔-o͔Ο͕-o͕Ο͔+r͔Α͕+r͕Α͔-é͔Γ͕-é͕Γ͔-í͔Δ͕-í͕Δ͔+ñ͔Ζ͕+ñ͕Ζ͔)e0136",
    ///     "+(+a͔Λ͕+a͕Λ͔-e͔Η͕-e͕Η͔-f͔Σ͕-f͕Σ͔-g͔Υ͕-g͕Υ͔-h͔Φ͕-h͕Φ͔+l͔Μ͕+l͕Μ͔+n͔Ν͕+n͕Ν͔+o͔Ξ͕+o͕Ξ͔+s͔Α͕+s͕Α͔-ë͔Γ͕-ë͕Γ͔-ï͔Δ͕-ï͕Δ͔-ñ͔Ε͕-ñ͕Ε͔)e0137",
    ///     "+(+b͔Ι͕+b͕Ι͔-c͔Θ͕-c͕Θ͔+f͔Ν͕+f͕Ν͔-g͔Μ͕-g͕Μ͔+k͔Τ͕+k͕Τ͔+l͔Υ͕+l͕Υ͔-m͔Ρ͕-m͕Ρ͔-n͔Σ͕-n͕Σ͔+t͔Α͕+t͕Α͔+ç͔Β͕+ç͕Β͔+ó͔Ε͕+ó͕Ε͔+ö͔Ζ͕+ö͕Ζ͔)e0145",
    ///     "+(+b͔Κ͕+b͕Κ͔-d͔Θ͕-d͕Θ͔+f͔Ξ͕+f͕Ξ͔-h͔Μ͕-h͕Μ͔-j͔Τ͕-j͕Τ͔+l͔Φ͕+l͕Φ͔+m͔Π͕+m͕Π͔-o͔Σ͕-o͕Σ͔+u͔Α͕+u͕Α͔+é͔Β͕+é͕Β͔-ó͔Δ͕-ó͕Δ͔+ú͔Ζ͕+ú͕Ζ͔)e0146",
    ///     "+(+b͔Λ͕+b͕Λ͔-e͔Θ͕-e͕Θ͔+f͔Ο͕+f͕Ο͔-i͔Μ͕-i͕Μ͔-j͔Υ͕-j͕Υ͔-k͔Φ͕-k͕Φ͔+n͔Π͕+n͕Π͔+o͔Ρ͕+o͕Ρ͔+á͔Α͕+á͕Α͔+ë͔Β͕+ë͕Β͔-ö͔Δ͕-ö͕Δ͔-ú͔Ε͕-ú͕Ε͔)e0147",
    ///     "+(+c͔Κ͕+c͕Κ͔-d͔Ι͕-d͕Ι͔+g͔Ξ͕+g͕Ξ͔-h͔Ν͕-h͕Ν͔+j͔Ρ͕+j͕Ρ͔-k͔Π͕-k͕Π͔+n͔Φ͕+n͕Φ͔-o͔Υ͕-o͕Υ͔+ä͔Α͕+ä͕Α͔+í͔Β͕+í͕Β͔+ó͔Γ͕+ó͕Γ͔+ü͔Ζ͕+ü͕Ζ͔)e0156",
    ///     "+(+c͔Λ͕+c͕Λ͔-e͔Ι͕-e͕Ι͔+g͔Ο͕+g͕Ο͔-i͔Ν͕-i͕Ν͔+j͔Σ͕+j͕Σ͔-l͔Π͕-l͕Π͔-m͔Φ͕-m͕Φ͔+o͔Τ͕+o͕Τ͔+å͔Α͕+å͕Α͔+ï͔Β͕+ï͕Β͔+ö͔Γ͕+ö͕Γ͔-ü͔Ε͕-ü͕Ε͔)e0157",
    ///     "+(+d͔Λ͕+d͕Λ͔-e͔Κ͕-e͕Κ͔+h͔Ο͕+h͕Ο͔-i͔Ξ͕-i͕Ξ͔+k͔Σ͕+k͕Σ͔-l͔Ρ͕-l͕Ρ͔+m͔Υ͕+m͕Υ͔-n͔Τ͕-n͕Τ͔+æ͔Α͕+æ͕Α͔+ñ͔Β͕+ñ͕Β͔+ú͔Γ͕+ú͕Γ͔+ü͔Δ͕+ü͕Δ͔)e0167",
    ///     "+(-a͔Γ͕-a͕Γ͔+b͔Β͕+b͕Β͔-f͔Α͕-f͕Α͔+q͔Π͕+q͕Π͔+r͔Ρ͕+r͕Ρ͔+s͔Σ͕+s͕Σ͔-t͔Ν͕-t͕Ν͔-u͔Ξ͕-u͕Ξ͔-á͔Ο͕-á͕Ο͔+ç͔Ι͕+ç͕Ι͔+é͔Κ͕+é͕Κ͔+ë͔Λ͕+ë͕Λ͔)e0234",
    ///     "+(-a͔Δ͕-a͕Δ͔+c͔Β͕+c͕Β͔-g͔Α͕-g͕Α͔-p͔Π͕-p͕Π͔+r͔Τ͕+r͕Τ͔+s͔Υ͕+s͕Υ͔+t͔Μ͕+t͕Μ͔-ä͔Ξ͕-ä͕Ξ͔-å͔Ο͕-å͕Ο͔-ç͔Θ͕-ç͕Θ͔+í͔Κ͕+í͕Κ͔+ï͔Λ͕+ï͕Λ͔)e0235",
    ///     "+(-a͔Ε͕-a͕Ε͔+d͔Β͕+d͕Β͔-h͔Α͕-h͕Α͔-p͔Ρ͕-p͕Ρ͔-q͔Τ͕-q͕Τ͔+s͔Φ͕+s͕Φ͔+u͔Μ͕+u͕Μ͔+ä͔Ν͕+ä͕Ν͔-æ͔Ο͕-æ͕Ο͔-é͔Θ͕-é͕Θ͔-í͔Ι͕-í͕Ι͔+ñ͔Λ͕+ñ͕Λ͔)e0236",
    ///     "+(-a͔Ζ͕-a͕Ζ͔+e͔Β͕+e͕Β͔-i͔Α͕-i͕Α͔-p͔Σ͕-p͕Σ͔-q͔Υ͕-q͕Υ͔-r͔Φ͕-r͕Φ͔+á͔Μ͕+á͕Μ͔+å͔Ν͕+å͕Ν͔+æ͔Ξ͕+æ͕Ξ͔-ë͔Θ͕-ë͕Θ͔-ï͔Ι͕-ï͕Ι͔-ñ͔Κ͕-ñ͕Κ͔)e0237",
    ///     "+(-b͔Δ͕-b͕Δ͔+c͔Γ͕+c͕Γ͔-j͔Α͕-j͕Α͔+p͔Ν͕+p͕Ν͔-q͔Μ͕-q͕Μ͔+u͔Τ͕+u͕Τ͔+á͔Υ͕+á͕Υ͔-ä͔Ρ͕-ä͕Ρ͔-å͔Σ͕-å͕Σ͔+ç͔Η͕+ç͕Η͔+ó͔Κ͕+ó͕Κ͔+ö͔Λ͕+ö͕Λ͔)e0245",
    ///     "+(-b͔Ε͕-b͕Ε͔+d͔Γ͕+d͕Γ͔-k͔Α͕-k͕Α͔+p͔Ξ͕+p͕Ξ͔-r͔Μ͕-r͕Μ͔-t͔Τ͕-t͕Τ͔+á͔Φ͕+á͕Φ͔+ä͔Π͕+ä͕Π͔-æ͔Σ͕-æ͕Σ͔+é͔Η͕+é͕Η͔-ó͔Ι͕-ó͕Ι͔+ú͔Λ͕+ú͕Λ͔)e0246",
    ///     "+(-b͔Ζ͕-b͕Ζ͔+e͔Γ͕+e͕Γ͔-l͔Α͕-l͕Α͔+p͔Ο͕+p͕Ο͔-s͔Μ͕-s͕Μ͔-t͔Υ͕-t͕Υ͔-u͔Φ͕-u͕Φ͔+å͔Π͕+å͕Π͔+æ͔Ρ͕+æ͕Ρ͔+ë͔Η͕+ë͕Η͔-ö͔Ι͕-ö͕Ι͔-ú͔Κ͕-ú͕Κ͔)e0247",
    ///     "+(-c͔Ε͕-c͕Ε͔+d͔Δ͕+d͕Δ͔-m͔Α͕-m͕Α͔+q͔Ξ͕+q͕Ξ͔-r͔Ν͕-r͕Ν͔+t͔Ρ͕+t͕Ρ͔-u͔Π͕-u͕Π͔+å͔Φ͕+å͕Φ͔-æ͔Υ͕-æ͕Υ͔+í͔Η͕+í͕Η͔+ó͔Θ͕+ó͕Θ͔+ü͔Λ͕+ü͕Λ͔)e0256",
    ///     "+(-c͔Ζ͕-c͕Ζ͔+e͔Δ͕+e͕Δ͔-n͔Α͕-n͕Α͔+q͔Ο͕+q͕Ο͔-s͔Ν͕-s͕Ν͔+t͔Σ͕+t͕Σ͔-á͔Π͕-á͕Π͔-ä͔Φ͕-ä͕Φ͔+æ͔Τ͕+æ͕Τ͔+ï͔Η͕+ï͕Η͔+ö͔Θ͕+ö͕Θ͔-ü͔Κ͕-ü͕Κ͔)e0257",
    ///     "+(-d͔Ζ͕-d͕Ζ͔+e͔Ε͕+e͕Ε͔-o͔Α͕-o͕Α͔+r͔Ο͕+r͕Ο͔-s͔Ξ͕-s͕Ξ͔+u͔Σ͕+u͕Σ͔-á͔Ρ͕-á͕Ρ͔+ä͔Υ͕+ä͕Υ͔-å͔Τ͕-å͕Τ͔+ñ͔Η͕+ñ͕Η͔+ú͔Θ͕+ú͕Θ͔+ü͔Ι͕+ü͕Ι͔)e0267",
    ///     "+(-f͔Δ͕-f͕Δ͔+g͔Γ͕+g͕Γ͔-j͔Β͕-j͕Β͔-p͔Ι͕-p͕Ι͔+q͔Θ͕+q͕Θ͔-t͔Η͕-t͕Η͔+é͔Τ͕+é͕Τ͔+ë͔Υ͕+ë͕Υ͔-í͔Ρ͕-í͕Ρ͔-ï͔Σ͕-ï͕Σ͔+ó͔Ξ͕+ó͕Ξ͔+ö͔Ο͕+ö͕Ο͔)e0345",
    ///     "+(-f͔Ε͕-f͕Ε͔+h͔Γ͕+h͕Γ͔-k͔Β͕-k͕Β͔-p͔Κ͕-p͕Κ͔+r͔Θ͕+r͕Θ͔-u͔Η͕-u͕Η͔-ç͔Τ͕-ç͕Τ͔+ë͔Φ͕+ë͕Φ͔+í͔Π͕+í͕Π͔-ñ͔Σ͕-ñ͕Σ͔-ó͔Ν͕-ó͕Ν͔+ú͔Ο͕+ú͕Ο͔)e0346",
    ///     "+(-f͔Ζ͕-f͕Ζ͔+i͔Γ͕+i͕Γ͔-l͔Β͕-l͕Β͔-p͔Λ͕-p͕Λ͔+s͔Θ͕+s͕Θ͔-á͔Η͕-á͕Η͔-ç͔Υ͕-ç͕Υ͔-é͔Φ͕-é͕Φ͔+ï͔Π͕+ï͕Π͔+ñ͔Ρ͕+ñ͕Ρ͔-ö͔Ν͕-ö͕Ν͔-ú͔Ξ͕-ú͕Ξ͔)e0347",
    ///     "+(-g͔Ε͕-g͕Ε͔+h͔Δ͕+h͕Δ͔-m͔Β͕-m͕Β͔-q͔Κ͕-q͕Κ͔+r͔Ι͕+r͕Ι͔-ä͔Η͕-ä͕Η͔+ç͔Ρ͕+ç͕Ρ͔-é͔Π͕-é͕Π͔+ï͔Φ͕+ï͕Φ͔-ñ͔Υ͕-ñ͕Υ͔+ó͔Μ͕+ó͕Μ͔+ü͔Ο͕+ü͕Ο͔)e0356",
    ///     "+(-g͔Ζ͕-g͕Ζ͔+i͔Δ͕+i͕Δ͔-n͔Β͕-n͕Β͔-q͔Λ͕-q͕Λ͔+s͔Ι͕+s͕Ι͔-å͔Η͕-å͕Η͔+ç͔Σ͕+ç͕Σ͔-ë͔Π͕-ë͕Π͔-í͔Φ͕-í͕Φ͔+ñ͔Τ͕+ñ͕Τ͔+ö͔Μ͕+ö͕Μ͔-ü͔Ξ͕-ü͕Ξ͔)e0357",
    ///     "+(-h͔Ζ͕-h͕Ζ͔+i͔Ε͕+i͕Ε͔-o͔Β͕-o͕Β͔-r͔Λ͕-r͕Λ͔+s͔Κ͕+s͕Κ͔-æ͔Η͕-æ͕Η͔+é͔Σ͕+é͕Σ͔-ë͔Ρ͕-ë͕Ρ͔+í͔Υ͕+í͕Υ͔-ï͔Τ͕-ï͕Τ͔+ú͔Μ͕+ú͕Μ͔+ü͔Ν͕+ü͕Ν͔)e0367",
    ///     "+(-j͔Ε͕-j͕Ε͔+k͔Δ͕+k͕Δ͔-m͔Γ͕-m͕Γ͔-t͔Κ͕-t͕Κ͔+u͔Ι͕+u͕Ι͔-ä͔Θ͕-ä͕Θ͔-ç͔Ξ͕-ç͕Ξ͔+é͔Ν͕+é͕Ν͔-í͔Μ͕-í͕Μ͔+ö͔Φ͕+ö͕Φ͔-ú͔Υ͕-ú͕Υ͔+ü͔Σ͕+ü͕Σ͔)e0456",
    ///     "+(-j͔Ζ͕-j͕Ζ͔+l͔Δ͕+l͕Δ͔-n͔Γ͕-n͕Γ͔-t͔Λ͕-t͕Λ͔+á͔Ι͕+á͕Ι͔-å͔Θ͕-å͕Θ͔-ç͔Ο͕-ç͕Ο͔+ë͔Ν͕+ë͕Ν͔-ï͔Μ͕-ï͕Μ͔-ó͔Φ͕-ó͕Φ͔+ú͔Τ͕+ú͕Τ͔-ü͔Ρ͕-ü͕Ρ͔)e0457",
    ///     "+(-k͔Ζ͕-k͕Ζ͔+l͔Ε͕+l͕Ε͔-o͔Γ͕-o͕Γ͔-u͔Λ͕-u͕Λ͔+á͔Κ͕+á͕Κ͔-æ͔Θ͕-æ͕Θ͔-é͔Ο͕-é͕Ο͔+ë͔Ξ͕+ë͕Ξ͔-ñ͔Μ͕-ñ͕Μ͔+ó͔Υ͕+ó͕Υ͔-ö͔Τ͕-ö͕Τ͔+ü͔Π͕+ü͕Π͔)e0467",
    ///     "+(-m͔Ζ͕-m͕Ζ͔+n͔Ε͕+n͕Ε͔-o͔Δ͕-o͕Δ͔-ä͔Λ͕-ä͕Λ͔+å͔Κ͕+å͕Κ͔-æ͔Ι͕-æ͕Ι͔-í͔Ο͕-í͕Ο͔+ï͔Ξ͕+ï͕Ξ͔-ñ͔Ν͕-ñ͕Ν͔-ó͔Σ͕-ó͕Σ͔+ö͔Ρ͕+ö͕Ρ͔-ú͔Π͕-ú͕Π͔)e0567",
    ///     "+(+j͔o͕+j͕o͔-k͔n͕-k͕n͔+l͔m͕+l͕m͔+t͔æ͕+t͕æ͔-u͔å͕-u͕å͔+á͔ä͕+á͕ä͔+ç͔ñ͕+ç͕ñ͔-é͔ï͕-é͕ï͔+ë͔í͕+ë͕í͔)e4567",
    ///     "+(-g͔o͕-g͕o͔+h͔n͕+h͕n͔-i͔m͕-i͕m͔-q͔æ͕-q͕æ͔+r͔å͕+r͕å͔-s͔ä͕-s͕ä͔+ç͔ú͕+ç͕ú͔-é͔ö͕-é͕ö͔+ë͔ó͕+ë͕ó͔)e3576",
    ///     "+(+f͔o͕+f͕o͔-h͔l͕-h͕l͔+i͔k͕+i͕k͔+p͔æ͕+p͕æ͔-r͔á͕-r͕á͔+s͔u͕+s͕u͔+ç͔ü͕+ç͕ü͔-í͔ö͕-í͕ö͔+ï͔ó͕+ï͕ó͔)e3467",
    ///     "+(-f͔n͕-f͕n͔+g͔l͕+g͕l͔-i͔j͕-i͕j͔-p͔å͕-p͕å͔+q͔á͕+q͕á͔-s͔t͕-s͕t͔+é͔ü͕+é͕ü͔-í͔ú͕-í͕ú͔+ñ͔ó͕+ñ͕ó͔)e3475",
    ///     "+(+f͔m͕+f͕m͔-g͔k͕-g͕k͔+h͔j͕+h͕j͔+p͔ä͕+p͕ä͔-q͔u͕-q͕u͔+r͔t͕+r͕t͔+ë͔ü͕+ë͕ü͔-ï͔ú͕-ï͕ú͔+ñ͔ö͕+ñ͕ö͔)e3456",
    ///     "+(+c͔o͕+c͕o͔-d͔n͕-d͕n͔+e͔m͕+e͕m͔-q͔ñ͕-q͕ñ͔+r͔ï͕+r͕ï͔-s͔í͕-s͕í͔-t͔ú͕-t͕ú͔+u͔ö͕+u͕ö͔-á͔ó͕-á͕ó͔)e2567",
    ///     "+(-b͔o͕-b͕o͔+d͔l͕+d͕l͔-e͔k͕-e͕k͔+p͔ñ͕+p͕ñ͔-r͔ë͕-r͕ë͔+s͔é͕+s͕é͔-t͔ü͕-t͕ü͔+ä͔ö͕+ä͕ö͔-å͔ó͕-å͕ó͔)e2476",
    ///     "+(+b͔n͕+b͕n͔-c͔l͕-c͕l͔+e͔j͕+e͕j͔-p͔ï͕-p͕ï͔+q͔ë͕+q͕ë͔-s͔ç͕-s͕ç͔-u͔ü͕-u͕ü͔+ä͔ú͕+ä͕ú͔-æ͔ó͕-æ͕ó͔)e2457",
    ///     "+(-b͔m͕-b͕m͔+c͔k͕+c͕k͔-d͔j͕-d͕j͔+p͔í͕+p͕í͔-q͔é͕-q͕é͔+r͔ç͕+r͕ç͔-á͔ü͕-á͕ü͔+å͔ú͕+å͕ú͔-æ͔ö͕-æ͕ö͔)e2465",
    ///     "+(+a͔o͕+a͕o͔-d͔i͕-d͕i͔+e͔h͕+e͕h͔+p͔ú͕+p͕ú͔+q͔ü͕+q͕ü͔-u͔ë͕-u͕ë͔+á͔é͕+á͕é͔-ä͔ï͕-ä͕ï͔+å͔í͕+å͕í͔)e2367",
    ///     "+(-a͔n͕-a͕n͔+c͔i͕+c͕i͔-e͔g͕-e͕g͔-p͔ö͕-p͕ö͔+r͔ü͕+r͕ü͔+t͔ë͕+t͕ë͔-á͔ç͕-á͕ç͔-ä͔ñ͕-ä͕ñ͔+æ͔í͕+æ͕í͔)e2375",
    ///     "+(+a͔m͕+a͕m͔-c͔h͕-c͕h͔+d͔g͕+d͕g͔+p͔ó͕+p͕ó͔+s͔ü͕+s͕ü͔-t͔é͕-t͕é͔+u͔ç͕+u͕ç͔-å͔ñ͕-å͕ñ͔+æ͔ï͕+æ͕ï͔)e2356",
    ///     "+(+a͔l͕+a͕l͔-b͔i͕-b͕i͔+e͔f͕+e͕f͔-q͔ö͕-q͕ö͔-r͔ú͕-r͕ú͔+t͔ï͕+t͕ï͔+u͔ñ͕+u͕ñ͔-å͔ç͕-å͕ç͔-æ͔é͕-æ͕é͔)e2347",
    ///     "+(-a͔k͕-a͕k͔+b͔h͕+b͕h͔-d͔f͕-d͕f͔+q͔ó͕+q͕ó͔-s͔ú͕-s͕ú͔-t͔í͕-t͕í͔+á͔ñ͕+á͕ñ͔+ä͔ç͕+ä͕ç͔-æ͔ë͕-æ͕ë͔)e2364",
    ///     "+(+a͔j͕+a͕j͔-b͔g͕-b͕g͔+c͔f͕+c͕f͔+r͔ó͕+r͕ó͔+s͔ö͕+s͕ö͔-u͔í͕-u͕í͔-á͔ï͕-á͕ï͔+ä͔é͕+ä͕é͔+å͔ë͕+å͕ë͔)e2345",
    ///     "+(+c͔æ͕+c͕æ͔-d͔å͕-d͕å͔+e͔ä͕+e͕ä͔+g͔ñ͕+g͕ñ͔-h͔ï͕-h͕ï͔+i͔í͕+i͕í͔+j͔ú͕+j͕ú͔-k͔ö͕-k͕ö͔+l͔ó͕+l͕ó͔)e1576",
    ///     "+(-b͔æ͕-b͕æ͔+d͔á͕+d͕á͔-e͔u͕-e͕u͔-f͔ñ͕-f͕ñ͔+h͔ë͕+h͕ë͔-i͔é͕-i͕é͔+j͔ü͕+j͕ü͔-m͔ö͕-m͕ö͔+n͔ó͕+n͕ó͔)e1467",
    ///     "+(+b͔å͕+b͕å͔-c͔á͕-c͕á͔+e͔t͕+e͕t͔+f͔ï͕+f͕ï͔-g͔ë͕-g͕ë͔+i͔ç͕+i͕ç͔+k͔ü͕+k͕ü͔-m͔ú͕-m͕ú͔+o͔ó͕+o͕ó͔)e1475",
    ///     "+(-b͔ä͕-b͕ä͔+c͔u͕+c͕u͔-d͔t͕-d͕t͔-f͔í͕-f͕í͔+g͔é͕+g͕é͔-h͔ç͕-h͕ç͔+l͔ü͕+l͕ü͔-n͔ú͕-n͕ú͔+o͔ö͕+o͕ö͔)e1456",
    ///     "+(+a͔æ͕+a͕æ͔-d͔s͕-d͕s͔+e͔r͕+e͕r͔-f͔ú͕-f͕ú͔-g͔ü͕-g͕ü͔+k͔ë͕+k͕ë͔-l͔é͕-l͕é͔+m͔ï͕+m͕ï͔-n͔í͕-n͕í͔)e1376",
    ///     "+(-a͔å͕-a͕å͔+c͔s͕+c͕s͔-e͔q͕-e͕q͔+f͔ö͕+f͕ö͔-h͔ü͕-h͕ü͔-j͔ë͕-j͕ë͔+l͔ç͕+l͕ç͔+m͔ñ͕+m͕ñ͔-o͔í͕-o͕í͔)e1357",
    ///     "+(+a͔ä͕+a͕ä͔-c͔r͕-c͕r͔+d͔q͕+d͕q͔-f͔ó͕-f͕ó͔-i͔ü͕-i͕ü͔+j͔é͕+j͕é͔-k͔ç͕-k͕ç͔+n͔ñ͕+n͕ñ͔-o͔ï͕-o͕ï͔)e1365",
    ///     "+(+a͔á͕+a͕á͔-b͔s͕-b͕s͔+e͔p͕+e͕p͔+g͔ö͕+g͕ö͔+h͔ú͕+h͕ú͔-j͔ï͕-j͕ï͔-k͔ñ͕-k͕ñ͔+n͔ç͕+n͕ç͔+o͔é͕+o͕é͔)e1374",
    ///     "+(-a͔u͕-a͕u͔+b͔r͕+b͕r͔-d͔p͕-d͕p͔-g͔ó͕-g͕ó͔+i͔ú͕+i͕ú͔+j͔í͕+j͕í͔-l͔ñ͕-l͕ñ͔-m͔ç͕-m͕ç͔+o͔ë͕+o͕ë͔)e1346",
    ///     "+(+a͔t͕+a͕t͔-b͔q͕-b͕q͔+c͔p͕+c͕p͔-h͔ó͕-h͕ó͔-i͔ö͕-i͕ö͔+k͔í͕+k͕í͔+l͔ï͕+l͕ï͔-m͔é͕-m͕é͔-n͔ë͕-n͕ë͔)e1354",
    ///     "+(+a͔ñ͕+a͕ñ͔+b͔ú͕+b͕ú͔+c͔ü͕+c͕ü͔-h͔s͕-h͕s͔+i͔r͕+i͕r͔-k͔á͕-k͕á͔+l͔u͕+l͕u͔-m͔å͕-m͕å͔+n͔ä͕+n͕ä͔)e1267",
    ///     "+(-a͔ï͕-a͕ï͔-b͔ö͕-b͕ö͔+d͔ü͕+d͕ü͔+g͔s͕+g͕s͔-i͔q͕-i͕q͔+j͔á͕+j͕á͔-l͔t͕-l͕t͔-m͔æ͕-m͕æ͔+o͔ä͕+o͕ä͔)e1275",
    ///     "+(+a͔í͕+a͕í͔+b͔ó͕+b͕ó͔+e͔ü͕+e͕ü͔-g͔r͕-g͕r͔+h͔q͕+h͕q͔-j͔u͕-j͕u͔+k͔t͕+k͕t͔-n͔æ͕-n͕æ͔+o͔å͕+o͕å͔)e1256",
    ///     "+(+a͔ë͕+a͕ë͔-c͔ö͕-c͕ö͔-d͔ú͕-d͕ú͔-f͔s͕-f͕s͔+i͔p͕+i͕p͔+j͔å͕+j͕å͔+k͔æ͕+k͕æ͔-n͔t͕-n͕t͔-o͔u͕-o͕u͔)e1247",
    ///     "+(-a͔é͕-a͕é͔+c͔ó͕+c͕ó͔-e͔ú͕-e͕ú͔+f͔r͕+f͕r͔-h͔p͕-h͕p͔-j͔ä͕-j͕ä͔+l͔æ͕+l͕æ͔+m͔t͕+m͕t͔-o͔á͕-o͕á͔)e1264",
    ///     "+(+a͔ç͕+a͕ç͔+d͔ó͕+d͕ó͔+e͔ö͕+e͕ö͔-f͔q͕-f͕q͔+g͔p͕+g͕p͔-k͔ä͕-k͕ä͔-l͔å͕-l͕å͔+m͔u͕+m͕u͔+n͔á͕+n͕á͔)e1245",
    ///     "+(+b͔ë͕+b͕ë͔+c͔ï͕+c͕ï͔+d͔ñ͕+d͕ñ͔-f͔á͕-f͕á͔-g͔å͕-g͕å͔-h͔æ͕-h͕æ͔+l͔p͕+l͕p͔+n͔q͕+n͕q͔+o͔r͕+o͕r͔)e1273",
    ///     "+(-b͔é͕-b͕é͔-c͔í͕-c͕í͔+e͔ñ͕+e͕ñ͔+f͔u͕+f͕u͔+g͔ä͕+g͕ä͔-i͔æ͕-i͕æ͔-k͔p͕-k͕p͔-m͔q͕-m͕q͔+o͔s͕+o͕s͔)e1236",
    ///     "+(+b͔ç͕+b͕ç͔-d͔í͕-d͕í͔-e͔ï͕-e͕ï͔-f͔t͕-f͕t͔+h͔ä͕+h͕ä͔+i͔å͕+i͕å͔+j͔p͕+j͕p͔-m͔r͕-m͕r͔-n͔s͕-n͕s͔)e1253",
    ///     "+(+p͔ü͕-p͕ü͔-q͔ú͕+q͕ú͔+r͔ö͕-r͕ö͔-s͔ó͕+s͕ó͔+t͔ñ͕-t͕ñ͔-u͔ï͕+u͕ï͔+á͔í͕-á͕í͔+ä͔ë͕-ä͕ë͔-å͔é͕+å͕é͔+æ͔ç͕-æ͕ç͔)e234567",
    ///     "+(-f͔ü͕+f͕ü͔+g͔ú͕-g͕ú͔-h͔ö͕+h͕ö͔+i͔ó͕-i͕ó͔-j͔ñ͕+j͕ñ͔+k͔ï͕-k͕ï͔-l͔í͕+l͕í͔-m͔ë͕+m͕ë͔+n͔é͕-n͕é͔-o͔ç͕+o͕ç͔)e134576",
    ///     "+(+b͔ü͕-b͕ü͔-c͔ú͕+c͕ú͔+d͔ö͕-d͕ö͔-e͔ó͕+e͕ó͔+j͔æ͕-j͕æ͔-k͔å͕+k͕å͔+l͔ä͕-l͕ä͔+m͔á͕-m͕á͔-n͔u͕+n͕u͔+o͔t͕-o͕t͔)e124567",
    ///     "+(-a͔ü͕+a͕ü͔+c͔ñ͕-c͕ñ͔-d͔ï͕+d͕ï͔+e͔í͕-e͕í͔-g͔æ͕+g͕æ͔+h͔å͕-h͕å͔-i͔ä͕+i͕ä͔-m͔s͕+m͕s͔+n͔r͕-n͕r͔-o͔q͕+o͕q͔)e123576",
    ///     "+(+a͔ú͕-a͕ú͔-b͔ñ͕+b͕ñ͔+d͔ë͕-d͕ë͔-e͔é͕+e͕é͔+f͔æ͕-f͕æ͔-h͔á͕+h͕á͔+i͔u͕-i͕u͔+k͔s͕-k͕s͔-l͔r͕+l͕r͔+o͔p͕-o͕p͔)e123467",
    ///     "+(-a͔ö͕+a͕ö͔+b͔ï͕-b͕ï͔-c͔ë͕+c͕ë͔+e͔ç͕-e͕ç͔-f͔å͕+f͕å͔+g͔á͕-g͕á͔-i͔t͕+i͕t͔-j͔s͕+j͕s͔+l͔q͕-l͕q͔-n͔p͕+n͕p͔)e123475",
    ///     "+(+a͔ó͕-a͕ó͔-b͔í͕+b͕í͔+c͔é͕-c͕é͔-d͔ç͕+d͕ç͔+f͔ä͕-f͕ä͔-g͔u͕+g͕u͔+h͔t͕-h͕t͔+j͔r͕-j͕r͔-k͔q͕+k͕q͔+m͔p͕-m͕p͔)e123456",
    ///     "+(-ç͔Φ͕+ç͕Φ͔+é͔Υ͕-é͕Υ͔-ë͔Τ͕+ë͕Τ͔-í͔Σ͕+í͕Σ͔+ï͔Ρ͕-ï͕Ρ͔-ñ͔Π͕+ñ͕Π͔+ó͔Ο͕-ó͕Ο͔-ö͔Ξ͕+ö͕Ξ͔+ú͔Ν͕-ú͕Ν͔-ü͔Μ͕+ü͕Μ͔)e034567",
    ///     "+(+t͔Φ͕-t͕Φ͔-u͔Υ͕+u͕Υ͔+á͔Τ͕-á͕Τ͔+ä͔Σ͕-ä͕Σ͔-å͔Ρ͕+å͕Ρ͔+æ͔Π͕-æ͕Π͔-ó͔Λ͕+ó͕Λ͔+ö͔Κ͕-ö͕Κ͔-ú͔Ι͕+ú͕Ι͔+ü͔Θ͕-ü͕Θ͔)e024576",
    ///     "+(-q͔Φ͕+q͕Φ͔+r͔Υ͕-r͕Υ͔-s͔Τ͕+s͕Τ͔-ä͔Ο͕+ä͕Ο͔+å͔Ξ͕-å͕Ξ͔-æ͔Ν͕+æ͕Ν͔+í͔Λ͕-í͕Λ͔-ï͔Κ͕+ï͕Κ͔+ñ͔Ι͕-ñ͕Ι͔-ü͔Η͕+ü͕Η͔)e023567",
    ///     "+(+p͔Φ͕-p͕Φ͔-r͔Σ͕+r͕Σ͔+s͔Ρ͕-s͕Ρ͔+u͔Ο͕-u͕Ο͔-á͔Ξ͕+á͕Ξ͔+æ͔Μ͕-æ͕Μ͔-é͔Λ͕+é͕Λ͔+ë͔Κ͕-ë͕Κ͔-ñ͔Θ͕+ñ͕Θ͔+ú͔Η͕-ú͕Η͔)e023476",
    ///     "+(-p͔Υ͕+p͕Υ͔+q͔Σ͕-q͕Σ͔-s͔Π͕+s͕Π͔-t͔Ο͕+t͕Ο͔+á͔Ν͕-á͕Ν͔-å͔Μ͕+å͕Μ͔+ç͔Λ͕-ç͕Λ͔-ë͔Ι͕+ë͕Ι͔+ï͔Θ͕-ï͕Θ͔-ö͔Η͕+ö͕Η͔)e023457",
    ///     "+(+p͔Τ͕-p͕Τ͔-q͔Ρ͕+q͕Ρ͔+r͔Π͕-r͕Π͔+t͔Ξ͕-t͕Ξ͔-u͔Ν͕+u͕Ν͔+ä͔Μ͕-ä͕Μ͔-ç͔Κ͕+ç͕Κ͔+é͔Ι͕-é͕Ι͔-í͔Θ͕+í͕Θ͔+ó͔Η͕-ó͕Η͔)e023465",
    ///     "+(-j͔Φ͕+j͕Φ͔+k͔Υ͕-k͕Υ͔-l͔Τ͕+l͕Τ͔-m͔Σ͕+m͕Σ͔+n͔Ρ͕-n͕Ρ͔-o͔Π͕+o͕Π͔+ó͔Ζ͕-ó͕Ζ͔-ö͔Ε͕+ö͕Ε͔+ú͔Δ͕-ú͕Δ͔-ü͔Γ͕+ü͕Γ͔)e014567",
    ///     "+(+g͔Φ͕-g͕Φ͔-h͔Υ͕+h͕Υ͔+i͔Τ͕-i͕Τ͔+m͔Ο͕-m͕Ο͔-n͔Ξ͕+n͕Ξ͔+o͔Ν͕-o͕Ν͔-í͔Ζ͕+í͕Ζ͔+ï͔Ε͕-ï͕Ε͔-ñ͔Δ͕+ñ͕Δ͔+ü͔Β͕-ü͕Β͔)e013576",
    ///     "+(-f͔Φ͕+f͕Φ͔+h͔Σ͕-h͕Σ͔-i͔Ρ͕+i͕Ρ͔-k͔Ο͕+k͕Ο͔+l͔Ξ͕-l͕Ξ͔-o͔Μ͕+o͕Μ͔+é͔Ζ͕-é͕Ζ͔-ë͔Ε͕+ë͕Ε͔+ñ͔Γ͕-ñ͕Γ͔-ú͔Β͕+ú͕Β͔)e013467",
    ///     "+(+f͔Υ͕-f͕Υ͔-g͔Σ͕+g͕Σ͔+i͔Π͕-i͕Π͔+j͔Ο͕-j͕Ο͔-l͔Ν͕+l͕Ν͔+n͔Μ͕-n͕Μ͔-ç͔Ζ͕+ç͕Ζ͔+ë͔Δ͕-ë͕Δ͔-ï͔Γ͕+ï͕Γ͔+ö͔Β͕-ö͕Β͔)e013475",
    ///     "+(-f͔Τ͕+f͕Τ͔+g͔Ρ͕-g͕Ρ͔-h͔Π͕+h͕Π͔-j͔Ξ͕+j͕Ξ͔+k͔Ν͕-k͕Ν͔-m͔Μ͕+m͕Μ͔+ç͔Ε͕-ç͕Ε͔-é͔Δ͕+é͕Δ͔+í͔Γ͕-í͕Γ͔-ó͔Β͕+ó͕Β͔)e013456",
    ///     "+(-c͔Φ͕+c͕Φ͔+d͔Υ͕-d͕Υ͔-e͔Τ͕+e͕Τ͔-m͔Λ͕+m͕Λ͔+n͔Κ͕-n͕Κ͔-o͔Ι͕+o͕Ι͔+ä͔Ζ͕-ä͕Ζ͔-å͔Ε͕+å͕Ε͔+æ͔Δ͕-æ͕Δ͔-ü͔Α͕+ü͕Α͔)e012567",
    ///     "+(+b͔Φ͕-b͕Φ͔-d͔Σ͕+d͕Σ͔+e͔Ρ͕-e͕Ρ͔+k͔Λ͕-k͕Λ͔-l͔Κ͕+l͕Κ͔+o͔Θ͕-o͕Θ͔-u͔Ζ͕+u͕Ζ͔+á͔Ε͕-á͕Ε͔-æ͔Γ͕+æ͕Γ͔+ú͔Α͕-ú͕Α͔)e012476",
    ///     "+(-b͔Υ͕+b͕Υ͔+c͔Σ͕-c͕Σ͔-e͔Π͕+e͕Π͔-j͔Λ͕+j͕Λ͔+l͔Ι͕-l͕Ι͔-n͔Θ͕+n͕Θ͔+t͔Ζ͕-t͕Ζ͔-á͔Δ͕+á͕Δ͔+å͔Γ͕-å͕Γ͔-ö͔Α͕+ö͕Α͔)e012457",
    ///     "+(+b͔Τ͕-b͕Τ͔-c͔Ρ͕+c͕Ρ͔+d͔Π͕-d͕Π͔+j͔Κ͕-j͕Κ͔-k͔Ι͕+k͕Ι͔+m͔Θ͕-m͕Θ͔-t͔Ε͕+t͕Ε͔+u͔Δ͕-u͕Δ͔-ä͔Γ͕+ä͕Γ͔+ó͔Α͕-ó͕Α͔)e012465",
    ///     "+(-a͔Φ͕+a͕Φ͔+d͔Ο͕-d͕Ο͔-e͔Ξ͕+e͕Ξ͔-h͔Λ͕+h͕Λ͔+i͔Κ͕-i͕Κ͔-o͔Η͕+o͕Η͔+r͔Ζ͕-r͕Ζ͔-s͔Ε͕+s͕Ε͔+æ͔Β͕-æ͕Β͔-ñ͔Α͕+ñ͕Α͔)e012367",
    ///     "+(+a͔Υ͕-a͕Υ͔-c͔Ο͕+c͕Ο͔+e͔Ν͕-e͕Ν͔+g͔Λ͕-g͕Λ͔-i͔Ι͕+i͕Ι͔+n͔Η͕-n͕Η͔-q͔Ζ͕+q͕Ζ͔+s͔Δ͕-s͕Δ͔-å͔Β͕+å͕Β͔+ï͔Α͕-ï͕Α͔)e012375",
    ///     "+(-a͔Τ͕+a͕Τ͔+c͔Ξ͕-c͕Ξ͔-d͔Ν͕+d͕Ν͔-g͔Κ͕+g͕Κ͔+h͔Ι͕-h͕Ι͔-m͔Η͕+m͕Η͔+q͔Ε͕-q͕Ε͔-r͔Δ͕+r͕Δ͔+ä͔Β͕-ä͕Β͔-í͔Α͕+í͕Α͔)e012356",
    ///     "+(-a͔Σ͕+a͕Σ͔+b͔Ο͕-b͕Ο͔-e͔Μ͕+e͕Μ͔-f͔Λ͕+f͕Λ͔+i͔Θ͕-i͕Θ͔-l͔Η͕+l͕Η͔+p͔Ζ͕-p͕Ζ͔-s͔Γ͕+s͕Γ͔+á͔Β͕-á͕Β͔-ë͔Α͕+ë͕Α͔)e012347",
    ///     "+(+a͔Ρ͕-a͕Ρ͔-b͔Ξ͕+b͕Ξ͔+d͔Μ͕-d͕Μ͔+f͔Κ͕-f͕Κ͔-h͔Θ͕+h͕Θ͔+k͔Η͕-k͕Η͔-p͔Ε͕+p͕Ε͔+r͔Γ͕-r͕Γ͔-u͔Β͕+u͕Β͔+é͔Α͕-é͕Α͔)e012364",
    ///     "+(-a͔Π͕+a͕Π͔+b͔Ν͕-b͕Ν͔-c͔Μ͕+c͕Μ͔-f͔Ι͕+f͕Ι͔+g͔Θ͕-g͕Θ͔-j͔Η͕+j͕Η͔+p͔Δ͕-p͕Δ͔-q͔Γ͕+q͕Γ͔+t͔Β͕-t͕Β͔-ç͔Α͕+ç͕Α͔)e012345",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_triple_motor() -> Self {
        Self::scalar() + Self::volume5() + Self::volume() + Self::line()
    }
    /// The multivector of triple motor $`m_3 \equiv s + v^5 + v + \ell + S`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let triple_motor = Vee::triple_rotator().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(
    ///     triple_motor.basis_blades(),
    ///     Vee::triple_motor().basis_blades()
    /// );
    /// format_eq!(triple_motor, [
    ///     "+v͔v͕",
    ///     "+(+X͕v͔+Y͕α͔+Z͕β͔+Ð͕γ͔+Ø͕δ͔+Þ͕ε͔+Œ͕ζ͔)e01",
    ///     "+(-X͕α͔+Y͕v͔+Z͕η͔+Ð͕θ͔+Ø͕ι͔+Þ͕κ͔+Œ͕λ͔)e02",
    ///     "+(-X͕β͔-Y͕η͔+Z͕v͔+Ð͕μ͔+Ø͕ν͔+Þ͕ξ͔+Œ͕ο͔)e03",
    ///     "+(-X͕γ͔-Y͕θ͔-Z͕μ͔+v͔Ð͕+Ø͕π͔+Þ͕ρ͔+Œ͕σ͔)e04",
    ///     "+(-X͕δ͔-Y͕ι͔-Z͕ν͔+v͔Ø͕-Ð͕π͔+Þ͕τ͔+Œ͕υ͔)e05",
    ///     "+(-X͕ε͔-Y͕κ͔-Z͕ξ͔+v͔Þ͕-Ð͕ρ͔-Ø͕τ͔+Œ͕φ͔)e06",
    ///     "+(-X͕ζ͔-Y͕λ͔-Z͕ο͔+v͔Œ͕-Ð͕σ͔-Ø͕υ͔-Þ͕φ͔)e07",
    ///     "+v͕α͔e12",
    ///     "+v͕β͔e13",
    ///     "+v͕γ͔e14",
    ///     "+v͕δ͔e15",
    ///     "+v͕ε͔e16",
    ///     "+v͕ζ͔e17",
    ///     "+v͕η͔e23",
    ///     "+v͕θ͔e24",
    ///     "+v͕ι͔e25",
    ///     "+v͕κ͔e26",
    ///     "+v͕λ͔e27",
    ///     "+v͕μ͔e34",
    ///     "+v͕ν͔e35",
    ///     "+v͕ξ͔e36",
    ///     "+v͕ο͔e37",
    ///     "+v͕π͔e45",
    ///     "+v͕ρ͔e46",
    ///     "+v͕σ͔e47",
    ///     "+v͕τ͔e56",
    ///     "+v͕υ͔e57",
    ///     "+v͕φ͔e67",
    ///     "+v͕ü͔e1234",
    ///     "+(+X͕η͔-Y͕β͔+Z͕α͔+Ð͕ü͔-Ø͕ú͔+Þ͕ö͔-ó͔Œ͕)e0123",
    ///     "+(+X͕θ͔-Y͕γ͔-Z͕ü͔+Ð͕α͔+Ø͕ñ͔-Þ͕ï͔+í͔Œ͕)e0124",
    ///     "+(+X͕ι͔-Y͕δ͔+Z͕ú͔-Ð͕ñ͔+Ø͕α͔+Þ͕ë͔-é͔Œ͕)e0125",
    ///     "+(+X͕κ͔-Y͕ε͔-Z͕ö͔+Ð͕ï͔-Ø͕ë͔+Þ͕α͔+ç͔Œ͕)e0126",
    ///     "+(+X͕λ͔-Y͕ζ͔+Z͕ó͔-Ð͕í͔+Ø͕é͔-Þ͕ç͔+Œ͕α͔)e0127",
    ///     "+(+X͕μ͔+Y͕ü͔-Z͕γ͔+Ð͕β͔-Ø͕æ͔+Þ͕å͔-ä͔Œ͕)e0134",
    ///     "+(+X͕ν͔-Y͕ú͔-Z͕δ͔+u͔Œ͕+Ð͕æ͔+Ø͕β͔-Þ͕á͔)e0135",
    ///     "+(+X͕ξ͔+Y͕ö͔-Z͕ε͔-t͔Œ͕-Ð͕å͔+Ø͕á͔+Þ͕β͔)e0136",
    ///     "+(+X͕ο͔-Y͕ó͔-Z͕ζ͔+t͔Þ͕-u͔Ø͕+Ð͕ä͔+Œ͕β͔)e0137",
    ///     "+(+X͕π͔+Y͕ñ͔-Z͕æ͔-r͔Œ͕+s͔Þ͕-Ð͕δ͔+Ø͕γ͔)e0145",
    ///     "+(+X͕ρ͔-Y͕ï͔+Z͕å͔+q͔Œ͕-s͔Ø͕-Ð͕ε͔+Þ͕γ͔)e0146",
    ///     "+(+X͕σ͔+Y͕í͔-Z͕ä͔-q͔Þ͕+r͔Ø͕-Ð͕ζ͔+Œ͕γ͔)e0147",
    ///     "+(+X͕τ͔+Y͕ë͔-Z͕á͔-p͔Œ͕+s͔Ð͕-Ø͕ε͔+Þ͕δ͔)e0156",
    ///     "+(+X͕υ͔-Y͕é͔+Z͕u͔+p͔Þ͕-r͔Ð͕-Ø͕ζ͔+Œ͕δ͔)e0157",
    ///     "+(+X͕φ͔+Y͕ç͔-Z͕t͔-p͔Ø͕+q͔Ð͕-Þ͕ζ͔+Œ͕ε͔)e0167",
    ///     "+(-X͕ü͔+Y͕μ͔-Z͕θ͔+m͔Œ͕-n͔Þ͕+o͔Ø͕+Ð͕η͔)e0234",
    ///     "+(+X͕ú͔+Y͕ν͔-Z͕ι͔-k͔Œ͕+l͔Þ͕-o͔Ð͕+Ø͕η͔)e0235",
    ///     "+(-X͕ö͔+Y͕ξ͔-Z͕κ͔+j͔Œ͕-l͔Ø͕+n͔Ð͕+Þ͕η͔)e0236",
    ///     "+(+X͕ó͔+Y͕ο͔-Z͕λ͔-j͔Þ͕+k͔Ø͕-m͔Ð͕+Œ͕η͔)e0237",
    ///     "+(-X͕ñ͔+Y͕π͔+Z͕o͔+h͔Œ͕-i͔Þ͕-Ð͕ι͔+Ø͕θ͔)e0245",
    ///     "+(+X͕ï͔+Y͕ρ͔-Z͕n͔-g͔Œ͕+i͔Ø͕-Ð͕κ͔+Þ͕θ͔)e0246",
    ///     "+(-X͕í͔+Y͕σ͔+Z͕m͔+g͔Þ͕-h͔Ø͕-Ð͕λ͔+Œ͕θ͔)e0247",
    ///     "+(-X͕ë͔+Y͕τ͔+Z͕l͔+f͔Œ͕-i͔Ð͕-Ø͕κ͔+Þ͕ι͔)e0256",
    ///     "+(+X͕é͔+Y͕υ͔-Z͕k͔-f͔Þ͕+h͔Ð͕-Ø͕λ͔+Œ͕ι͔)e0257",
    ///     "+(-X͕ç͔+Y͕φ͔+Z͕j͔+f͔Ø͕-g͔Ð͕-Þ͕λ͔+Œ͕κ͔)e0267",
    ///     "+(+X͕æ͔-Y͕o͔+Z͕π͔-d͔Œ͕+e͔Þ͕-Ð͕ν͔+Ø͕μ͔)e0345",
    ///     "+(-X͕å͔+Y͕n͔+Z͕ρ͔+c͔Œ͕-e͔Ø͕-Ð͕ξ͔+Þ͕μ͔)e0346",
    ///     "+(+X͕ä͔-Y͕m͔+Z͕σ͔-c͔Þ͕+d͔Ø͕-Ð͕ο͔+Œ͕μ͔)e0347",
    ///     "+(+X͕á͔-Y͕l͔+Z͕τ͔-b͔Œ͕+e͔Ð͕-Ø͕ξ͔+Þ͕ν͔)e0356",
    ///     "+(-X͕u͔+Y͕k͔+Z͕υ͔+b͔Þ͕-d͔Ð͕-Ø͕ο͔+Œ͕ν͔)e0357",
    ///     "+(+X͕t͔-Y͕j͔+Z͕φ͔-b͔Ø͕+c͔Ð͕-Þ͕ο͔+Œ͕ξ͔)e0367",
    ///     "+(-X͕s͔+Y͕i͔-Z͕e͔+a͔Œ͕+Ð͕τ͔-Ø͕ρ͔+Þ͕π͔)e0456",
    ///     "+(+X͕r͔-Y͕h͔+Z͕d͔-a͔Þ͕+Ð͕υ͔-Ø͕σ͔+Œ͕π͔)e0457",
    ///     "+(-X͕q͔+Y͕g͔-Z͕c͔+a͔Ø͕+Ð͕φ͔-Þ͕σ͔+Œ͕ρ͔)e0467",
    ///     "+(+X͕p͔-Y͕f͔+Z͕b͔-a͔Ð͕+Ø͕φ͔-Þ͕υ͔+Œ͕τ͔)e0567",
    ///     "+a͔v͕e4567",
    ///     "+b͔v͕e3576",
    ///     "+c͔v͕e3467",
    ///     "+d͔v͕e3475",
    ///     "+e͔v͕e3456",
    ///     "+f͔v͕e2567",
    ///     "+g͔v͕e2476",
    ///     "+h͔v͕e2457",
    ///     "+i͔v͕e2465",
    ///     "+j͔v͕e2367",
    ///     "+k͔v͕e2375",
    ///     "+l͔v͕e2356",
    ///     "+m͔v͕e2347",
    ///     "+n͔v͕e2364",
    ///     "+o͔v͕e2345",
    ///     "+p͔v͕e1576",
    ///     "+q͔v͕e1467",
    ///     "+r͔v͕e1475",
    ///     "+s͔v͕e1456",
    ///     "+t͔v͕e1376",
    ///     "+u͔v͕e1357",
    ///     "+v͕á͔e1365",
    ///     "+v͕ä͔e1374",
    ///     "+v͕å͔e1346",
    ///     "+v͕æ͔e1354",
    ///     "+v͕ç͔e1267",
    ///     "+v͕é͔e1275",
    ///     "+v͕ë͔e1256",
    ///     "+v͕í͔e1247",
    ///     "+v͕ï͔e1264",
    ///     "+v͕ñ͔e1245",
    ///     "+v͕ó͔e1273",
    ///     "+v͕ö͔e1236",
    ///     "+v͕ú͔e1253",
    ///     "+v͕x͔e234567",
    ///     "+v͕y͔e134576",
    ///     "+v͕z͔e124567",
    ///     "+v͕ð͔e123576",
    ///     "+v͕ø͔e123467",
    ///     "+v͕þ͔e123475",
    ///     "+v͕œ͔e123456",
    ///     "+(+X͕y͔-Y͕x͔+Z͕a͔+b͔Ð͕+c͔Ø͕+d͔Þ͕+e͔Œ͕)e034567",
    ///     "+(+X͕z͔-Y͕a͔-Z͕x͔+f͔Ð͕+g͔Ø͕+h͔Þ͕+i͔Œ͕)e024576",
    ///     "+(+X͕ð͔-Y͕b͔-Z͕f͔+j͔Ø͕+k͔Þ͕+l͔Œ͕-x͔Ð͕)e023567",
    ///     "+(+X͕ø͔-Y͕c͔-Z͕g͔-j͔Ð͕+m͔Þ͕+n͔Œ͕-x͔Ø͕)e023476",
    ///     "+(+X͕þ͔-Y͕d͔-Z͕h͔-k͔Ð͕-m͔Ø͕+o͔Œ͕-x͔Þ͕)e023457",
    ///     "+(+X͕œ͔-Y͕e͔-Z͕i͔-l͔Ð͕-n͔Ø͕-o͔Þ͕-x͔Œ͕)e023465",
    ///     "+(+X͕a͔+Y͕z͔-Z͕y͔+p͔Ð͕+q͔Ø͕+r͔Þ͕+s͔Œ͕)e014567",
    ///     "+(+X͕b͔+Y͕ð͔-Z͕p͔+t͔Ø͕+u͔Þ͕-y͔Ð͕+á͔Œ͕)e013576",
    ///     "+(+X͕c͔+Y͕ø͔-Z͕q͔-t͔Ð͕-y͔Ø͕+Þ͕ä͔+å͔Œ͕)e013467",
    ///     "+(+X͕d͔+Y͕þ͔-Z͕r͔-u͔Ð͕-y͔Þ͕-Ø͕ä͔+æ͔Œ͕)e013475",
    ///     "+(+X͕e͔+Y͕œ͔-Z͕s͔-y͔Œ͕-Ð͕á͔-Ø͕å͔-Þ͕æ͔)e013456",
    ///     "+(+X͕f͔+Y͕p͔+Z͕ð͔-z͔Ð͕+Ø͕ç͔+Þ͕é͔+ë͔Œ͕)e012567",
    ///     "+(+X͕g͔+Y͕q͔+Z͕ø͔-z͔Ø͕-Ð͕ç͔+Þ͕í͔+ï͔Œ͕)e012476",
    ///     "+(+X͕h͔+Y͕r͔+Z͕þ͔-z͔Þ͕-Ð͕é͔-Ø͕í͔+ñ͔Œ͕)e012457",
    ///     "+(+X͕i͔+Y͕s͔+Z͕œ͔-z͔Œ͕-Ð͕ë͔-Ø͕ï͔-Þ͕ñ͔)e012465",
    ///     "+(+X͕j͔+Y͕t͔+Z͕ç͔+Ð͕ø͔-Ø͕ð͔+Þ͕ó͔+ö͔Œ͕)e012367",
    ///     "+(+X͕k͔+Y͕u͔+Z͕é͔+Ð͕þ͔-Ø͕ó͔-Þ͕ð͔+ú͔Œ͕)e012375",
    ///     "+(+X͕l͔+Y͕á͔+Z͕ë͔+Ð͕œ͔-Ø͕ö͔-Þ͕ú͔-ð͔Œ͕)e012356",
    ///     "+(+X͕m͔+Y͕ä͔+Z͕í͔+Ð͕ó͔+Ø͕þ͔-Þ͕ø͔+ü͔Œ͕)e012347",
    ///     "+(+X͕n͔+Y͕å͔+Z͕ï͔+Ð͕ö͔+Ø͕œ͔-Þ͕ü͔-ø͔Œ͕)e012364",
    ///     "+(+X͕o͔+Y͕æ͔+Z͕ñ͔+Ð͕ú͔+Ø͕ü͔+Þ͕œ͔-þ͔Œ͕)e012345",
    ///     "+(+X͕x͔+Y͕y͔+Z͕z͔+Ð͕ð͔+Ø͕ø͔+Þ͕þ͔+Œ͕œ͔)I",
    /// ]);
    ///
    /// let norm_squared = Vee::triple_motor().norm_squared();
    ///
    /// assert_eq!(norm_squared.basis_blades(), Vee::norm().basis_blades());
    /// format_eq!(norm_squared, [
    ///     "+aa+bb+cc+dd+ee+ff+gg+hh+ii+jj+kk+ll+mm+nn+oo+pp+qq+rr+ss+tt+uu+vv\
    ///      +xx+yy+zz+áá+ää+åå+ææ+çç+éé+ëë+íí+ïï+ðð+ññ+óó+öö+øø+úú+üü+þþ+œœ\
    ///      +αα+ββ+γγ+δδ+εε+ζζ+ηη+θθ+ιι+κκ+λλ+μμ+νν+ξξ+οο+ππ+ρρ+σσ+ττ+υυ+φφ",
    ///     "+2(-að+bz-cç-dé-eë-fy+gt+hu+iá-jq-kr-ls-mζ+nε-oδ+px\
    ///        +vü-äλ+åκ-æι-íο+ïξ-ñν-óσ+öρ+øφ-úπ-þυ+œτ-αμ+βθ-γη)e1234",
    ///     "+2(+Av+Bμ+Cν+Dξ+Eο-Fθ-Gι-Hκ-Iλ-Jo+Kn-Lm-Ml+Nk-Oj+Pγ\
    ///         +Qδ+Rε+Sζ-Tæ+Uå+Va-Xη+Yβ-Zα-bΜ-cΝ-dΞ-eΟ+fΘ+gΙ+hΚ\
    ///         +iΛ-pΓ-qΔ-rΕ-sΖ-tÆ+uÅ-xΗ+yΒ-zΑ-Áä-Äá-Çñ+Éï-Ëí-Íë\
    ///         +Ïé-Ðü-Ñç-Óœ+Öþ+Øú-Úø+Üð-Þö+óŒ+Πφ-Ρυ+Στ+Τσ-Υρ+Φπ)e0123",
    ///     "+2(-Aμ+Bv+Cπ+Dρ+Eσ+Fη+Go-Hn+Im-Jι-Kκ-Lλ+Mi-Nh+Og-Pβ\
    ///         +Qæ-Rå+Sä+Tδ+Uε+Vb-Xθ+Yγ+Zü+aΜ-cΠ-dΡ-eΣ-fΗ+jΙ+kΚ\
    ///         +lΛ+pΒ+qÆ-rÅ+sÄ-tΔ-uΕ-xΘ+yΓ-zÜ+Áζ-Çú+Éö-Ëó+Íœ-Ïþ\
    ///         -Ðα+Ñø-Óë+Öé-Øñ-Úç+Þï-áΖ-íŒ-ðΑ-Νφ+Ξυ-Οτ-Το+Υξ-Φν)e0124",
    ///     "+2(-Aν-Bπ+Cv+Dτ+Eυ-Fo+Gη+Hl-Ik+Jθ-Ki+Lh-Mκ-Nλ-Of-Pæ\
    ///         -Qβ+Rá-Su-Tγ-Us+Vc-Xι+Yδ-Zú+aΝ+bΠ-dΤ-eΥ-gΗ-jΘ+mΚ\
    ///         +nΛ-pÆ+qΒ+rÁ+tΓ-xΙ+yΔ+zÚ+Äε+Åζ-Çü-Éœ+Ëþ+Íö-Ïó+Ðñ\
    ///         -Ñð-Óï+Öí-Øα-Üç-Þë-äΕ-åΖ+éŒ-øΑ+Μφ-Ξσ+Ορ+Ρο-Σξ+Φμ)e0125",
    ///     "+2(-Aξ-Bρ-Cτ+Dv+Eφ+Fn-Gl+Hη+Ij+Ji+Kθ-Lg+Mι+Nf-Oλ+På\
    ///         -Qá-Rβ+St+Ts-Uγ+Vd-Xκ+Yε+Zö+aΞ+bΡ+cΤ-eΦ-hΗ-kΘ-mΙ\
    ///         +oΛ+pÅ-qÁ+rΒ+uΓ-xΚ+yΕ-zÖ-Äδ+Æζ+Çœ-Éü-Ëø+Íú+Ïð-Ðï\
    ///         -Ñó-Óñ+Øë+Úí-Üé-Þα+äΔ-æΖ-çŒ-þΑ-Μυ+Νσ-Οπ-Πο+Σν-Υμ)e0126",
    ///     "+2(-Aο-Bσ-Cυ-Dφ+Ev-Fm+Gk-Hj+Iη-Jh+Kg+Lθ-Mf+Nι+Oκ-Pä\
    ///         +Qu-Rt-Sβ-Tr+Uq+Ve-Xλ+Yζ-Zó+aΟ+bΣ+cΥ+dΦ-iΗ-lΘ-nΙ\
    ///         -oΚ-pÄ+sΒ-xΛ+yΖ+zÓ-Áγ-Åδ-Æε-Çþ+Éø-Ëü-Íð+Ïú+Ðí-Ñö\
    ///         -Öñ-Øé+Úï-Üë+Þç+áΓ+åΔ+æΕ-Œα-œΑ+Μτ-Νρ+Ξπ+Πξ-Ρν+Τμ)e0127",
    ///     "+2(+Aθ-Bη-Co+Dn-Em+Fv+Gπ+Hρ+Iσ-Jν-Kξ-Lο-Me+Nd-Oc+Pα\
    ///         +Qñ-Rï+Sí+Tú-Uö+Vf-Xμ-Yü+Zγ-aΘ+bΗ-gΠ-hΡ-iΣ+jΝ+kΞ\
    ///         +lΟ-pΑ+qÑ-rÏ+sÍ+tÚ-uÖ-xΜ+yÜ+zΓ+Áó-Äœ+Åþ-Æø+Çδ+Éε\
    ///         +Ëζ-Ðβ+Óá+Øæ-Þå+äŒ-çΔ-éΕ-ëΖ-ðΒ+Ιφ-Κυ+Λτ+Τλ-Υκ+Φι)e0134",
    ///     "+2(+Aι+Bo-Cη-Dl+Ek-Fπ+Gv+Hτ+Iυ+Jμ+Ke-Ld-Mξ-Nο+Ob-Pñ\
    ///         +Qα+Rë-Sé+Tü+Uœ+Vg-Xν+Yú+Zδ-aΙ+cΗ+fΠ-hΤ-iΥ-jΜ+mΞ\
    ///         +nΟ-pÑ-qΑ+rË-sÉ+tÜ-uŒ-xΝ-yÚ+zΔ-Áþ-Äö+Åó+Æð-Çγ+Íε\
    ///         +Ïζ-Ðæ+Óå-Öä-Øβ+Þá+çΓ-íΕ-ïΖ-øΒ-Θφ+Κσ-Λρ-Ρλ+Σκ-Φθ)e0135",
    ///     "+2(+Aκ-Bn+Cl-Dη-Ej-Fρ-Gτ+Hv+Iφ-Je+Kμ+Lc+Mν-Nb-Oο+Pï\
    ///         -Që+Rα+Sç-Tœ+Uü+Vh-Xξ-Yö+Zε-aΚ+dΗ+fΡ+gΤ-iΦ-kΜ-mΝ\
    ///         +oΟ+pÏ-qË-rΑ+sÇ+tŒ+uÜ-xΞ+yÖ+zΕ+Áø-Äú-Åð+Æó-Éγ-Íδ\
    ///         +Ðå+Ñζ+Óæ-Øá-Úä-Þβ+éΓ+íΔ-ñΖ-þΒ+Θυ-Ισ+Λπ+Πλ-Σι+Υθ)e0136",
    ///     "+2(+Aλ+Bm-Ck+Dj-Eη-Fσ-Gυ-Hφ+Iv+Jd-Kc+Lμ+Mb+Nν+Oξ-Pí\
    ///         +Qé-Rç+Sα+Tþ-Uø+Vi-Xο+Yó+Zζ-aΛ+eΗ+fΣ+gΥ+hΦ-lΜ-nΝ\
    ///         -oΞ-pÍ+qÉ-rÇ-sΑ-tÞ+uØ-xΟ-yÓ+zΖ+Áü+Äð-Åú+Æö-Ëγ-Ïδ\
    ///         -Ðä-Ñε+Öæ-Úå+Üá+ëΓ+ïΔ+ñΕ-Œβ-œΒ-Θτ+Ιρ-Κπ-Πκ+Ρι-Τθ)e0137",
    ///     "+2(-Ao+Bι-Cθ+Di-Eh+Fν-Gμ-He+Id+Jv+Kτ+Lυ-Mρ-Nσ-Oa-Pú\
    ///         -Qü-Rœ+Sþ+Tα+Uë+Vj-Xπ-Yñ+Zæ-bΙ+cΘ-fΝ+gΜ-kΤ-lΥ+mΡ\
    ///         +nΣ-pÚ-qÜ+rŒ-sÞ-tΑ+uË-xΠ+yÑ-zÆ-Áé+Äï-Åí+Çβ-Éá-Íå\
    ///         +Ïä+Ðδ+Óε+Öζ-Øγ-çΒ+ðΔ-óΕ-öΖ-øΓ+Ηφ-Κο+Λξ+Ξλ-Οκ+Φη)e0145",
    ///     "+2(+An+Bκ-Ci-Dθ+Eg+Fξ+Ge-Hμ-Ic-Jτ+Kv+Lφ+Mπ+Na-Oσ+Pö\
    ///         +Qœ-Rü-Sø-Të+Uα+Vk-Xρ+Yï-Zå-bΚ+dΘ-fΞ+hΜ+jΤ-lΦ-mΠ\
    ///         +oΣ+pÖ-qŒ-rÜ+sØ-tË-uΑ-xΡ-yÏ+zÅ+Áç+Äñ-Æí+Çá+Éβ-Íæ\
    ///         +Ðε+Ñä-Óδ+Úζ-Þγ-éΒ+ðΕ+óΔ-úΖ-þΓ-Ηυ+Ιο-Λν-Νλ+Οι-Υη)e0146",
    ///     "+2(-Am+Bλ+Ch-Dg-Eθ+Fο-Gd+Hc-Iμ-Jυ-Kφ+Lv-Ma+Nπ+Oρ-Pó\
    ///         -Qþ+Rø-Sü+Té-Uç+Vl-Xσ-Yí+Zä-bΛ+eΘ-fΟ+iΜ+jΥ+kΦ-nΠ\
    ///         -oΡ-pÓ+qÞ-rØ-sÜ+tÉ-uÇ-xΣ+yÍ-zÄ+Áα+Åñ-Æï+Ëβ-Ïæ+Ðζ\
    ///         +Ñå-Öδ-Úε-áΑ-ëΒ+ðΖ+öΔ+úΕ-Œγ-œΓ+Ητ-Ιξ+Κν+Νκ-Ξι+Τη)e0147",
    ///     "+2(-Al+Bi+Cκ-Dι-Ef-Fe+Gξ-Hν+Ib+Jρ-Kπ-La+Mv+Nφ-Oυ-Pœ\
    ///         +Qö+Rú+Sð-Tï-Uñ+Vm-Xτ-Yë+Zá-cΚ+dΙ-gΞ+hΝ-jΡ+kΠ-nΦ\
    ///         +oΥ+pŒ+qÖ+rÚ-sÐ-tÏ-uÑ-xΤ+yË-zÁ+Äα+Åç+Æé+Çå+Éæ+Íβ\
    ///         +Óγ+Øε+Üζ-Þδ-äΑ-íΒ-óΓ+øΕ-üΖ-þΔ+Ησ-Θο+Λμ+Μλ-Οθ+Ση)e0156",
    ///     "+2(+Ak-Bh+Cλ+Df-Eι+Fd+Gο-Hb-Iν+Jσ+Ka-Lπ-Mφ+Nv+Oτ+Pþ\
    ///         -Qó-Rð+Sú+Tí+Uz+Vn-Xυ+Yé-Zu-cΛ+eΙ-gΟ+iΝ-jΣ+lΠ+mΦ\
    ///         -oΤ-pÞ-qÓ+rÐ+sÚ+tÍ-xΥ-yÉ-Áñ-Äç+Åα+Æë-Çä+Ëæ+Ïβ-Ñá\
    ///         +Öγ+Øζ-Üε-åΑ-ïΒ-öΓ+øΖ+üΕ-Œδ-œΔ-Ηρ+Θξ-Κμ-Μκ+Ξθ-Ρη)e0157",
    ///     "+2(-Aj+Bg-Cf+Dλ-Eκ-Fc+Gb+Hο-Iξ-Ja+Kσ-Lρ+Mυ-Nτ+Ov-Pø\
    ///         +Qð-Ró-Sö-Tz+Uí+Vo-Xφ-Yç+Zt-dΛ+eΚ-hΟ+iΞ-kΣ+lΡ-mΥ\
    ///         +nΤ+pØ-qÐ-rÓ-sÖ+uÍ-xΦ+yÇ+Áï-Äé-Åë+Æα-Éä-Ëå+Ïá+Ñβ\
    ///         +Úγ+Üδ+Þζ-æΑ-ñΒ-úΓ-üΔ+þΖ-Œε-œΕ+Ηπ-Θν+Ιμ+Μι-Νθ+Πη)e0167",
    ///     "+2(-Aγ+Bβ-Cæ+Då-Eä-Fα-Gñ+Hï-Ií-Jú+Kö-Ló+Mœ-Nþ+Oø+Pv\
    ///         +Qπ+Rρ+Sσ-Tν-Uξ+Vp+Xü-Yμ+Zθ+aΓ-bΒ-cÆ+dÅ-eÄ+fΑ-gÑ\
    ///         +hÏ-iÍ-jÚ+kÖ-lÓ-mŒ+nÞ-oØ-qΠ-rΡ-sΣ+tΝ+uΞ-xÜ-yΜ+zΘ\
    ///         -Áο+Çι+Éκ+Ëλ-Ðη+áΟ-çΙ-éΚ-ëΛ-ðΗ-Δφ+Ευ-Ζτ-Τζ+Υε-Φδ)e0234",
    ///     "+2(-Aδ+Bæ+Cβ-Dá+Eu+Fñ-Gα-Hë+Ié-Jü-Kœ+Lþ+Mö-Nó-Oð-Pπ\
    ///         +Qv+Rτ+Sυ+Tμ+Ue+Vq-Xú-Yν+Zι+aΔ+bÆ-cΒ-dÁ+fÑ+gΑ-hË\
    ///         +iÉ-jÜ+kŒ-lÞ+mÖ-nÓ+oÐ+pΠ-rΤ-sΥ-tΜ+xÚ-yΝ+zΙ-Äξ-Åο\
    ///         -Çθ+Íκ+Ïλ-Øη+äΞ+åΟ+çΘ-íΚ-ïΛ-øΗ+Γφ-Εσ+Ζρ+Ρζ-Σε+Φγ)e0235",
    ///     "+2(-Aε-Bå+Cá+Dβ-Et-Fï+Gë-Hα-Iç+Jœ-Kü-Lø+Mú+Nð-Oó-Pρ\
    ///         -Qτ+Rv+Sφ-Te+Uμ+Vr+Xö-Yξ+Zκ+aΕ-bÅ+cÁ-dΒ-fÏ+gË+hΑ\
    ///         -iÇ-jŒ-kÜ+lØ+mÚ-nÐ-oÓ+pΡ+qΤ-sΦ-uΜ-xÖ-yΞ+zΚ+Äν-Æο\
    ///         -Éθ-Íι+Ñλ-Þη-äΝ+æΟ+éΘ+íΙ-ñΛ-þΗ-Γυ+Δσ-Ζπ-Πζ+Σδ-Υγ)e0236",
    ///     "+2(-Aζ+Bä-Cu+Dt+Eβ+Fí-Gé+Hç-Iα-Jþ+Kø-Lü-Mð+Nú-Oö-Pσ\
    ///         -Qυ-Rφ+Sv+Td-Uc+Vs-Xó-Yο+Zλ+aΖ+bÄ-eΒ+fÍ-gÉ+hÇ+iΑ\
    ///         +jÞ-kØ-lÜ+mÐ+nÚ-oÖ+pΣ+qΥ+rΦ+xÓ-yΟ+zΛ+Áμ+Åν+Æξ-Ëθ\
    ///         -Ïι-Ñκ-áΜ-åΝ-æΞ+ëΘ+ïΙ+ñΚ-Œη-œΗ+Γτ-Δρ+Επ+Πε-Ρδ+Τγ)e0237",
    ///     "+2(-Aæ-Bδ+Cγ+Ds-Er+Fú+Gü+Hœ-Iþ-Jα-Kë+Lé-Mï+Ní+Oz+Pν\
    ///         -Qμ-Re+Sd+Tv+Uτ+Vt+Xñ-Yπ-Zo-aÆ+bΔ-cΓ+fÚ+gÜ-hŒ+iÞ\
    ///         +jΑ-kË+lÉ-mÏ+nÍ-pΝ+qΜ-uΤ-xÑ-yΠ+Áυ-Äρ-Åσ+Çη+Ðι+Óκ\
    ///         +Öλ-Øθ-áΥ+äΡ+åΣ-çΗ+ðΙ-óΚ-öΛ-øΘ-Βφ+Εο-Ζξ-Ξζ+Οε-Φβ)e0245",
    ///     "+2(+Aå-Bε-Cs+Dγ+Eq-Fö-Gœ+Hü+Iø+Jë-Kα-Lç-Mñ-Nz+Oí+Pξ\
    ///         +Qe-Rμ-Sc-Tτ+Uv+Vu-Xï-Yρ+Zn+aÅ+bΕ-dΓ-fÖ+gŒ+hÜ-iØ\
    ///         +jË+kΑ-lÇ-mÑ+oÍ-pΞ+rΜ+tΤ+xÏ-yΡ+Áφ+Äπ-Æσ+Éη+Ðκ-Óι\
    ///         +Úλ-Þθ-áΦ-äΠ+æΣ-éΗ+ðΚ+óΙ-úΛ-þΘ+Βυ-Δο+Ζν+Νζ-Οδ+Υβ)e0246",
    ///     "+2(-Aä-Bζ+Cr-Dq+Eγ+Fó+Gþ-Hø+Iü-Jé+Kç-Lα+Mz-Nñ+Oï+Pο\
    ///         -Qd+Rc-Sμ-Tυ-Uφ+Vá+Xí-Yσ-Zm-aÄ+bΖ-eΓ+fÓ-gÞ+hØ+iÜ\
    ///         -jÉ+kÇ+lΑ-nÑ+oÏ-pΟ+sΜ+tΥ+uΦ+vÁ-xÍ-yΣ+Åπ+Æρ+Ëη+Ðλ\
    ///         -Öι-Úκ-åΠ-æΡ-ëΗ+ðΛ+öΙ+úΚ-Œθ-œΘ-Βτ+Δξ-Εν-Νε+Ξδ-Τβ)e0247",
    ///     "+2(-Aá+Bs-Cε+Dδ-Ep+Fœ-Gö-Hú-Ið+Jï+Kñ+Lz-Mα-Nç-Oé-Pe\
    ///         +Qξ-Rν+Sb+Tρ-Uπ+Vä+Xë-Yτ-Zl-aÁ+cΕ-dΔ-fŒ-gÖ-hÚ+iÐ\
    ///         +jÏ+kÑ+mΑ-nÇ-oÉ-qΞ+rΝ-tΡ+uΠ+vÄ-xË-yΤ+Åφ-Æυ+Íη+Óθ\
    ///         +Øκ+Üλ-Þι-åΦ+æΥ-íΗ-óΘ+øΚ-üΛ-þΙ-Βσ+Γο-Ζμ-Μζ+Ογ-Σβ)e0256",
    ///     "+2(+Au-Br-Cζ+Dp+Eδ-Fþ+Gó+Hð-Iú-Jí-Kz+Lñ+Mç-Nα-Oë+Pd\
    ///         +Qο-Rb-Sν+Tσ+Ua+Vå-Xé-Yυ+Zk+cΖ-eΔ+fÞ+gÓ-hÐ-iÚ-jÍ\
    ///         +lÑ+mÇ+nΑ-oË-qΟ+sΝ-tΣ+vÅ+xÉ-yΥ-Áπ-Äφ+Æτ+Ïη+Öθ+Øλ\
    ///         -Üκ+áΠ+äΦ-æΤ-ïΗ-öΘ+øΛ+üΚ-Œι-œΙ+Βρ-Γξ+Εμ+Με-Ξγ+Ρβ)e0257",
    ///     "+2(-At+Bq-Cp-Dζ+Eε+Fø-Gð+Hó+Iö+Jz-Kí-Lï+Mé+Në-Oα-Pc\
    ///         +Qb+Rο-Sξ-Ta+Uσ+Væ+Xç-Yφ-Zj+dΖ-eΕ-fØ+gÐ+hÓ+iÖ-kÍ\
    ///         -lÏ+mÉ+nË+oΑ-rΟ+sΞ-uΣ+vÆ-xÇ-yΦ-Áρ+Äυ-Åτ+Ñη+Úθ+Üι\
    ///         +Þλ+áΡ-äΥ+åΤ-ñΗ-úΘ-üΙ+þΛ-Œκ-œΚ-Βπ+Γν-Δμ-Μδ+Νγ-Πβ)e0267",
    ///     "+2(-Añ-Bú-Cü-Dœ+Eþ-Fδ+Gγ+Hs-Ir-Jβ+Ká-Lu+Må-Nä-Oy-Pι\
    ///         +Qθ-Ri+Sh-Tη-Ul+Vç-Xæ+Yo-Zπ-aÑ-bÚ-cÜ+dŒ-eÞ+fΔ-gΓ\
    ///         +jΒ+kÁ+mÅ-nÄ+pΙ-qΘ+tΗ+vÇ+xÆ-zΠ+Éτ+Ëυ-Íρ-Ïσ+Ðν+Óξ\
    ///         +Öο-Øμ-éΤ-ëΥ+íΡ+ïΣ+ðΝ-óΞ-öΟ-øΜ+Αφ-Ελ+Ζκ+Κζ-Λε+Φα)e0345",
    ///     "+2(+Aï+Bö+Cœ-Dü-Eø-Fε-Gs+Hγ+Iq-Já-Kβ+Lt+Mæ+Ny-Oä-Pκ\
    ///         +Qi+Rθ-Sg+Tl-Uη+Vé+Xå-Yn-Zρ+aÏ+bÖ-cŒ-dÜ+eØ+fΕ-hΓ\
    ///         -jÁ+kΒ+mÆ-oÄ+pΚ-rΘ+uΗ+vÉ-xÅ-zΡ-Çτ+Ëφ+Íπ+Ðξ-Ñσ-Óν\
    ///         +Úο-Þμ+çΤ-ëΦ-íΠ+ðΞ+ñΣ+óΝ-úΟ-þΜ-Αυ+Δλ-Ζι-Ιζ+Λδ-Υα)e0346",
    ///     "+2(-Aí-Bó-Cþ+Dø-Eü-Fζ+Gr-Hq+Iγ+Ju-Kt-Lβ-My+Næ-Oå-Pλ\
    ///         -Qh+Rg+Sθ-Tk+Uj+Vë-Xä+Ym-Zσ-aÍ-bÓ+cÞ-dØ-eÜ+fΖ-iΓ\
    ///         +lΒ+nÆ-oÅ+pΛ-sΘ+vË+xÄ-zΣ-Áη-Çυ-Éφ+Ïπ+Ðο+Ñρ-Öν-Úξ\
    ///         +áΗ+çΥ+éΦ-ïΠ+ðΟ-ñΡ+öΝ+úΞ-Œμ-œΜ+Ατ-Δκ+Ει+Ιε-Κδ+Τα)e0347",
    ///     "+2(-Aë-Bœ+Cö+Dú+Eð+Fs-Gε+Hδ-Ip-Jå-Kæ-Ly-Mβ+Nt+Ou-Pi\
    ///         -Qκ+Rι+Sf+Tn+Uo+Ví-Xá+Yl-Zτ-aË+bŒ+cÖ+dÚ-eÐ+gΕ-hΔ\
    ///         -jÅ-kÆ+mΒ+qΚ-rΙ+vÍ+xÁ-zΤ-Äη+Çρ-Éπ+Ïφ-Ñυ+Óμ+Øξ+Üο\
    ///         -Þν+äΗ-çΡ+éΠ-ïΦ+ñΥ-óΜ+øΞ-üΟ-þΝ+Ασ-Γλ+Ζθ+Θζ-Λγ+Σα)e0356",
    ///     "+2(+Aé+Bþ-Có-Dð+Eú-Fr-Gζ+Hp+Iδ+Jä+Ky-Læ-Mt-Nβ+Oá+Ph\
    ///         -Qλ-Rf+Sι-Tm-Ux+Vï+Xu-Yk-Zυ+aÉ-bÞ-cÓ+dÐ+eÚ+gΖ-iΔ\
    ///         +jÄ-lÆ+nΒ+oÁ+qΛ-sΙ+vÏ-zΥ-Åη+Çσ-Ëπ-Íφ+Ñτ+Öμ+Øο-Üξ\
    ///         +åΗ-çΣ+ëΠ+íΦ-ñΤ-öΜ+øΟ+üΞ-Œν-œΝ-Αρ+Γκ-Εθ-Θε+Κγ-Ρα)e0357",
    ///     "+2(-Aç-Bø+Cð-Dó-Eö+Fq-Gp-Hζ+Iε-Jy+Kä+Lå-Mu-Ná-Oβ-Pg\
    ///         +Qf-Rλ+Sκ+Tx-Um+Vñ-Xt+Yj-Zφ-aÇ+bØ-cÐ-dÓ-eÖ+hΖ-iΕ\
    ///         +kÄ+lÅ-nÁ+oΒ+rΛ-sΚ+vÑ-zΦ-Æη+Éσ-Ëρ+Íυ-Ïτ+Úμ+Üν+Þο\
    ///         +æΗ-éΣ+ëΡ-íΥ+ïΤ-úΜ-üΝ+þΟ-Œξ-œΞ+Απ-Γι+Δθ+Θδ-Ιγ+Πα)e0367",
    ///     "+2(+Aœ-Bë-Cï-Dñ-Ez+Fá+Gå+Hæ+Iy-Jε+Kδ-Lp-Mγ-Nq-Or-Pl\
    ///         -Qn-Ro-Sx-Tκ+Uι+Vó+Xs-Yi+Ze-aŒ-bË-cÏ-dÑ+fÁ+gÅ+hÆ\
    ///         +jΕ-kΔ+mΓ+tΚ-uΙ+vÓ-Äθ-Çξ+Éν-Íμ-Ðτ+Öφ+Øρ-Úυ+Üσ-Þπ\
    ///         +äΘ+çΞ-éΝ+íΜ-ðΤ-öΦ+øΡ+úΥ-üΣ-þΠ-Αο+Βλ-Ζη-Ηζ+Λβ-Οα)e0456",
    ///     "+2(-Aþ+Bé+Cí+Dz-Eñ-Fu-Gä-Hy+Iæ-Jζ+Kp+Lδ+Mq-Nγ-Os+Pk\
    ///         +Qm+Rx-So-Tλ-Uf+Vö-Xr+Yh-Zd+aÞ+bÉ+cÍ-eÑ-gÄ+iÆ+jΖ\
    ///         -lΔ+nΓ+tΛ+vÖ+Áι-Åθ-Çο+Ëν-Ïμ-Ðυ-Óφ+Øσ+Úτ-Üρ-áΙ+åΘ\
    ///         +çΟ-ëΝ+ïΜ-ðΥ+óΦ+øΣ-úΤ+üΡ-Œπ-œΠ+Αξ-Βκ+Εη+Ηε-Κβ+Ξα)e0457",
    ///     "+2(+Aø-Bç-Cz+Dí+Eï+Ft+Gy-Hä-Iå-Jp-Kζ+Lε+Mr+Ns-Oγ-Pj\
    ///         -Qx+Rm+Sn+Tf-Uλ+Vú+Xq-Yg+Zc-aØ-bÇ+dÍ+eÏ-hÄ-iÅ+kΖ\
    ///         -lΕ+oΓ+uΛ+vÚ+Áκ-Æθ-Éο+Ëξ-Ðφ-Ñμ+Óυ-Öτ+Üπ+Þσ-áΚ+æΘ\
    ///         +éΟ-ëΞ-ðΦ+ñΜ-óΥ+öΤ-üΠ+þΣ-Œρ-œΡ-Αν+Βι-Δη-Ηδ+Ιβ-Να)e0467",
    ///     "+2(-Að+Bz-Cç-Dé-Eë-Fy+Gt+Hu+Iá-Jq-Kr-Ls-Mζ+Nε-Oδ+Px\
    ///         -Qj-Rk-Sl+Tg+Uh+Vü-Xp+Yf-Zb+aÐ-cÇ-dÉ-eË+iÁ+mΖ-nΕ\
    ///         +oΔ+vÜ-Äλ+Åκ-Æι-Íο+Ïξ-Ñν-Óσ+Öρ-Øφ-Úπ+Þυ+äΛ-åΚ+æΙ\
    ///         +íΟ-ïΞ+ñΝ+óΣ-öΡ-øΦ+úΠ+þΥ-Œτ-œΤ+Αμ-Βθ+Γη+Ηγ-Θβ+Μα)e0567",
    ///     "+2(+av+bμ+cν+dξ+eο-fθ-gι-hκ-iλ-jo+kn-lm+pγ+qδ+rε+sζ\
    ///         -tæ+uå+xη-yβ+zα-áä-çñ+éï-ëí+ðü-óœ+öþ-øú-πφ+ρυ-στ)e4567",
    ///     "+2(-aμ+bv+cπ+dρ+eσ+fη+go-hn+im-jι-kκ-lλ-pβ+qæ-rå+sä\
    ///         +tδ+uε+xθ-yγ-zü+áζ-çú+éö-ëó+íœ-ïþ+ðα+ñø+νφ-ξυ+οτ)e3576",
    ///     "+2(-aν-bπ+cv+dτ+eυ-fo+gη+hl-ik+jθ-mκ-nλ-pæ-qβ+rá-su\
    ///         -tγ+xι-yδ+zú+äε+åζ-çü-éœ+ëþ+íö-ïó-ðñ+øα-μφ+ξσ-ορ)e3467",
    ///     "+2(-aξ-bρ-cτ+dv+eφ+fn-gl+hη+ij+kθ+mι-oλ+på-qá-rβ+st\
    ///         -uγ+xκ-yε-zö-äδ+æζ+çœ-éü-ëø+íú+ïð-ñó+þα+μυ-νσ+οπ)e3475",
    ///     "+2(-aο-bσ-cυ-dφ+ev-fm+gk-hj+iη+lθ+nι+oκ-pä+qu-rt-sβ\
    ///         +xλ-yζ+zó-áγ-åδ-æε-çþ+éø-ëü-íð+ïú-ñö+œα-μτ+νρ-ξπ)e3456",
    ///     "+2(+aθ-bη-co+dn-em+fv+gπ+hρ+iσ-jν-kξ-lο+pα+qñ-rï+sí\
    ///         +tú-uö+xμ+yü-zγ+áó-äœ+åþ-æø+çδ+éε+ëζ+ðβ-ιφ+κυ-λτ)e2567",
    ///     "+2(+aι+bo-cη-dl+ek-fπ+gv+hτ+iυ+jμ-mξ-nο-pñ+qα+rë-sé\
    ///         +tü+uœ+xν-yú-zδ-áþ-äö+åó+æð-çγ+íε+ïζ+øβ+θφ-κσ+λρ)e2476",
    ///     "+2(+aκ-bn+cl-dη-ej-fρ-gτ+hv+iφ+kμ+mν-oο+pï-që+rα+sç\
    ///         -tœ+uü+xξ+yö-zε+áø-äú-åð+æó-éγ-íδ+ñζ+þβ-θυ+ισ-λπ)e2457",
    ///     "+2(+aλ+bm-ck+dj-eη-fσ-gυ-hφ+iv+lμ+nν+oξ-pí+qé-rç+sα\
    ///         +tþ-uø+xο-yó-zζ+áü+äð-åú+æö-ëγ-ïδ-ñε+œβ+θτ-ιρ+κπ)e2465",
    ///     "+2(-ao+bι-cθ+di-eh+fν-gμ+jv+kτ+lυ-mρ-nσ-pú-qü-rœ+sþ\
    ///         +tα+uë+xπ+yñ-zæ-áé+äï-åí+çβ-ðδ+óε+öζ+øγ-ηφ+κο-λξ)e2367",
    ///     "+2(+an+bκ-ci-dθ+eg+fξ-hμ-jτ+kv+lφ+mπ-oσ+pö+qœ-rü-sø\
    ///         -të+uα+xρ-yï+zå+áç+äñ-æí+éβ-ðε-óδ+úζ+þγ+ηυ-ιο+λν)e2375",
    ///     "+2(-am+bλ+ch-dg-eθ+fο-iμ-jυ-kφ+lv+nπ+oρ-pó-qþ+rø-sü\
    ///         +té-uç+xσ+yí-zä+áα+åñ-æï+ëβ-ðζ-öδ-úε+œγ-ητ+ιξ-κν)e2356",
    ///     "+2(-al+bi+cκ-dι-ef+gξ-hν+jρ-kπ+mv+nφ-oυ-pœ+qö+rú+sð\
    ///         -tï-uñ+xτ+yë-zá+äα+åç+æé+íβ+óγ-øε+üζ+þδ-ησ+θο-λμ)e2347",
    ///     "+2(+ak-bh+cλ+df-eι+gο-iν+jσ-lπ-mφ+nv+oτ+pþ-qó-rð+sú\
    ///         +tí+uz+xυ-yé-áñ-äç+åα+æë+ïβ+öγ-øζ-üε+œδ+ηρ-θξ+κμ)e2364",
    ///     "+2(-aj+bg-cf+dλ-eκ+hο-iξ+kσ-lρ+mυ-nτ+ov-pø+qð-ró-sö\
    ///         -tz+uí+xφ+yç+áï-äé-åë+æα+ñβ+úγ+üδ-þζ+œε-ηπ+θν-ιμ)e2345",
    ///     "+2(-aγ+bβ-cæ+då-eä-fα-gñ+hï-ií-jú+kö-ló+mœ-nþ+oø+pv\
    ///         +qπ+rρ+sσ-tν-uξ-xü+yμ-zθ-áο+çι+éκ+ëλ+ðη+δφ-ευ+ζτ)e1576",
    ///     "+2(-aδ+bæ+cβ-dá+eu+fñ-gα-hë+ié-jü-kœ+lþ+mö-nó-oð-pπ\
    ///         +qv+rτ+sυ+tμ+xú+yν-zι-äξ-åο-çθ+íκ+ïλ+øη-γφ+εσ-ζρ)e1467",
    ///     "+2(-aε-bå+cá+dβ-et-fï+gë-hα-iç+jœ-kü-lø+mú+nð-oó-pρ\
    ///         -qτ+rv+sφ+uμ-xö+yξ-zκ+äν-æο-éθ-íι+ñλ+þη+γυ-δσ+ζπ)e1475",
    ///     "+2(-aζ+bä-cu+dt+eβ+fí-gé+hç-iα-jþ+kø-lü-mð+nú-oö-pσ\
    ///         -qυ-rφ+sv+xó+yο-zλ+áμ+åν+æξ-ëθ-ïι-ñκ+œη-γτ+δρ-επ)e1456",
    ///     "+2(-aæ-bδ+cγ+ds-er+fú+gü+hœ-iþ-jα-kë+lé-mï+ní+oz+pν\
    ///         -qμ+tv+uτ-xñ+yπ+áυ-äρ-åσ+çη-ðι+óκ+öλ+øθ+βφ-εο+ζξ)e1376",
    ///     "+2(+aå-bε-cs+dγ+eq-fö-gœ+hü+iø+jë-kα-lç-mñ-nz+oí+pξ\
    ///         -rμ-tτ+uv+xï+yρ+áφ+äπ-æσ+éη-ðκ-óι+úλ+þθ-βυ+δο-ζν)e1357",
    ///     "+2(-aä-bζ+cr-dq+eγ+fó+gþ-hø+iü-jé+kç-lα+mz-nñ+oï+pο\
    ///         -sμ-tυ-uφ+vá-xí+yσ+åπ+æρ+ëη-ðλ-öι-úκ+œθ+βτ-δξ+εν)e1365",
    ///     "+2(-aá+bs-cε+dδ-ep+fœ-gö-hú-ið+jï+kñ+lz-mα-nç-oé+qξ\
    ///         -rν+tρ-uπ+vä-xë+yτ+åφ-æυ+íη+óθ-øκ+üλ+þι+βσ-γο+ζμ)e1374",
    ///     "+2(+au-br-cζ+dp+eδ-fþ+gó+hð-iú-jí-kz+lñ+mç-nα-oë+qο\
    ///         -sν+tσ+vå+xé+yυ-áπ-äφ+æτ+ïη+öθ-øλ-üκ+œι-βρ+γξ-εμ)e1346",
    ///     "+2(-at+bq-cp-dζ+eε+fø-gð+hó+iö+jz-kí-lï+mé+në-oα+rο\
    ///         -sξ+uσ+væ-xç+yφ-áρ+äυ-åτ+ñη+úθ+üι-þλ+œκ+βπ-γν+δμ)e1354",
    ///     "+2(-añ-bú-cü-dœ+eþ-fδ+gγ+hs-ir-jβ+ká-lu+må-nä-oy-pι\
    ///         +qθ-tη+vç+xæ+zπ+éτ+ëυ-íρ-ïσ-ðν+óξ+öο+øμ-αφ+ελ-ζκ)e1267",
    ///     "+2(+aï+bö+cœ-dü-eø-fε-gs+hγ+iq-já-kβ+lt+mæ+ny-oä-pκ\
    ///         +rθ-uη+vé-xå+zρ-çτ+ëφ+íπ-ðξ-ñσ-óν+úο+þμ+αυ-δλ+ζι)e1275",
    ///     "+2(-aí-bó-cþ+dø-eü-fζ+gr-hq+iγ+ju-kt-lβ-my+næ-oå-pλ\
    ///         +sθ+vë+xä+zσ-áη-çυ-éφ+ïπ-ðο+ñρ-öν-úξ+œμ-ατ+δκ-ει)e1256",
    ///     "+2(-aë-bœ+cö+dú+eð+fs-gε+hδ-ip-jå-kæ-ly-mβ+nt+ou-qκ\
    ///         +rι+ví+xá+zτ-äη+çρ-éπ+ïφ-ñυ+óμ-øξ+üο+þν-ασ+γλ-ζθ)e1247",
    ///     "+2(+aé+bþ-có-dð+eú-fr-gζ+hp+iδ+jä+ky-læ-mt-nβ+oá-qλ\
    ///         +sι-ux+vï+zυ-åη+çσ-ëπ-íφ+ñτ+öμ-øο-üξ+œν+αρ-γκ+εθ)e1264",
    ///     "+2(-aç-bø+cð-dó-eö+fq-gp-hζ+iε-jy+kä+lå-mu-ná-oβ-rλ\
    ///         +sκ+tx+vñ+zφ-æη+éσ-ëρ+íυ-ïτ+úμ+üν-þο+œξ-απ+γι-δθ)e1245",
    ///     "+2(+aœ-bë-cï-dñ-ez+fá+gå+hæ+iy-jε+kδ-lp-mγ-nq-or-sx\
    ///         -tκ+uι+vó-äθ-çξ+éν-íμ+ðτ+öφ-øρ-úυ+üσ+þπ+αο-βλ+ζη)e1273",
    ///     "+2(-aþ+bé+cí+dz-eñ-fu-gä-hy+iæ-jζ+kp+lδ+mq-nγ-os+rx\
    ///         -tλ+vö+áι-åθ-çο+ëν-ïμ+ðυ-óφ-øσ+úτ-üρ+œπ-αξ+βκ-εη)e1236",
    ///     "+2(+aø-bç-cz+dí+eï+ft+gy-hä-iå-jp-kζ+lε+mr+ns-oγ-qx\
    ///         -uλ+vú+áκ-æθ-éο+ëξ+ðφ-ñμ+óυ-öτ+üπ-þσ+œρ+αν-βι+δη)e1253",
    ///     "+2(+Aa+Bb+Cc+Dd+Ee+Ff+Gg+Hh+Ii+Jj+Kk+Ll+Mm+Nn+Oo+Pp\
    ///         +Qq+Rr+Ss+Tt+Uu+Vv-Xx-Yy-Zz+Áá+Ää+Åå+Ææ+Çç+Éé+Ëë\
    ///         +Íí+Ïï-Ðð+Ññ+Óó+Öö-Øø+Úú+Üü-Þþ-Œœ-Αα-Ββ-Γγ-Δδ-Εε\
    ///         -Ζζ-Ηη-Θθ-Ιι-Κκ-Λλ-Μμ-Νν-Ξξ-Οο-Ππ-Ρρ-Σσ-Ττ-Υυ-Φφ)I",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn triple_motor() -> Self {
        Self::scalar() + Self::volume5() + Self::volume() + Self::line() + Self::pseudoscalar()
    }
    /// The multivector of single rotoreflector $`r_1 \equiv v^6 + v^4`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let single_rotoreflector = Vee::volume6().lhs() * Vee::single_rotator().rhs();
    ///
    /// assert_eq!(
    ///     single_rotoreflector.basis_blades(),
    ///     Vee::single_rotoreflector().basis_blades()
    /// );
    /// format_eq!(single_rotoreflector, [
    ///     "+W͔v͕e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+W͔α͕e012",
    ///     "+W͔β͕e013",
    ///     "+W͔γ͕e014",
    ///     "+W͔δ͕e015",
    ///     "+W͔ε͕e016",
    ///     "+W͔ζ͕e017",
    ///     "+W͔η͕e023",
    ///     "+W͔θ͕e024",
    ///     "+W͔ι͕e025",
    ///     "+W͔κ͕e026",
    ///     "+W͔λ͕e027",
    ///     "+W͔μ͕e034",
    ///     "+W͔ν͕e035",
    ///     "+W͔ξ͕e036",
    ///     "+W͔ο͕e037",
    ///     "+W͔π͕e045",
    ///     "+W͔ρ͕e046",
    ///     "+W͔σ͕e047",
    ///     "+W͔τ͕e056",
    ///     "+W͔υ͕e057",
    ///     "+W͔φ͕e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+ð͔α͕)e124",
    ///     "+(+x͔ι͕-y͔δ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕+œ͔α͕)e127",
    ///     "+(+x͔μ͕-z͔γ͕+ð͔β͕)e134",
    ///     "+(+x͔ν͕-z͔δ͕+ø͔β͕)e135",
    ///     "+(+x͔ξ͕-z͔ε͕+þ͔β͕)e136",
    ///     "+(+x͔ο͕-z͔ζ͕+œ͔β͕)e137",
    ///     "+(+x͔π͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(+x͔ρ͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+x͔σ͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+x͔τ͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+x͔υ͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+x͔φ͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_rotoreflector() -> Self {
        Self::volume6() + Self::volume4()
    }
    /// The multivector of double rotoreflector $`r_2 \equiv v^6 + v^4 + p`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let double_rotoreflector = Vee::volume6().lhs() * Vee::double_rotator().rhs();
    ///
    /// assert_eq!(
    ///     double_rotoreflector.basis_blades(),
    ///     Vee::double_rotoreflector().basis_blades()
    /// );
    /// format_eq!(double_rotoreflector, [
    ///     "+W͔v͕e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+W͔α͕e012",
    ///     "+W͔β͕e013",
    ///     "+W͔γ͕e014",
    ///     "+W͔δ͕e015",
    ///     "+W͔ε͕e016",
    ///     "+W͔ζ͕e017",
    ///     "+W͔η͕e023",
    ///     "+W͔θ͕e024",
    ///     "+W͔ι͕e025",
    ///     "+W͔κ͕e026",
    ///     "+W͔λ͕e027",
    ///     "+W͔μ͕e034",
    ///     "+W͔ν͕e035",
    ///     "+W͔ξ͕e036",
    ///     "+W͔ο͕e037",
    ///     "+W͔π͕e045",
    ///     "+W͔ρ͕e046",
    ///     "+W͔σ͕e047",
    ///     "+W͔τ͕e056",
    ///     "+W͔υ͕e057",
    ///     "+W͔φ͕e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕-ð͔ü͕+ó͕œ͔-ö͕þ͔+ø͔ú͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+z͔ü͕-í͕œ͔+ï͕þ͔+ð͔α͕-ñ͕ø͔)e124",
    ///     "+(+x͔ι͕-y͔δ͕-z͔ú͕+é͕œ͔-ë͕þ͔+ð͔ñ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+z͔ö͕-ç͕œ͔+ë͕ø͔-ï͕ð͔+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕-z͔ó͕+ç͕þ͔-é͕ø͔+í͕ð͔+œ͔α͕)e127",
    ///     "+(+x͔μ͕-y͔ü͕-z͔γ͕+ä͕œ͔-å͕þ͔+æ͕ø͔+ð͔β͕)e134",
    ///     "+(-u͕œ͔+x͔ν͕+y͔ú͕-z͔δ͕+á͕þ͔-æ͕ð͔+ø͔β͕)e135",
    ///     "+(+t͕œ͔+x͔ξ͕-y͔ö͕-z͔ε͕-á͕ø͔+å͕ð͔+þ͔β͕)e136",
    ///     "+(-t͕þ͔+u͕ø͔+x͔ο͕+y͔ó͕-z͔ζ͕-ä͕ð͔+œ͔β͕)e137",
    ///     "+(+r͕œ͔-s͕þ͔+x͔π͕-y͔ñ͕+z͔æ͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(-q͕œ͔+s͕ø͔+x͔ρ͕+y͔ï͕-z͔å͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+q͕þ͔-r͕ø͔+x͔σ͕-y͔í͕+z͔ä͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+p͕œ͔-s͕ð͔+x͔τ͕-y͔ë͕+z͔á͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(-p͕þ͔+r͕ð͔-u͕z͔+x͔υ͕+y͔é͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+p͕ø͔-q͕ð͔+t͕z͔+x͔φ͕-y͔ç͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(-m͕œ͔+n͕þ͔-o͕ø͔+x͔ü͕+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+k͕œ͔-l͕þ͔+o͕ð͔-x͔ú͕+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(-j͕œ͔+l͕ø͔-n͕ð͔+x͔ö͕+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+j͕þ͔-k͕ø͔+m͕ð͔-x͔ó͕+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(-h͕œ͔+i͕þ͔-o͕z͔+x͔ñ͕+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+g͕œ͔-i͕ø͔+n͕z͔-x͔ï͕+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(-g͕þ͔+h͕ø͔-m͕z͔+x͔í͕+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(-f͕œ͔+i͕ð͔-l͕z͔+x͔ë͕+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+f͕þ͔-h͕ð͔+k͕z͔-x͔é͕+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(-f͕ø͔+g͕ð͔-j͕z͔+x͔ç͕+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+d͕œ͔-e͕þ͔+o͕y͔-x͔æ͕+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(-c͕œ͔+e͕ø͔-n͕y͔+x͔å͕+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+c͕þ͔-d͕ø͔+m͕y͔-x͔ä͕+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+b͕œ͔-e͕ð͔+l͕y͔-x͔á͕+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(-b͕þ͔+d͕ð͔-k͕y͔+u͕x͔+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+b͕ø͔-c͕ð͔+j͕y͔-t͕x͔+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(-a͕œ͔+e͕z͔-i͕y͔+s͕x͔+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+a͕þ͔-d͕z͔+h͕y͔-r͕x͔+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(-a͕ø͔+c͕z͔-g͕y͔+q͕x͔+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+a͕ð͔-b͕z͔+f͕y͔-p͕x͔+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    ///     "+(+a͕z͔+b͕ð͔+c͕ø͔+d͕þ͔+e͕œ͔)e34567",
    ///     "+(-a͕y͔+f͕ð͔+g͕ø͔+h͕þ͔+i͕œ͔)e24576",
    ///     "+(-b͕y͔-f͕z͔+j͕ø͔+k͕þ͔+l͕œ͔)e23567",
    ///     "+(-c͕y͔-g͕z͔-j͕ð͔+m͕þ͔+n͕œ͔)e23476",
    ///     "+(-d͕y͔-h͕z͔-k͕ð͔-m͕ø͔+o͕œ͔)e23457",
    ///     "+(-e͕y͔-i͕z͔-l͕ð͔-n͕ø͔-o͕þ͔)e23465",
    ///     "+(+a͕x͔+p͕ð͔+q͕ø͔+r͕þ͔+s͕œ͔)e14567",
    ///     "+(+b͕x͔-p͕z͔+t͕ø͔+u͕þ͔+á͕œ͔)e13576",
    ///     "+(+c͕x͔-q͕z͔-t͕ð͔+ä͕þ͔+å͕œ͔)e13467",
    ///     "+(+d͕x͔-r͕z͔-u͕ð͔-ä͕ø͔+æ͕œ͔)e13475",
    ///     "+(+e͕x͔-s͕z͔-á͕ð͔-å͕ø͔-æ͕þ͔)e13456",
    ///     "+(+f͕x͔+p͕y͔+ç͕ø͔+é͕þ͔+ë͕œ͔)e12567",
    ///     "+(+g͕x͔+q͕y͔-ç͕ð͔+í͕þ͔+ï͕œ͔)e12476",
    ///     "+(+h͕x͔+r͕y͔-é͕ð͔-í͕ø͔+ñ͕œ͔)e12457",
    ///     "+(+i͕x͔+s͕y͔-ë͕ð͔-ï͕ø͔-ñ͕þ͔)e12465",
    ///     "+(+j͕x͔+t͕y͔+z͔ç͕+ó͕þ͔+ö͕œ͔)e12367",
    ///     "+(+k͕x͔+u͕y͔+z͔é͕-ó͕ø͔+ú͕œ͔)e12375",
    ///     "+(+l͕x͔+y͔á͕+z͔ë͕-ö͕ø͔-ú͕þ͔)e12356",
    ///     "+(+m͕x͔+y͔ä͕+z͔í͕+ð͔ó͕+ü͕œ͔)e12347",
    ///     "+(+n͕x͔+y͔å͕+z͔ï͕+ð͔ö͕-ü͕þ͔)e12364",
    ///     "+(+o͕x͔+y͔æ͕+z͔ñ͕+ð͔ú͕+ø͔ü͕)e12345",
    ///     "-W͔a͕e04576",
    ///     "-W͔b͕e03567",
    ///     "-W͔c͕e03476",
    ///     "-W͔d͕e03457",
    ///     "-W͔e͕e03465",
    ///     "-W͔f͕e02576",
    ///     "-W͔g͕e02467",
    ///     "-W͔h͕e02475",
    ///     "-W͔i͕e02456",
    ///     "-W͔j͕e02376",
    ///     "-W͔k͕e02357",
    ///     "-W͔l͕e02365",
    ///     "-W͔m͕e02374",
    ///     "-W͔n͕e02346",
    ///     "-W͔o͕e02354",
    ///     "-W͔p͕e01567",
    ///     "-W͔q͕e01476",
    ///     "-W͔r͕e01457",
    ///     "-W͔s͕e01465",
    ///     "-W͔t͕e01367",
    ///     "-W͔u͕e01375",
    ///     "-W͔á͕e01356",
    ///     "-W͔ä͕e01347",
    ///     "-W͔å͕e01364",
    ///     "-W͔æ͕e01345",
    ///     "-W͔ç͕e01276",
    ///     "-W͔é͕e01257",
    ///     "-W͔ë͕e01265",
    ///     "-W͔í͕e01274",
    ///     "-W͔ï͕e01246",
    ///     "-W͔ñ͕e01254",
    ///     "-W͔ó͕e01237",
    ///     "-W͔ö͕e01263",
    ///     "-W͔ú͕e01235",
    ///     "-W͔ü͕e01243",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_rotoreflector() -> Self {
        Self::volume6() + Self::volume4() + Self::plane()
    }
    /// The multivector of triple rotoreflector $`r_3 \equiv v^6 + v^4 + p + P`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let triple_rotoreflector = Vee::volume6().lhs() * Vee::triple_rotator().rhs();
    ///
    /// assert_eq!(
    ///     triple_rotoreflector.basis_blades(),
    ///     Vee::triple_rotoreflector().basis_blades()
    /// );
    /// format_eq!(triple_rotoreflector, [
    ///     "+W͔v͕e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+W͔α͕e012",
    ///     "+W͔β͕e013",
    ///     "+W͔γ͕e014",
    ///     "+W͔δ͕e015",
    ///     "+W͔ε͕e016",
    ///     "+W͔ζ͕e017",
    ///     "+W͔η͕e023",
    ///     "+W͔θ͕e024",
    ///     "+W͔ι͕e025",
    ///     "+W͔κ͕e026",
    ///     "+W͔λ͕e027",
    ///     "+W͔μ͕e034",
    ///     "+W͔ν͕e035",
    ///     "+W͔ξ͕e036",
    ///     "+W͔ο͕e037",
    ///     "+W͔π͕e045",
    ///     "+W͔ρ͕e046",
    ///     "+W͔σ͕e047",
    ///     "+W͔τ͕e056",
    ///     "+W͔υ͕e057",
    ///     "+W͔φ͕e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕-ð͔ü͕+ó͕œ͔-ö͕þ͔+ø͔ú͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+z͔ü͕-í͕œ͔+ï͕þ͔+ð͔α͕-ñ͕ø͔)e124",
    ///     "+(+x͔ι͕-y͔δ͕-z͔ú͕+é͕œ͔-ë͕þ͔+ð͔ñ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+z͔ö͕-ç͕œ͔+ë͕ø͔-ï͕ð͔+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕-z͔ó͕+ç͕þ͔-é͕ø͔+í͕ð͔+œ͔α͕)e127",
    ///     "+(+x͔μ͕-y͔ü͕-z͔γ͕+ä͕œ͔-å͕þ͔+æ͕ø͔+ð͔β͕)e134",
    ///     "+(-u͕œ͔+x͔ν͕+y͔ú͕-z͔δ͕+á͕þ͔-æ͕ð͔+ø͔β͕)e135",
    ///     "+(+t͕œ͔+x͔ξ͕-y͔ö͕-z͔ε͕-á͕ø͔+å͕ð͔+þ͔β͕)e136",
    ///     "+(-t͕þ͔+u͕ø͔+x͔ο͕+y͔ó͕-z͔ζ͕-ä͕ð͔+œ͔β͕)e137",
    ///     "+(+r͕œ͔-s͕þ͔+x͔π͕-y͔ñ͕+z͔æ͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(-q͕œ͔+s͕ø͔+x͔ρ͕+y͔ï͕-z͔å͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+q͕þ͔-r͕ø͔+x͔σ͕-y͔í͕+z͔ä͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+p͕œ͔-s͕ð͔+x͔τ͕-y͔ë͕+z͔á͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(-p͕þ͔+r͕ð͔-u͕z͔+x͔υ͕+y͔é͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+p͕ø͔-q͕ð͔+t͕z͔+x͔φ͕-y͔ç͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(-m͕œ͔+n͕þ͔-o͕ø͔+x͔ü͕+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+k͕œ͔-l͕þ͔+o͕ð͔-x͔ú͕+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(-j͕œ͔+l͕ø͔-n͕ð͔+x͔ö͕+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+j͕þ͔-k͕ø͔+m͕ð͔-x͔ó͕+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(-h͕œ͔+i͕þ͔-o͕z͔+x͔ñ͕+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+g͕œ͔-i͕ø͔+n͕z͔-x͔ï͕+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(-g͕þ͔+h͕ø͔-m͕z͔+x͔í͕+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(-f͕œ͔+i͕ð͔-l͕z͔+x͔ë͕+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+f͕þ͔-h͕ð͔+k͕z͔-x͔é͕+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(-f͕ø͔+g͕ð͔-j͕z͔+x͔ç͕+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+d͕œ͔-e͕þ͔+o͕y͔-x͔æ͕+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(-c͕œ͔+e͕ø͔-n͕y͔+x͔å͕+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+c͕þ͔-d͕ø͔+m͕y͔-x͔ä͕+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+b͕œ͔-e͕ð͔+l͕y͔-x͔á͕+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(-b͕þ͔+d͕ð͔-k͕y͔+u͕x͔+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+b͕ø͔-c͕ð͔+j͕y͔-t͕x͔+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(-a͕œ͔+e͕z͔-i͕y͔+s͕x͔+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+a͕þ͔-d͕z͔+h͕y͔-r͕x͔+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(-a͕ø͔+c͕z͔-g͕y͔+q͕x͔+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+a͕ð͔-b͕z͔+f͕y͔-p͕x͔+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    ///     "+(+a͕z͔+b͕ð͔+c͕ø͔+d͕þ͔+e͕œ͔-x͔y͕+x͕y͔)e34567",
    ///     "+(-a͕y͔+f͕ð͔+g͕ø͔+h͕þ͔+i͕œ͔-x͔z͕+x͕z͔)e24576",
    ///     "+(-b͕y͔-f͕z͔+j͕ø͔+k͕þ͔+l͕œ͔-x͔ð͕+x͕ð͔)e23567",
    ///     "+(-c͕y͔-g͕z͔-j͕ð͔+m͕þ͔+n͕œ͔-x͔ø͕+x͕ø͔)e23476",
    ///     "+(-d͕y͔-h͕z͔-k͕ð͔-m͕ø͔+o͕œ͔-x͔þ͕+x͕þ͔)e23457",
    ///     "+(-e͕y͔-i͕z͔-l͕ð͔-n͕ø͔-o͕þ͔-x͔œ͕+x͕œ͔)e23465",
    ///     "+(+a͕x͔+p͕ð͔+q͕ø͔+r͕þ͔+s͕œ͔-y͔z͕+y͕z͔)e14567",
    ///     "+(+b͕x͔-p͕z͔+t͕ø͔+u͕þ͔-y͔ð͕+y͕ð͔+á͕œ͔)e13576",
    ///     "+(+c͕x͔-q͕z͔-t͕ð͔-y͔ø͕+y͕ø͔+ä͕þ͔+å͕œ͔)e13467",
    ///     "+(+d͕x͔-r͕z͔-u͕ð͔-y͔þ͕+y͕þ͔-ä͕ø͔+æ͕œ͔)e13475",
    ///     "+(+e͕x͔-s͕z͔-y͔œ͕+y͕œ͔-á͕ð͔-å͕ø͔-æ͕þ͔)e13456",
    ///     "+(+f͕x͔+p͕y͔-z͔ð͕+z͕ð͔+ç͕ø͔+é͕þ͔+ë͕œ͔)e12567",
    ///     "+(+g͕x͔+q͕y͔-z͔ø͕+z͕ø͔-ç͕ð͔+í͕þ͔+ï͕œ͔)e12476",
    ///     "+(+h͕x͔+r͕y͔-z͔þ͕+z͕þ͔-é͕ð͔-í͕ø͔+ñ͕œ͔)e12457",
    ///     "+(+i͕x͔+s͕y͔-z͔œ͕+z͕œ͔-ë͕ð͔-ï͕ø͔-ñ͕þ͔)e12465",
    ///     "+(+j͕x͔+t͕y͔+z͔ç͕-ð͔ø͕+ð͕ø͔+ó͕þ͔+ö͕œ͔)e12367",
    ///     "+(+k͕x͔+u͕y͔+z͔é͕-ð͔þ͕+ð͕þ͔-ó͕ø͔+ú͕œ͔)e12375",
    ///     "+(+l͕x͔+y͔á͕+z͔ë͕-ð͔œ͕+ð͕œ͔-ö͕ø͔-ú͕þ͔)e12356",
    ///     "+(+m͕x͔+y͔ä͕+z͔í͕+ð͔ó͕-ø͔þ͕+ø͕þ͔+ü͕œ͔)e12347",
    ///     "+(+n͕x͔+y͔å͕+z͔ï͕+ð͔ö͕-ø͔œ͕+ø͕œ͔-ü͕þ͔)e12364",
    ///     "+(+o͕x͔+y͔æ͕+z͔ñ͕+ð͔ú͕+ø͔ü͕-þ͔œ͕+þ͕œ͔)e12345",
    ///     "-W͔a͕e04576",
    ///     "-W͔b͕e03567",
    ///     "-W͔c͕e03476",
    ///     "-W͔d͕e03457",
    ///     "-W͔e͕e03465",
    ///     "-W͔f͕e02576",
    ///     "-W͔g͕e02467",
    ///     "-W͔h͕e02475",
    ///     "-W͔i͕e02456",
    ///     "-W͔j͕e02376",
    ///     "-W͔k͕e02357",
    ///     "-W͔l͕e02365",
    ///     "-W͔m͕e02374",
    ///     "-W͔n͕e02346",
    ///     "-W͔o͕e02354",
    ///     "-W͔p͕e01567",
    ///     "-W͔q͕e01476",
    ///     "-W͔r͕e01457",
    ///     "-W͔s͕e01465",
    ///     "-W͔t͕e01367",
    ///     "-W͔u͕e01375",
    ///     "-W͔á͕e01356",
    ///     "-W͔ä͕e01347",
    ///     "-W͔å͕e01364",
    ///     "-W͔æ͕e01345",
    ///     "-W͔ç͕e01276",
    ///     "-W͔é͕e01257",
    ///     "-W͔ë͕e01265",
    ///     "-W͔í͕e01274",
    ///     "-W͔ï͕e01246",
    ///     "-W͔ñ͕e01254",
    ///     "-W͔ó͕e01237",
    ///     "-W͔ö͕e01263",
    ///     "-W͔ú͕e01235",
    ///     "-W͔ü͕e01243",
    ///     "+(+x͔x͕+y͔y͕+z͔z͕+ð͔ð͕+ø͔ø͕+þ͔þ͕+œ͔œ͕)e1234567",
    ///     "-W͔x͕e0234576",
    ///     "-W͔y͕e0134567",
    ///     "-W͔z͕e0124576",
    ///     "-W͔ð͕e0123567",
    ///     "-W͔ø͕e0123476",
    ///     "-W͔þ͕e0123457",
    ///     "-W͔œ͕e0123465",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn triple_rotoreflector() -> Self {
        Self::volume6() + Self::volume4() + Self::plane() + Self::point()
    }
    /// The multivector of transflector $`f_t \equiv s + v^6 + v^4_\infty`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let transflector = Vee::volume6().lhs() * Vee::translator().rhs();
    ///
    /// assert_eq!(
    ///     transflector.basis_blades(),
    ///     Vee::transflector().basis_blades()
    /// );
    /// format_eq!(transflector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔-Œ͕œ͔)e0",
    ///     "+v͕x͔e1",
    ///     "+v͕y͔e2",
    ///     "+v͕z͔e3",
    ///     "+v͕ð͔e4",
    ///     "+v͕ø͔e5",
    ///     "+v͕þ͔e6",
    ///     "+v͕œ͔e7",
    ///     "+(+X͕y͔-Y͕x͔)e012",
    ///     "+(+X͕z͔-Z͕x͔)e013",
    ///     "+(+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+X͕œ͔-x͔Œ͕)e017",
    ///     "+(+Y͕z͔-Z͕y͔)e023",
    ///     "+(+Y͕ð͔-y͔Ð͕)e024",
    ///     "+(+Y͕ø͔-y͔Ø͕)e025",
    ///     "+(+Y͕þ͔-y͔Þ͕)e026",
    ///     "+(+Y͕œ͔-y͔Œ͕)e027",
    ///     "+(+Z͕ð͔-z͔Ð͕)e034",
    ///     "+(+Z͕ø͔-z͔Ø͕)e035",
    ///     "+(+Z͕þ͔-z͔Þ͕)e036",
    ///     "+(+Z͕œ͔-z͔Œ͕)e037",
    ///     "+(+Ð͕ø͔-Ø͕ð͔)e045",
    ///     "+(+Ð͕þ͔-Þ͕ð͔)e046",
    ///     "+(+Ð͕œ͔-ð͔Œ͕)e047",
    ///     "+(+Ø͕þ͔-Þ͕ø͔)e056",
    ///     "+(+Ø͕œ͔-ø͔Œ͕)e057",
    ///     "+(+Þ͕œ͔-þ͔Œ͕)e067",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn transflector() -> Self {
        Self::volume6() + Self::volume4_moment()
    }
    /// The multivector of simple single flector $`f_{s1} \equiv v^6 + v^4`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let simple_single_flector = Vee::volume6().lhs() * Vee::simple_single_motor().rhs();
    ///
    /// assert_eq!(
    ///     simple_single_flector.basis_blades(),
    ///     Vee::simple_single_flector().basis_blades()
    /// );
    /// format_eq!(simple_single_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔-Œ͕œ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+(+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+W͔ζ͕+X͕œ͔-x͔Œ͕)e017",
    ///     "+(+W͔η͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(+W͔θ͕+Y͕ð͔-y͔Ð͕)e024",
    ///     "+(+W͔ι͕+Y͕ø͔-y͔Ø͕)e025",
    ///     "+(+W͔κ͕+Y͕þ͔-y͔Þ͕)e026",
    ///     "+(+W͔λ͕+Y͕œ͔-y͔Œ͕)e027",
    ///     "+(+W͔μ͕+Z͕ð͔-z͔Ð͕)e034",
    ///     "+(+W͔ν͕+Z͕ø͔-z͔Ø͕)e035",
    ///     "+(+W͔ξ͕+Z͕þ͔-z͔Þ͕)e036",
    ///     "+(+W͔ο͕+Z͕œ͔-z͔Œ͕)e037",
    ///     "+(+W͔π͕+Ð͕ø͔-Ø͕ð͔)e045",
    ///     "+(+W͔ρ͕+Ð͕þ͔-Þ͕ð͔)e046",
    ///     "+(+W͔σ͕+Ð͕œ͔-ð͔Œ͕)e047",
    ///     "+(+W͔τ͕+Ø͕þ͔-Þ͕ø͔)e056",
    ///     "+(+W͔υ͕+Ø͕œ͔-ø͔Œ͕)e057",
    ///     "+(+W͔φ͕+Þ͕œ͔-þ͔Œ͕)e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+ð͔α͕)e124",
    ///     "+(+x͔ι͕-y͔δ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕+œ͔α͕)e127",
    ///     "+(+x͔μ͕-z͔γ͕+ð͔β͕)e134",
    ///     "+(+x͔ν͕-z͔δ͕+ø͔β͕)e135",
    ///     "+(+x͔ξ͕-z͔ε͕+þ͔β͕)e136",
    ///     "+(+x͔ο͕-z͔ζ͕+œ͔β͕)e137",
    ///     "+(+x͔π͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(+x͔ρ͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+x͔σ͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+x͔τ͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+x͔υ͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+x͔φ͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_single_flector() -> Self {
        Self::volume6() + Self::volume4()
    }
    /// The multivector of single flector $`f_1 \equiv v^6 + v^4 + p_\infty`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let single_flector = Vee::volume6().lhs() * Vee::single_motor().rhs();
    ///
    /// assert_eq!(
    ///     single_flector.basis_blades(),
    ///     Vee::single_flector().basis_blades()
    /// );
    /// format_eq!(single_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔-Œ͕œ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+(-A͕z͔-B͕ð͔-C͕ø͔-D͕þ͔-E͕œ͔+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(+A͕y͔-F͕ð͔-G͕ø͔-H͕þ͔-I͕œ͔+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+B͕y͔+F͕z͔-J͕ø͔-K͕þ͔-L͕œ͔+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+C͕y͔+G͕z͔+J͕ð͔-M͕þ͔-N͕œ͔+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+D͕y͔+H͕z͔+K͕ð͔+M͕ø͔-O͕œ͔+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+E͕y͔+I͕z͔+L͕ð͔+N͕ø͔+O͕þ͔+W͔ζ͕+X͕œ͔-x͔Œ͕)e017",
    ///     "+(-A͕x͔-P͕ð͔-Q͕ø͔-R͕þ͔-S͕œ͔+W͔η͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(-B͕x͔+P͕z͔-T͕ø͔-U͕þ͔+W͔θ͕+Y͕ð͔-y͔Ð͕-Á͕œ͔)e024",
    ///     "+(-C͕x͔+Q͕z͔+T͕ð͔+W͔ι͕+Y͕ø͔-y͔Ø͕-Ä͕þ͔-Å͕œ͔)e025",
    ///     "+(-D͕x͔+R͕z͔+U͕ð͔+W͔κ͕+Y͕þ͔-y͔Þ͕+Ä͕ø͔-Æ͕œ͔)e026",
    ///     "+(-E͕x͔+S͕z͔+W͔λ͕+Y͕œ͔-y͔Œ͕+Á͕ð͔+Å͕ø͔+Æ͕þ͔)e027",
    ///     "+(-F͕x͔-P͕y͔+W͔μ͕+Z͕ð͔-z͔Ð͕-Ç͕ø͔-É͕þ͔-Ë͕œ͔)e034",
    ///     "+(-G͕x͔-Q͕y͔+W͔ν͕+Z͕ø͔-z͔Ø͕+Ç͕ð͔-Í͕þ͔-Ï͕œ͔)e035",
    ///     "+(-H͕x͔-R͕y͔+W͔ξ͕+Z͕þ͔-z͔Þ͕+É͕ð͔+Í͕ø͔-Ñ͕œ͔)e036",
    ///     "+(-I͕x͔-S͕y͔+W͔ο͕+Z͕œ͔-z͔Œ͕+Ë͕ð͔+Ï͕ø͔+Ñ͕þ͔)e037",
    ///     "+(-J͕x͔-T͕y͔+W͔π͕-z͔Ç͕+Ð͕ø͔-Ó͕þ͔-Ö͕œ͔-Ø͕ð͔)e045",
    ///     "+(-K͕x͔-U͕y͔+W͔ρ͕-z͔É͕+Ð͕þ͔+Ó͕ø͔-Ú͕œ͔-Þ͕ð͔)e046",
    ///     "+(-L͕x͔+W͔σ͕-y͔Á͕-z͔Ë͕+Ð͕œ͔+Ö͕ø͔+Ú͕þ͔-ð͔Œ͕)e047",
    ///     "+(-M͕x͔+W͔τ͕-y͔Ä͕-z͔Í͕-Ó͕ð͔+Ø͕þ͔-Ü͕œ͔-Þ͕ø͔)e056",
    ///     "+(-N͕x͔+W͔υ͕-y͔Å͕-z͔Ï͕-Ö͕ð͔+Ø͕œ͔+Ü͕þ͔-ø͔Œ͕)e057",
    ///     "+(-O͕x͔+W͔φ͕-y͔Æ͕-z͔Ñ͕-Ú͕ð͔-Ü͕ø͔+Þ͕œ͔-þ͔Œ͕)e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+ð͔α͕)e124",
    ///     "+(+x͔ι͕-y͔δ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕+œ͔α͕)e127",
    ///     "+(+x͔μ͕-z͔γ͕+ð͔β͕)e134",
    ///     "+(+x͔ν͕-z͔δ͕+ø͔β͕)e135",
    ///     "+(+x͔ξ͕-z͔ε͕+þ͔β͕)e136",
    ///     "+(+x͔ο͕-z͔ζ͕+œ͔β͕)e137",
    ///     "+(+x͔π͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(+x͔ρ͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+x͔σ͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+x͔τ͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(+x͔υ͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+x͔φ͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    ///     "+(-Ó͕œ͔+Ö͕þ͔-Ú͕ø͔+Ü͕ð͔)e04576",
    ///     "+(-z͔Ü͕+Í͕œ͔-Ï͕þ͔+Ñ͕ø͔)e03567",
    ///     "+(+z͔Ú͕-É͕œ͔+Ë͕þ͔-Ñ͕ð͔)e03476",
    ///     "+(-z͔Ö͕+Ç͕œ͔-Ë͕ø͔+Ï͕ð͔)e03457",
    ///     "+(+z͔Ó͕-Ç͕þ͔+É͕ø͔-Í͕ð͔)e03465",
    ///     "+(+y͔Ü͕-Ä͕œ͔+Å͕þ͔-Æ͕ø͔)e02576",
    ///     "+(+U͕œ͔-y͔Ú͕-Á͕þ͔+Æ͕ð͔)e02467",
    ///     "+(-T͕œ͔+y͔Ö͕+Á͕ø͔-Å͕ð͔)e02475",
    ///     "+(+T͕þ͔-U͕ø͔-y͔Ó͕+Ä͕ð͔)e02456",
    ///     "+(-R͕œ͔+S͕þ͔+y͔Ñ͕-z͔Æ͕)e02376",
    ///     "+(+Q͕œ͔-S͕ø͔-y͔Ï͕+z͔Å͕)e02357",
    ///     "+(-Q͕þ͔+R͕ø͔+y͔Í͕-z͔Ä͕)e02365",
    ///     "+(-P͕œ͔+S͕ð͔+y͔Ë͕-z͔Á͕)e02374",
    ///     "+(+P͕þ͔-R͕ð͔+U͕z͔-y͔É͕)e02346",
    ///     "+(-P͕ø͔+Q͕ð͔-T͕z͔+y͔Ç͕)e02354",
    ///     "+(+M͕œ͔-N͕þ͔+O͕ø͔-x͔Ü͕)e01567",
    ///     "+(-K͕œ͔+L͕þ͔-O͕ð͔+x͔Ú͕)e01476",
    ///     "+(+J͕œ͔-L͕ø͔+N͕ð͔-x͔Ö͕)e01457",
    ///     "+(-J͕þ͔+K͕ø͔-M͕ð͔+x͔Ó͕)e01465",
    ///     "+(+H͕œ͔-I͕þ͔+O͕z͔-x͔Ñ͕)e01367",
    ///     "+(-G͕œ͔+I͕ø͔-N͕z͔+x͔Ï͕)e01375",
    ///     "+(+G͕þ͔-H͕ø͔+M͕z͔-x͔Í͕)e01356",
    ///     "+(+F͕œ͔-I͕ð͔+L͕z͔-x͔Ë͕)e01347",
    ///     "+(-F͕þ͔+H͕ð͔-K͕z͔+x͔É͕)e01364",
    ///     "+(+F͕ø͔-G͕ð͔+J͕z͔-x͔Ç͕)e01345",
    ///     "+(-D͕œ͔+E͕þ͔-O͕y͔+x͔Æ͕)e01276",
    ///     "+(+C͕œ͔-E͕ø͔+N͕y͔-x͔Å͕)e01257",
    ///     "+(-C͕þ͔+D͕ø͔-M͕y͔+x͔Ä͕)e01265",
    ///     "+(-B͕œ͔+E͕ð͔-L͕y͔+x͔Á͕)e01274",
    ///     "+(+B͕þ͔-D͕ð͔+K͕y͔-U͕x͔)e01246",
    ///     "+(-B͕ø͔+C͕ð͔-J͕y͔+T͕x͔)e01254",
    ///     "+(+A͕œ͔-E͕z͔+I͕y͔-S͕x͔)e01237",
    ///     "+(-A͕þ͔+D͕z͔-H͕y͔+R͕x͔)e01263",
    ///     "+(+A͕ø͔-C͕z͔+G͕y͔-Q͕x͔)e01235",
    ///     "+(-A͕ð͔+B͕z͔-F͕y͔+P͕x͔)e01243",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn single_flector() -> Self {
        Self::volume6() + Self::volume4() + Self::plane_moment()
    }
    /// The multivector of simple double flector $`f_{s2} \equiv v^6 + v^4 + p`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let simple_double_flector = Vee::volume6().lhs() * Vee::simple_double_motor().rhs();
    ///
    /// assert_eq!(
    ///     simple_double_flector.basis_blades(),
    ///     Vee::simple_double_flector().basis_blades()
    /// );
    /// format_eq!(simple_double_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔-Œ͕œ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+(-A͕z͔-B͕ð͔-C͕ø͔-D͕þ͔-E͕œ͔+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(+A͕y͔-F͕ð͔-G͕ø͔-H͕þ͔-I͕œ͔+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+B͕y͔+F͕z͔-J͕ø͔-K͕þ͔-L͕œ͔+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+C͕y͔+G͕z͔+J͕ð͔-M͕þ͔-N͕œ͔+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+D͕y͔+H͕z͔+K͕ð͔+M͕ø͔-O͕œ͔+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+E͕y͔+I͕z͔+L͕ð͔+N͕ø͔+O͕þ͔+W͔ζ͕+X͕œ͔-x͔Œ͕)e017",
    ///     "+(-A͕x͔-P͕ð͔-Q͕ø͔-R͕þ͔-S͕œ͔+W͔η͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(-B͕x͔+P͕z͔-T͕ø͔-U͕þ͔+W͔θ͕+Y͕ð͔-y͔Ð͕-Á͕œ͔)e024",
    ///     "+(-C͕x͔+Q͕z͔+T͕ð͔+W͔ι͕+Y͕ø͔-y͔Ø͕-Ä͕þ͔-Å͕œ͔)e025",
    ///     "+(-D͕x͔+R͕z͔+U͕ð͔+W͔κ͕+Y͕þ͔-y͔Þ͕+Ä͕ø͔-Æ͕œ͔)e026",
    ///     "+(-E͕x͔+S͕z͔+W͔λ͕+Y͕œ͔-y͔Œ͕+Á͕ð͔+Å͕ø͔+Æ͕þ͔)e027",
    ///     "+(-F͕x͔-P͕y͔+W͔μ͕+Z͕ð͔-z͔Ð͕-Ç͕ø͔-É͕þ͔-Ë͕œ͔)e034",
    ///     "+(-G͕x͔-Q͕y͔+W͔ν͕+Z͕ø͔-z͔Ø͕+Ç͕ð͔-Í͕þ͔-Ï͕œ͔)e035",
    ///     "+(-H͕x͔-R͕y͔+W͔ξ͕+Z͕þ͔-z͔Þ͕+É͕ð͔+Í͕ø͔-Ñ͕œ͔)e036",
    ///     "+(-I͕x͔-S͕y͔+W͔ο͕+Z͕œ͔-z͔Œ͕+Ë͕ð͔+Ï͕ø͔+Ñ͕þ͔)e037",
    ///     "+(-J͕x͔-T͕y͔+W͔π͕-z͔Ç͕+Ð͕ø͔-Ó͕þ͔-Ö͕œ͔-Ø͕ð͔)e045",
    ///     "+(-K͕x͔-U͕y͔+W͔ρ͕-z͔É͕+Ð͕þ͔+Ó͕ø͔-Ú͕œ͔-Þ͕ð͔)e046",
    ///     "+(-L͕x͔+W͔σ͕-y͔Á͕-z͔Ë͕+Ð͕œ͔+Ö͕ø͔+Ú͕þ͔-ð͔Œ͕)e047",
    ///     "+(-M͕x͔+W͔τ͕-y͔Ä͕-z͔Í͕-Ó͕ð͔+Ø͕þ͔-Ü͕œ͔-Þ͕ø͔)e056",
    ///     "+(-N͕x͔+W͔υ͕-y͔Å͕-z͔Ï͕-Ö͕ð͔+Ø͕œ͔+Ü͕þ͔-ø͔Œ͕)e057",
    ///     "+(-O͕x͔+W͔φ͕-y͔Æ͕-z͔Ñ͕-Ú͕ð͔-Ü͕ø͔+Þ͕œ͔-þ͔Œ͕)e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕-ð͔ü͕+ó͕œ͔-ö͕þ͔+ø͔ú͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+z͔ü͕-í͕œ͔+ï͕þ͔+ð͔α͕-ñ͕ø͔)e124",
    ///     "+(+x͔ι͕-y͔δ͕-z͔ú͕+é͕œ͔-ë͕þ͔+ð͔ñ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+z͔ö͕-ç͕œ͔+ë͕ø͔-ï͕ð͔+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕-z͔ó͕+ç͕þ͔-é͕ø͔+í͕ð͔+œ͔α͕)e127",
    ///     "+(+x͔μ͕-y͔ü͕-z͔γ͕+ä͕œ͔-å͕þ͔+æ͕ø͔+ð͔β͕)e134",
    ///     "+(-u͕œ͔+x͔ν͕+y͔ú͕-z͔δ͕+á͕þ͔-æ͕ð͔+ø͔β͕)e135",
    ///     "+(+t͕œ͔+x͔ξ͕-y͔ö͕-z͔ε͕-á͕ø͔+å͕ð͔+þ͔β͕)e136",
    ///     "+(-t͕þ͔+u͕ø͔+x͔ο͕+y͔ó͕-z͔ζ͕-ä͕ð͔+œ͔β͕)e137",
    ///     "+(+r͕œ͔-s͕þ͔+x͔π͕-y͔ñ͕+z͔æ͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(-q͕œ͔+s͕ø͔+x͔ρ͕+y͔ï͕-z͔å͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+q͕þ͔-r͕ø͔+x͔σ͕-y͔í͕+z͔ä͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+p͕œ͔-s͕ð͔+x͔τ͕-y͔ë͕+z͔á͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(-p͕þ͔+r͕ð͔-u͕z͔+x͔υ͕+y͔é͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+p͕ø͔-q͕ð͔+t͕z͔+x͔φ͕-y͔ç͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(-m͕œ͔+n͕þ͔-o͕ø͔+x͔ü͕+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+k͕œ͔-l͕þ͔+o͕ð͔-x͔ú͕+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(-j͕œ͔+l͕ø͔-n͕ð͔+x͔ö͕+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+j͕þ͔-k͕ø͔+m͕ð͔-x͔ó͕+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(-h͕œ͔+i͕þ͔-o͕z͔+x͔ñ͕+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+g͕œ͔-i͕ø͔+n͕z͔-x͔ï͕+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(-g͕þ͔+h͕ø͔-m͕z͔+x͔í͕+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(-f͕œ͔+i͕ð͔-l͕z͔+x͔ë͕+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+f͕þ͔-h͕ð͔+k͕z͔-x͔é͕+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(-f͕ø͔+g͕ð͔-j͕z͔+x͔ç͕+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+d͕œ͔-e͕þ͔+o͕y͔-x͔æ͕+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(-c͕œ͔+e͕ø͔-n͕y͔+x͔å͕+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+c͕þ͔-d͕ø͔+m͕y͔-x͔ä͕+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+b͕œ͔-e͕ð͔+l͕y͔-x͔á͕+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(-b͕þ͔+d͕ð͔-k͕y͔+u͕x͔+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+b͕ø͔-c͕ð͔+j͕y͔-t͕x͔+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(-a͕œ͔+e͕z͔-i͕y͔+s͕x͔+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+a͕þ͔-d͕z͔+h͕y͔-r͕x͔+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(-a͕ø͔+c͕z͔-g͕y͔+q͕x͔+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+a͕ð͔-b͕z͔+f͕y͔-p͕x͔+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    ///     "+(+a͕z͔+b͕ð͔+c͕ø͔+d͕þ͔+e͕œ͔)e34567",
    ///     "+(-a͕y͔+f͕ð͔+g͕ø͔+h͕þ͔+i͕œ͔)e24576",
    ///     "+(-b͕y͔-f͕z͔+j͕ø͔+k͕þ͔+l͕œ͔)e23567",
    ///     "+(-c͕y͔-g͕z͔-j͕ð͔+m͕þ͔+n͕œ͔)e23476",
    ///     "+(-d͕y͔-h͕z͔-k͕ð͔-m͕ø͔+o͕œ͔)e23457",
    ///     "+(-e͕y͔-i͕z͔-l͕ð͔-n͕ø͔-o͕þ͔)e23465",
    ///     "+(+a͕x͔+p͕ð͔+q͕ø͔+r͕þ͔+s͕œ͔)e14567",
    ///     "+(+b͕x͔-p͕z͔+t͕ø͔+u͕þ͔+á͕œ͔)e13576",
    ///     "+(+c͕x͔-q͕z͔-t͕ð͔+ä͕þ͔+å͕œ͔)e13467",
    ///     "+(+d͕x͔-r͕z͔-u͕ð͔-ä͕ø͔+æ͕œ͔)e13475",
    ///     "+(+e͕x͔-s͕z͔-á͕ð͔-å͕ø͔-æ͕þ͔)e13456",
    ///     "+(+f͕x͔+p͕y͔+ç͕ø͔+é͕þ͔+ë͕œ͔)e12567",
    ///     "+(+g͕x͔+q͕y͔-ç͕ð͔+í͕þ͔+ï͕œ͔)e12476",
    ///     "+(+h͕x͔+r͕y͔-é͕ð͔-í͕ø͔+ñ͕œ͔)e12457",
    ///     "+(+i͕x͔+s͕y͔-ë͕ð͔-ï͕ø͔-ñ͕þ͔)e12465",
    ///     "+(+j͕x͔+t͕y͔+z͔ç͕+ó͕þ͔+ö͕œ͔)e12367",
    ///     "+(+k͕x͔+u͕y͔+z͔é͕-ó͕ø͔+ú͕œ͔)e12375",
    ///     "+(+l͕x͔+y͔á͕+z͔ë͕-ö͕ø͔-ú͕þ͔)e12356",
    ///     "+(+m͕x͔+y͔ä͕+z͔í͕+ð͔ó͕+ü͕œ͔)e12347",
    ///     "+(+n͕x͔+y͔å͕+z͔ï͕+ð͔ö͕-ü͕þ͔)e12364",
    ///     "+(+o͕x͔+y͔æ͕+z͔ñ͕+ð͔ú͕+ø͔ü͕)e12345",
    ///     "+(-W͔a͕-Ó͕œ͔+Ö͕þ͔-Ú͕ø͔+Ü͕ð͔)e04576",
    ///     "+(-W͔b͕-z͔Ü͕+Í͕œ͔-Ï͕þ͔+Ñ͕ø͔)e03567",
    ///     "+(-W͔c͕+z͔Ú͕-É͕œ͔+Ë͕þ͔-Ñ͕ð͔)e03476",
    ///     "+(-W͔d͕-z͔Ö͕+Ç͕œ͔-Ë͕ø͔+Ï͕ð͔)e03457",
    ///     "+(-W͔e͕+z͔Ó͕-Ç͕þ͔+É͕ø͔-Í͕ð͔)e03465",
    ///     "+(-W͔f͕+y͔Ü͕-Ä͕œ͔+Å͕þ͔-Æ͕ø͔)e02576",
    ///     "+(+U͕œ͔-W͔g͕-y͔Ú͕-Á͕þ͔+Æ͕ð͔)e02467",
    ///     "+(-T͕œ͔-W͔h͕+y͔Ö͕+Á͕ø͔-Å͕ð͔)e02475",
    ///     "+(+T͕þ͔-U͕ø͔-W͔i͕-y͔Ó͕+Ä͕ð͔)e02456",
    ///     "+(-R͕œ͔+S͕þ͔-W͔j͕+y͔Ñ͕-z͔Æ͕)e02376",
    ///     "+(+Q͕œ͔-S͕ø͔-W͔k͕-y͔Ï͕+z͔Å͕)e02357",
    ///     "+(-Q͕þ͔+R͕ø͔-W͔l͕+y͔Í͕-z͔Ä͕)e02365",
    ///     "+(-P͕œ͔+S͕ð͔-W͔m͕+y͔Ë͕-z͔Á͕)e02374",
    ///     "+(+P͕þ͔-R͕ð͔+U͕z͔-W͔n͕-y͔É͕)e02346",
    ///     "+(-P͕ø͔+Q͕ð͔-T͕z͔-W͔o͕+y͔Ç͕)e02354",
    ///     "+(+M͕œ͔-N͕þ͔+O͕ø͔-W͔p͕-x͔Ü͕)e01567",
    ///     "+(-K͕œ͔+L͕þ͔-O͕ð͔-W͔q͕+x͔Ú͕)e01476",
    ///     "+(+J͕œ͔-L͕ø͔+N͕ð͔-W͔r͕-x͔Ö͕)e01457",
    ///     "+(-J͕þ͔+K͕ø͔-M͕ð͔-W͔s͕+x͔Ó͕)e01465",
    ///     "+(+H͕œ͔-I͕þ͔+O͕z͔-W͔t͕-x͔Ñ͕)e01367",
    ///     "+(-G͕œ͔+I͕ø͔-N͕z͔-W͔u͕+x͔Ï͕)e01375",
    ///     "+(+G͕þ͔-H͕ø͔+M͕z͔-W͔á͕-x͔Í͕)e01356",
    ///     "+(+F͕œ͔-I͕ð͔+L͕z͔-W͔ä͕-x͔Ë͕)e01347",
    ///     "+(-F͕þ͔+H͕ð͔-K͕z͔-W͔å͕+x͔É͕)e01364",
    ///     "+(+F͕ø͔-G͕ð͔+J͕z͔-W͔æ͕-x͔Ç͕)e01345",
    ///     "+(-D͕œ͔+E͕þ͔-O͕y͔-W͔ç͕+x͔Æ͕)e01276",
    ///     "+(+C͕œ͔-E͕ø͔+N͕y͔-W͔é͕-x͔Å͕)e01257",
    ///     "+(-C͕þ͔+D͕ø͔-M͕y͔-W͔ë͕+x͔Ä͕)e01265",
    ///     "+(-B͕œ͔+E͕ð͔-L͕y͔-W͔í͕+x͔Á͕)e01274",
    ///     "+(+B͕þ͔-D͕ð͔+K͕y͔-U͕x͔-W͔ï͕)e01246",
    ///     "+(-B͕ø͔+C͕ð͔-J͕y͔+T͕x͔-W͔ñ͕)e01254",
    ///     "+(+A͕œ͔-E͕z͔+I͕y͔-S͕x͔-W͔ó͕)e01237",
    ///     "+(-A͕þ͔+D͕z͔-H͕y͔+R͕x͔-W͔ö͕)e01263",
    ///     "+(+A͕ø͔-C͕z͔+G͕y͔-Q͕x͔-W͔ú͕)e01235",
    ///     "+(-A͕ð͔+B͕z͔-F͕y͔+P͕x͔-W͔ü͕)e01243",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_double_flector() -> Self {
        Self::volume6() + Self::volume4() + Self::plane()
    }
    /// The multivector of double flector $`f_2 \equiv v^6 + v^4 + p + P_\infty`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let double_flector = Vee::volume6().lhs() * Vee::double_motor().rhs();
    ///
    /// assert_eq!(
    ///     double_flector.basis_blades(),
    ///     Vee::double_flector().basis_blades()
    /// );
    /// format_eq!(double_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔-Œ͕œ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+(-A͕z͔-B͕ð͔-C͕ø͔-D͕þ͔-E͕œ͔+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(+A͕y͔-F͕ð͔-G͕ø͔-H͕þ͔-I͕œ͔+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+B͕y͔+F͕z͔-J͕ø͔-K͕þ͔-L͕œ͔+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+C͕y͔+G͕z͔+J͕ð͔-M͕þ͔-N͕œ͔+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+D͕y͔+H͕z͔+K͕ð͔+M͕ø͔-O͕œ͔+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+E͕y͔+I͕z͔+L͕ð͔+N͕ø͔+O͕þ͔+W͔ζ͕+X͕œ͔-x͔Œ͕)e017",
    ///     "+(-A͕x͔-P͕ð͔-Q͕ø͔-R͕þ͔-S͕œ͔+W͔η͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(-B͕x͔+P͕z͔-T͕ø͔-U͕þ͔+W͔θ͕+Y͕ð͔-y͔Ð͕-Á͕œ͔)e024",
    ///     "+(-C͕x͔+Q͕z͔+T͕ð͔+W͔ι͕+Y͕ø͔-y͔Ø͕-Ä͕þ͔-Å͕œ͔)e025",
    ///     "+(-D͕x͔+R͕z͔+U͕ð͔+W͔κ͕+Y͕þ͔-y͔Þ͕+Ä͕ø͔-Æ͕œ͔)e026",
    ///     "+(-E͕x͔+S͕z͔+W͔λ͕+Y͕œ͔-y͔Œ͕+Á͕ð͔+Å͕ø͔+Æ͕þ͔)e027",
    ///     "+(-F͕x͔-P͕y͔+W͔μ͕+Z͕ð͔-z͔Ð͕-Ç͕ø͔-É͕þ͔-Ë͕œ͔)e034",
    ///     "+(-G͕x͔-Q͕y͔+W͔ν͕+Z͕ø͔-z͔Ø͕+Ç͕ð͔-Í͕þ͔-Ï͕œ͔)e035",
    ///     "+(-H͕x͔-R͕y͔+W͔ξ͕+Z͕þ͔-z͔Þ͕+É͕ð͔+Í͕ø͔-Ñ͕œ͔)e036",
    ///     "+(-I͕x͔-S͕y͔+W͔ο͕+Z͕œ͔-z͔Œ͕+Ë͕ð͔+Ï͕ø͔+Ñ͕þ͔)e037",
    ///     "+(-J͕x͔-T͕y͔+W͔π͕-z͔Ç͕+Ð͕ø͔-Ó͕þ͔-Ö͕œ͔-Ø͕ð͔)e045",
    ///     "+(-K͕x͔-U͕y͔+W͔ρ͕-z͔É͕+Ð͕þ͔+Ó͕ø͔-Ú͕œ͔-Þ͕ð͔)e046",
    ///     "+(-L͕x͔+W͔σ͕-y͔Á͕-z͔Ë͕+Ð͕œ͔+Ö͕ø͔+Ú͕þ͔-ð͔Œ͕)e047",
    ///     "+(-M͕x͔+W͔τ͕-y͔Ä͕-z͔Í͕-Ó͕ð͔+Ø͕þ͔-Ü͕œ͔-Þ͕ø͔)e056",
    ///     "+(-N͕x͔+W͔υ͕-y͔Å͕-z͔Ï͕-Ö͕ð͔+Ø͕œ͔+Ü͕þ͔-ø͔Œ͕)e057",
    ///     "+(-O͕x͔+W͔φ͕-y͔Æ͕-z͔Ñ͕-Ú͕ð͔-Ü͕ø͔+Þ͕œ͔-þ͔Œ͕)e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕-ð͔ü͕+ó͕œ͔-ö͕þ͔+ø͔ú͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+z͔ü͕-í͕œ͔+ï͕þ͔+ð͔α͕-ñ͕ø͔)e124",
    ///     "+(+x͔ι͕-y͔δ͕-z͔ú͕+é͕œ͔-ë͕þ͔+ð͔ñ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+z͔ö͕-ç͕œ͔+ë͕ø͔-ï͕ð͔+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕-z͔ó͕+ç͕þ͔-é͕ø͔+í͕ð͔+œ͔α͕)e127",
    ///     "+(+x͔μ͕-y͔ü͕-z͔γ͕+ä͕œ͔-å͕þ͔+æ͕ø͔+ð͔β͕)e134",
    ///     "+(-u͕œ͔+x͔ν͕+y͔ú͕-z͔δ͕+á͕þ͔-æ͕ð͔+ø͔β͕)e135",
    ///     "+(+t͕œ͔+x͔ξ͕-y͔ö͕-z͔ε͕-á͕ø͔+å͕ð͔+þ͔β͕)e136",
    ///     "+(-t͕þ͔+u͕ø͔+x͔ο͕+y͔ó͕-z͔ζ͕-ä͕ð͔+œ͔β͕)e137",
    ///     "+(+r͕œ͔-s͕þ͔+x͔π͕-y͔ñ͕+z͔æ͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(-q͕œ͔+s͕ø͔+x͔ρ͕+y͔ï͕-z͔å͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+q͕þ͔-r͕ø͔+x͔σ͕-y͔í͕+z͔ä͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+p͕œ͔-s͕ð͔+x͔τ͕-y͔ë͕+z͔á͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(-p͕þ͔+r͕ð͔-u͕z͔+x͔υ͕+y͔é͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+p͕ø͔-q͕ð͔+t͕z͔+x͔φ͕-y͔ç͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(-m͕œ͔+n͕þ͔-o͕ø͔+x͔ü͕+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+k͕œ͔-l͕þ͔+o͕ð͔-x͔ú͕+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(-j͕œ͔+l͕ø͔-n͕ð͔+x͔ö͕+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+j͕þ͔-k͕ø͔+m͕ð͔-x͔ó͕+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(-h͕œ͔+i͕þ͔-o͕z͔+x͔ñ͕+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+g͕œ͔-i͕ø͔+n͕z͔-x͔ï͕+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(-g͕þ͔+h͕ø͔-m͕z͔+x͔í͕+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(-f͕œ͔+i͕ð͔-l͕z͔+x͔ë͕+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+f͕þ͔-h͕ð͔+k͕z͔-x͔é͕+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(-f͕ø͔+g͕ð͔-j͕z͔+x͔ç͕+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+d͕œ͔-e͕þ͔+o͕y͔-x͔æ͕+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(-c͕œ͔+e͕ø͔-n͕y͔+x͔å͕+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+c͕þ͔-d͕ø͔+m͕y͔-x͔ä͕+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+b͕œ͔-e͕ð͔+l͕y͔-x͔á͕+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(-b͕þ͔+d͕ð͔-k͕y͔+u͕x͔+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+b͕ø͔-c͕ð͔+j͕y͔-t͕x͔+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(-a͕œ͔+e͕z͔-i͕y͔+s͕x͔+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+a͕þ͔-d͕z͔+h͕y͔-r͕x͔+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(-a͕ø͔+c͕z͔-g͕y͔+q͕x͔+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+a͕ð͔-b͕z͔+f͕y͔-p͕x͔+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    ///     "+(+a͕z͔+b͕ð͔+c͕ø͔+d͕þ͔+e͕œ͔)e34567",
    ///     "+(-a͕y͔+f͕ð͔+g͕ø͔+h͕þ͔+i͕œ͔)e24576",
    ///     "+(-b͕y͔-f͕z͔+j͕ø͔+k͕þ͔+l͕œ͔)e23567",
    ///     "+(-c͕y͔-g͕z͔-j͕ð͔+m͕þ͔+n͕œ͔)e23476",
    ///     "+(-d͕y͔-h͕z͔-k͕ð͔-m͕ø͔+o͕œ͔)e23457",
    ///     "+(-e͕y͔-i͕z͔-l͕ð͔-n͕ø͔-o͕þ͔)e23465",
    ///     "+(+a͕x͔+p͕ð͔+q͕ø͔+r͕þ͔+s͕œ͔)e14567",
    ///     "+(+b͕x͔-p͕z͔+t͕ø͔+u͕þ͔+á͕œ͔)e13576",
    ///     "+(+c͕x͔-q͕z͔-t͕ð͔+ä͕þ͔+å͕œ͔)e13467",
    ///     "+(+d͕x͔-r͕z͔-u͕ð͔-ä͕ø͔+æ͕œ͔)e13475",
    ///     "+(+e͕x͔-s͕z͔-á͕ð͔-å͕ø͔-æ͕þ͔)e13456",
    ///     "+(+f͕x͔+p͕y͔+ç͕ø͔+é͕þ͔+ë͕œ͔)e12567",
    ///     "+(+g͕x͔+q͕y͔-ç͕ð͔+í͕þ͔+ï͕œ͔)e12476",
    ///     "+(+h͕x͔+r͕y͔-é͕ð͔-í͕ø͔+ñ͕œ͔)e12457",
    ///     "+(+i͕x͔+s͕y͔-ë͕ð͔-ï͕ø͔-ñ͕þ͔)e12465",
    ///     "+(+j͕x͔+t͕y͔+z͔ç͕+ó͕þ͔+ö͕œ͔)e12367",
    ///     "+(+k͕x͔+u͕y͔+z͔é͕-ó͕ø͔+ú͕œ͔)e12375",
    ///     "+(+l͕x͔+y͔á͕+z͔ë͕-ö͕ø͔-ú͕þ͔)e12356",
    ///     "+(+m͕x͔+y͔ä͕+z͔í͕+ð͔ó͕+ü͕œ͔)e12347",
    ///     "+(+n͕x͔+y͔å͕+z͔ï͕+ð͔ö͕-ü͕þ͔)e12364",
    ///     "+(+o͕x͔+y͔æ͕+z͔ñ͕+ð͔ú͕+ø͔ü͕)e12345",
    ///     "+(-W͔a͕+x͔Η͕-y͔Β͕+z͔Α͕-Ó͕œ͔+Ö͕þ͔-Ú͕ø͔+Ü͕ð͔)e04576",
    ///     "+(-W͔b͕+x͔Θ͕-y͔Γ͕-z͔Ü͕+Í͕œ͔-Ï͕þ͔+Ñ͕ø͔+ð͔Α͕)e03567",
    ///     "+(-W͔c͕+x͔Ι͕-y͔Δ͕+z͔Ú͕-É͕œ͔+Ë͕þ͔-Ñ͕ð͔+ø͔Α͕)e03476",
    ///     "+(-W͔d͕+x͔Κ͕-y͔Ε͕-z͔Ö͕+Ç͕œ͔-Ë͕ø͔+Ï͕ð͔+þ͔Α͕)e03457",
    ///     "+(-W͔e͕+x͔Λ͕-y͔Ζ͕+z͔Ó͕-Ç͕þ͔+É͕ø͔-Í͕ð͔+œ͔Α͕)e03465",
    ///     "+(-W͔f͕+x͔Μ͕+y͔Ü͕-z͔Γ͕-Ä͕œ͔+Å͕þ͔-Æ͕ø͔+ð͔Β͕)e02576",
    ///     "+(+U͕œ͔-W͔g͕+x͔Ν͕-y͔Ú͕-z͔Δ͕-Á͕þ͔+Æ͕ð͔+ø͔Β͕)e02467",
    ///     "+(-T͕œ͔-W͔h͕+x͔Ξ͕+y͔Ö͕-z͔Ε͕+Á͕ø͔-Å͕ð͔+þ͔Β͕)e02475",
    ///     "+(+T͕þ͔-U͕ø͔-W͔i͕+x͔Ο͕-y͔Ó͕-z͔Ζ͕+Ä͕ð͔+œ͔Β͕)e02456",
    ///     "+(-R͕œ͔+S͕þ͔-W͔j͕+x͔Π͕+y͔Ñ͕-z͔Æ͕-ð͔Δ͕+ø͔Γ͕)e02376",
    ///     "+(+Q͕œ͔-S͕ø͔-W͔k͕+x͔Ρ͕-y͔Ï͕+z͔Å͕-ð͔Ε͕+þ͔Γ͕)e02357",
    ///     "+(-Q͕þ͔+R͕ø͔-W͔l͕+x͔Σ͕+y͔Í͕-z͔Ä͕-ð͔Ζ͕+œ͔Γ͕)e02365",
    ///     "+(-P͕œ͔+S͕ð͔-W͔m͕+x͔Τ͕+y͔Ë͕-z͔Á͕-ø͔Ε͕+þ͔Δ͕)e02374",
    ///     "+(+P͕þ͔-R͕ð͔+U͕z͔-W͔n͕+x͔Υ͕-y͔É͕-ø͔Ζ͕+œ͔Δ͕)e02346",
    ///     "+(-P͕ø͔+Q͕ð͔-T͕z͔-W͔o͕+x͔Φ͕+y͔Ç͕-þ͔Ζ͕+œ͔Ε͕)e02354",
    ///     "+(+M͕œ͔-N͕þ͔+O͕ø͔-W͔p͕-x͔Ü͕+y͔Μ͕-z͔Θ͕+ð͔Η͕)e01567",
    ///     "+(-K͕œ͔+L͕þ͔-O͕ð͔-W͔q͕+x͔Ú͕+y͔Ν͕-z͔Ι͕+ø͔Η͕)e01476",
    ///     "+(+J͕œ͔-L͕ø͔+N͕ð͔-W͔r͕-x͔Ö͕+y͔Ξ͕-z͔Κ͕+þ͔Η͕)e01457",
    ///     "+(-J͕þ͔+K͕ø͔-M͕ð͔-W͔s͕+x͔Ó͕+y͔Ο͕-z͔Λ͕+œ͔Η͕)e01465",
    ///     "+(+H͕œ͔-I͕þ͔+O͕z͔-W͔t͕-x͔Ñ͕+y͔Π͕-ð͔Ι͕+ø͔Θ͕)e01367",
    ///     "+(-G͕œ͔+I͕ø͔-N͕z͔-W͔u͕+x͔Ï͕+y͔Ρ͕-ð͔Κ͕+þ͔Θ͕)e01375",
    ///     "+(+G͕þ͔-H͕ø͔+M͕z͔-W͔á͕-x͔Í͕+y͔Σ͕-ð͔Λ͕+œ͔Θ͕)e01356",
    ///     "+(+F͕œ͔-I͕ð͔+L͕z͔-W͔ä͕-x͔Ë͕+y͔Τ͕-ø͔Κ͕+þ͔Ι͕)e01347",
    ///     "+(-F͕þ͔+H͕ð͔-K͕z͔-W͔å͕+x͔É͕+y͔Υ͕-ø͔Λ͕+œ͔Ι͕)e01364",
    ///     "+(+F͕ø͔-G͕ð͔+J͕z͔-W͔æ͕-x͔Ç͕+y͔Φ͕-þ͔Λ͕+œ͔Κ͕)e01345",
    ///     "+(-D͕œ͔+E͕þ͔-O͕y͔-W͔ç͕+x͔Æ͕+z͔Π͕-ð͔Ν͕+ø͔Μ͕)e01276",
    ///     "+(+C͕œ͔-E͕ø͔+N͕y͔-W͔é͕-x͔Å͕+z͔Ρ͕-ð͔Ξ͕+þ͔Μ͕)e01257",
    ///     "+(-C͕þ͔+D͕ø͔-M͕y͔-W͔ë͕+x͔Ä͕+z͔Σ͕-ð͔Ο͕+œ͔Μ͕)e01265",
    ///     "+(-B͕œ͔+E͕ð͔-L͕y͔-W͔í͕+x͔Á͕+z͔Τ͕-ø͔Ξ͕+þ͔Ν͕)e01274",
    ///     "+(+B͕þ͔-D͕ð͔+K͕y͔-U͕x͔-W͔ï͕+z͔Υ͕-ø͔Ο͕+œ͔Ν͕)e01246",
    ///     "+(-B͕ø͔+C͕ð͔-J͕y͔+T͕x͔-W͔ñ͕+z͔Φ͕-þ͔Ο͕+œ͔Ξ͕)e01254",
    ///     "+(+A͕œ͔-E͕z͔+I͕y͔-S͕x͔-W͔ó͕+ð͔Τ͕-ø͔Ρ͕+þ͔Π͕)e01237",
    ///     "+(-A͕þ͔+D͕z͔-H͕y͔+R͕x͔-W͔ö͕+ð͔Υ͕-ø͔Σ͕+œ͔Π͕)e01263",
    ///     "+(+A͕ø͔-C͕z͔+G͕y͔-Q͕x͔-W͔ú͕+ð͔Φ͕-þ͔Σ͕+œ͔Ρ͕)e01235",
    ///     "+(-A͕ð͔+B͕z͔-F͕y͔+P͕x͔-W͔ü͕+ø͔Φ͕-þ͔Υ͕+œ͔Τ͕)e01243",
    ///     "+(+y͔Α͕+z͔Β͕+ð͔Γ͕+ø͔Δ͕+þ͔Ε͕+œ͔Ζ͕)e0234576",
    ///     "+(-x͔Α͕+z͔Η͕+ð͔Θ͕+ø͔Ι͕+þ͔Κ͕+œ͔Λ͕)e0134567",
    ///     "+(-x͔Β͕-y͔Η͕+ð͔Μ͕+ø͔Ν͕+þ͔Ξ͕+œ͔Ο͕)e0124576",
    ///     "+(-x͔Γ͕-y͔Θ͕-z͔Μ͕+ø͔Π͕+þ͔Ρ͕+œ͔Σ͕)e0123567",
    ///     "+(-x͔Δ͕-y͔Ι͕-z͔Ν͕-ð͔Π͕+þ͔Τ͕+œ͔Υ͕)e0123476",
    ///     "+(-x͔Ε͕-y͔Κ͕-z͔Ξ͕-ð͔Ρ͕-ø͔Τ͕+œ͔Φ͕)e0123457",
    ///     "+(-x͔Ζ͕-y͔Λ͕-z͔Ο͕-ð͔Σ͕-ø͔Υ͕-þ͔Φ͕)e0123465",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn double_flector() -> Self {
        Self::volume6() + Self::volume4() + Self::plane() + Self::direction()
    }
    /// The multivector of simple triple flector $`f_{s3} \equiv v^6 + v^4 + p + P`$.
    ///
    /// ```
    /// use vee::{PgaP7 as Vee, format_eq};
    ///
    /// let simple_triple_flector = Vee::volume6().lhs() * Vee::simple_triple_motor().rhs();
    ///
    /// assert_eq!(
    ///     simple_triple_flector.basis_blades(),
    ///     Vee::simple_triple_flector().basis_blades()
    /// );
    /// format_eq!(simple_triple_flector, [
    ///     "+(+W͔v͕-X͕x͔-Y͕y͔-Z͕z͔-Ð͕ð͔-Ø͕ø͔-Þ͕þ͔-Œ͕œ͔)e0",
    ///     "+(+v͕x͔-y͔α͕-z͔β͕-ð͔γ͕-ø͔δ͕-þ͔ε͕-œ͔ζ͕)e1",
    ///     "+(+v͕y͔+x͔α͕-z͔η͕-ð͔θ͕-ø͔ι͕-þ͔κ͕-œ͔λ͕)e2",
    ///     "+(+v͕z͔+x͔β͕+y͔η͕-ð͔μ͕-ø͔ν͕-þ͔ξ͕-œ͔ο͕)e3",
    ///     "+(+v͕ð͔+x͔γ͕+y͔θ͕+z͔μ͕-ø͔π͕-þ͔ρ͕-œ͔σ͕)e4",
    ///     "+(+v͕ø͔+x͔δ͕+y͔ι͕+z͔ν͕+ð͔π͕-þ͔τ͕-œ͔υ͕)e5",
    ///     "+(+v͕þ͔+x͔ε͕+y͔κ͕+z͔ξ͕+ð͔ρ͕+ø͔τ͕-œ͔φ͕)e6",
    ///     "+(+v͕œ͔+x͔ζ͕+y͔λ͕+z͔ο͕+ð͔σ͕+ø͔υ͕+þ͔φ͕)e7",
    ///     "+(-A͕z͔-B͕ð͔-C͕ø͔-D͕þ͔-E͕œ͔+W͔α͕+X͕y͔-Y͕x͔)e012",
    ///     "+(+A͕y͔-F͕ð͔-G͕ø͔-H͕þ͔-I͕œ͔+W͔β͕+X͕z͔-Z͕x͔)e013",
    ///     "+(+B͕y͔+F͕z͔-J͕ø͔-K͕þ͔-L͕œ͔+W͔γ͕+X͕ð͔-x͔Ð͕)e014",
    ///     "+(+C͕y͔+G͕z͔+J͕ð͔-M͕þ͔-N͕œ͔+W͔δ͕+X͕ø͔-x͔Ø͕)e015",
    ///     "+(+D͕y͔+H͕z͔+K͕ð͔+M͕ø͔-O͕œ͔+W͔ε͕+X͕þ͔-x͔Þ͕)e016",
    ///     "+(+E͕y͔+I͕z͔+L͕ð͔+N͕ø͔+O͕þ͔+W͔ζ͕+X͕œ͔-x͔Œ͕)e017",
    ///     "+(-A͕x͔-P͕ð͔-Q͕ø͔-R͕þ͔-S͕œ͔+W͔η͕+Y͕z͔-Z͕y͔)e023",
    ///     "+(-B͕x͔+P͕z͔-T͕ø͔-U͕þ͔+W͔θ͕+Y͕ð͔-y͔Ð͕-Á͕œ͔)e024",
    ///     "+(-C͕x͔+Q͕z͔+T͕ð͔+W͔ι͕+Y͕ø͔-y͔Ø͕-Ä͕þ͔-Å͕œ͔)e025",
    ///     "+(-D͕x͔+R͕z͔+U͕ð͔+W͔κ͕+Y͕þ͔-y͔Þ͕+Ä͕ø͔-Æ͕œ͔)e026",
    ///     "+(-E͕x͔+S͕z͔+W͔λ͕+Y͕œ͔-y͔Œ͕+Á͕ð͔+Å͕ø͔+Æ͕þ͔)e027",
    ///     "+(-F͕x͔-P͕y͔+W͔μ͕+Z͕ð͔-z͔Ð͕-Ç͕ø͔-É͕þ͔-Ë͕œ͔)e034",
    ///     "+(-G͕x͔-Q͕y͔+W͔ν͕+Z͕ø͔-z͔Ø͕+Ç͕ð͔-Í͕þ͔-Ï͕œ͔)e035",
    ///     "+(-H͕x͔-R͕y͔+W͔ξ͕+Z͕þ͔-z͔Þ͕+É͕ð͔+Í͕ø͔-Ñ͕œ͔)e036",
    ///     "+(-I͕x͔-S͕y͔+W͔ο͕+Z͕œ͔-z͔Œ͕+Ë͕ð͔+Ï͕ø͔+Ñ͕þ͔)e037",
    ///     "+(-J͕x͔-T͕y͔+W͔π͕-z͔Ç͕+Ð͕ø͔-Ó͕þ͔-Ö͕œ͔-Ø͕ð͔)e045",
    ///     "+(-K͕x͔-U͕y͔+W͔ρ͕-z͔É͕+Ð͕þ͔+Ó͕ø͔-Ú͕œ͔-Þ͕ð͔)e046",
    ///     "+(-L͕x͔+W͔σ͕-y͔Á͕-z͔Ë͕+Ð͕œ͔+Ö͕ø͔+Ú͕þ͔-ð͔Œ͕)e047",
    ///     "+(-M͕x͔+W͔τ͕-y͔Ä͕-z͔Í͕-Ó͕ð͔+Ø͕þ͔-Ü͕œ͔-Þ͕ø͔)e056",
    ///     "+(-N͕x͔+W͔υ͕-y͔Å͕-z͔Ï͕-Ö͕ð͔+Ø͕œ͔+Ü͕þ͔-ø͔Œ͕)e057",
    ///     "+(-O͕x͔+W͔φ͕-y͔Æ͕-z͔Ñ͕-Ú͕ð͔-Ü͕ø͔+Þ͕œ͔-þ͔Œ͕)e067",
    ///     "+(+x͔η͕-y͔β͕+z͔α͕-ð͔ü͕+ó͕œ͔-ö͕þ͔+ø͔ú͕)e123",
    ///     "+(+x͔θ͕-y͔γ͕+z͔ü͕-í͕œ͔+ï͕þ͔+ð͔α͕-ñ͕ø͔)e124",
    ///     "+(+x͔ι͕-y͔δ͕-z͔ú͕+é͕œ͔-ë͕þ͔+ð͔ñ͕+ø͔α͕)e125",
    ///     "+(+x͔κ͕-y͔ε͕+z͔ö͕-ç͕œ͔+ë͕ø͔-ï͕ð͔+þ͔α͕)e126",
    ///     "+(+x͔λ͕-y͔ζ͕-z͔ó͕+ç͕þ͔-é͕ø͔+í͕ð͔+œ͔α͕)e127",
    ///     "+(+x͔μ͕-y͔ü͕-z͔γ͕+ä͕œ͔-å͕þ͔+æ͕ø͔+ð͔β͕)e134",
    ///     "+(-u͕œ͔+x͔ν͕+y͔ú͕-z͔δ͕+á͕þ͔-æ͕ð͔+ø͔β͕)e135",
    ///     "+(+t͕œ͔+x͔ξ͕-y͔ö͕-z͔ε͕-á͕ø͔+å͕ð͔+þ͔β͕)e136",
    ///     "+(-t͕þ͔+u͕ø͔+x͔ο͕+y͔ó͕-z͔ζ͕-ä͕ð͔+œ͔β͕)e137",
    ///     "+(+r͕œ͔-s͕þ͔+x͔π͕-y͔ñ͕+z͔æ͕-ð͔δ͕+ø͔γ͕)e145",
    ///     "+(-q͕œ͔+s͕ø͔+x͔ρ͕+y͔ï͕-z͔å͕-ð͔ε͕+þ͔γ͕)e146",
    ///     "+(+q͕þ͔-r͕ø͔+x͔σ͕-y͔í͕+z͔ä͕-ð͔ζ͕+œ͔γ͕)e147",
    ///     "+(+p͕œ͔-s͕ð͔+x͔τ͕-y͔ë͕+z͔á͕-ø͔ε͕+þ͔δ͕)e156",
    ///     "+(-p͕þ͔+r͕ð͔-u͕z͔+x͔υ͕+y͔é͕-ø͔ζ͕+œ͔δ͕)e157",
    ///     "+(+p͕ø͔-q͕ð͔+t͕z͔+x͔φ͕-y͔ç͕-þ͔ζ͕+œ͔ε͕)e167",
    ///     "+(-m͕œ͔+n͕þ͔-o͕ø͔+x͔ü͕+y͔μ͕-z͔θ͕+ð͔η͕)e234",
    ///     "+(+k͕œ͔-l͕þ͔+o͕ð͔-x͔ú͕+y͔ν͕-z͔ι͕+ø͔η͕)e235",
    ///     "+(-j͕œ͔+l͕ø͔-n͕ð͔+x͔ö͕+y͔ξ͕-z͔κ͕+þ͔η͕)e236",
    ///     "+(+j͕þ͔-k͕ø͔+m͕ð͔-x͔ó͕+y͔ο͕-z͔λ͕+œ͔η͕)e237",
    ///     "+(-h͕œ͔+i͕þ͔-o͕z͔+x͔ñ͕+y͔π͕-ð͔ι͕+ø͔θ͕)e245",
    ///     "+(+g͕œ͔-i͕ø͔+n͕z͔-x͔ï͕+y͔ρ͕-ð͔κ͕+þ͔θ͕)e246",
    ///     "+(-g͕þ͔+h͕ø͔-m͕z͔+x͔í͕+y͔σ͕-ð͔λ͕+œ͔θ͕)e247",
    ///     "+(-f͕œ͔+i͕ð͔-l͕z͔+x͔ë͕+y͔τ͕-ø͔κ͕+þ͔ι͕)e256",
    ///     "+(+f͕þ͔-h͕ð͔+k͕z͔-x͔é͕+y͔υ͕-ø͔λ͕+œ͔ι͕)e257",
    ///     "+(-f͕ø͔+g͕ð͔-j͕z͔+x͔ç͕+y͔φ͕-þ͔λ͕+œ͔κ͕)e267",
    ///     "+(+d͕œ͔-e͕þ͔+o͕y͔-x͔æ͕+z͔π͕-ð͔ν͕+ø͔μ͕)e345",
    ///     "+(-c͕œ͔+e͕ø͔-n͕y͔+x͔å͕+z͔ρ͕-ð͔ξ͕+þ͔μ͕)e346",
    ///     "+(+c͕þ͔-d͕ø͔+m͕y͔-x͔ä͕+z͔σ͕-ð͔ο͕+œ͔μ͕)e347",
    ///     "+(+b͕œ͔-e͕ð͔+l͕y͔-x͔á͕+z͔τ͕-ø͔ξ͕+þ͔ν͕)e356",
    ///     "+(-b͕þ͔+d͕ð͔-k͕y͔+u͕x͔+z͔υ͕-ø͔ο͕+œ͔ν͕)e357",
    ///     "+(+b͕ø͔-c͕ð͔+j͕y͔-t͕x͔+z͔φ͕-þ͔ο͕+œ͔ξ͕)e367",
    ///     "+(-a͕œ͔+e͕z͔-i͕y͔+s͕x͔+ð͔τ͕-ø͔ρ͕+þ͔π͕)e456",
    ///     "+(+a͕þ͔-d͕z͔+h͕y͔-r͕x͔+ð͔υ͕-ø͔σ͕+œ͔π͕)e457",
    ///     "+(-a͕ø͔+c͕z͔-g͕y͔+q͕x͔+ð͔φ͕-þ͔σ͕+œ͔ρ͕)e467",
    ///     "+(+a͕ð͔-b͕z͔+f͕y͔-p͕x͔+ø͔φ͕-þ͔υ͕+œ͔τ͕)e567",
    ///     "+(+a͕z͔+b͕ð͔+c͕ø͔+d͕þ͔+e͕œ͔-x͔y͕+x͕y͔)e34567",
    ///     "+(-a͕y͔+f͕ð͔+g͕ø͔+h͕þ͔+i͕œ͔-x͔z͕+x͕z͔)e24576",
    ///     "+(-b͕y͔-f͕z͔+j͕ø͔+k͕þ͔+l͕œ͔-x͔ð͕+x͕ð͔)e23567",
    ///     "+(-c͕y͔-g͕z͔-j͕ð͔+m͕þ͔+n͕œ͔-x͔ø͕+x͕ø͔)e23476",
    ///     "+(-d͕y͔-h͕z͔-k͕ð͔-m͕ø͔+o͕œ͔-x͔þ͕+x͕þ͔)e23457",
    ///     "+(-e͕y͔-i͕z͔-l͕ð͔-n͕ø͔-o͕þ͔-x͔œ͕+x͕œ͔)e23465",
    ///     "+(+a͕x͔+p͕ð͔+q͕ø͔+r͕þ͔+s͕œ͔-y͔z͕+y͕z͔)e14567",
    ///     "+(+b͕x͔-p͕z͔+t͕ø͔+u͕þ͔-y͔ð͕+y͕ð͔+á͕œ͔)e13576",
    ///     "+(+c͕x͔-q͕z͔-t͕ð͔-y͔ø͕+y͕ø͔+ä͕þ͔+å͕œ͔)e13467",
    ///     "+(+d͕x͔-r͕z͔-u͕ð͔-y͔þ͕+y͕þ͔-ä͕ø͔+æ͕œ͔)e13475",
    ///     "+(+e͕x͔-s͕z͔-y͔œ͕+y͕œ͔-á͕ð͔-å͕ø͔-æ͕þ͔)e13456",
    ///     "+(+f͕x͔+p͕y͔-z͔ð͕+z͕ð͔+ç͕ø͔+é͕þ͔+ë͕œ͔)e12567",
    ///     "+(+g͕x͔+q͕y͔-z͔ø͕+z͕ø͔-ç͕ð͔+í͕þ͔+ï͕œ͔)e12476",
    ///     "+(+h͕x͔+r͕y͔-z͔þ͕+z͕þ͔-é͕ð͔-í͕ø͔+ñ͕œ͔)e12457",
    ///     "+(+i͕x͔+s͕y͔-z͔œ͕+z͕œ͔-ë͕ð͔-ï͕ø͔-ñ͕þ͔)e12465",
    ///     "+(+j͕x͔+t͕y͔+z͔ç͕-ð͔ø͕+ð͕ø͔+ó͕þ͔+ö͕œ͔)e12367",
    ///     "+(+k͕x͔+u͕y͔+z͔é͕-ð͔þ͕+ð͕þ͔-ó͕ø͔+ú͕œ͔)e12375",
    ///     "+(+l͕x͔+y͔á͕+z͔ë͕-ð͔œ͕+ð͕œ͔-ö͕ø͔-ú͕þ͔)e12356",
    ///     "+(+m͕x͔+y͔ä͕+z͔í͕+ð͔ó͕-ø͔þ͕+ø͕þ͔+ü͕œ͔)e12347",
    ///     "+(+n͕x͔+y͔å͕+z͔ï͕+ð͔ö͕-ø͔œ͕+ø͕œ͔-ü͕þ͔)e12364",
    ///     "+(+o͕x͔+y͔æ͕+z͔ñ͕+ð͔ú͕+ø͔ü͕-þ͔œ͕+þ͕œ͔)e12345",
    ///     "+(-W͔a͕+x͔Η͕-y͔Β͕+z͔Α͕-Ó͕œ͔+Ö͕þ͔-Ú͕ø͔+Ü͕ð͔)e04576",
    ///     "+(-W͔b͕+x͔Θ͕-y͔Γ͕-z͔Ü͕+Í͕œ͔-Ï͕þ͔+Ñ͕ø͔+ð͔Α͕)e03567",
    ///     "+(-W͔c͕+x͔Ι͕-y͔Δ͕+z͔Ú͕-É͕œ͔+Ë͕þ͔-Ñ͕ð͔+ø͔Α͕)e03476",
    ///     "+(-W͔d͕+x͔Κ͕-y͔Ε͕-z͔Ö͕+Ç͕œ͔-Ë͕ø͔+Ï͕ð͔+þ͔Α͕)e03457",
    ///     "+(-W͔e͕+x͔Λ͕-y͔Ζ͕+z͔Ó͕-Ç͕þ͔+É͕ø͔-Í͕ð͔+œ͔Α͕)e03465",
    ///     "+(-W͔f͕+x͔Μ͕+y͔Ü͕-z͔Γ͕-Ä͕œ͔+Å͕þ͔-Æ͕ø͔+ð͔Β͕)e02576",
    ///     "+(+U͕œ͔-W͔g͕+x͔Ν͕-y͔Ú͕-z͔Δ͕-Á͕þ͔+Æ͕ð͔+ø͔Β͕)e02467",
    ///     "+(-T͕œ͔-W͔h͕+x͔Ξ͕+y͔Ö͕-z͔Ε͕+Á͕ø͔-Å͕ð͔+þ͔Β͕)e02475",
    ///     "+(+T͕þ͔-U͕ø͔-W͔i͕+x͔Ο͕-y͔Ó͕-z͔Ζ͕+Ä͕ð͔+œ͔Β͕)e02456",
    ///     "+(-R͕œ͔+S͕þ͔-W͔j͕+x͔Π͕+y͔Ñ͕-z͔Æ͕-ð͔Δ͕+ø͔Γ͕)e02376",
    ///     "+(+Q͕œ͔-S͕ø͔-W͔k͕+x͔Ρ͕-y͔Ï͕+z͔Å͕-ð͔Ε͕+þ͔Γ͕)e02357",
    ///     "+(-Q͕þ͔+R͕ø͔-W͔l͕+x͔Σ͕+y͔Í͕-z͔Ä͕-ð͔Ζ͕+œ͔Γ͕)e02365",
    ///     "+(-P͕œ͔+S͕ð͔-W͔m͕+x͔Τ͕+y͔Ë͕-z͔Á͕-ø͔Ε͕+þ͔Δ͕)e02374",
    ///     "+(+P͕þ͔-R͕ð͔+U͕z͔-W͔n͕+x͔Υ͕-y͔É͕-ø͔Ζ͕+œ͔Δ͕)e02346",
    ///     "+(-P͕ø͔+Q͕ð͔-T͕z͔-W͔o͕+x͔Φ͕+y͔Ç͕-þ͔Ζ͕+œ͔Ε͕)e02354",
    ///     "+(+M͕œ͔-N͕þ͔+O͕ø͔-W͔p͕-x͔Ü͕+y͔Μ͕-z͔Θ͕+ð͔Η͕)e01567",
    ///     "+(-K͕œ͔+L͕þ͔-O͕ð͔-W͔q͕+x͔Ú͕+y͔Ν͕-z͔Ι͕+ø͔Η͕)e01476",
    ///     "+(+J͕œ͔-L͕ø͔+N͕ð͔-W͔r͕-x͔Ö͕+y͔Ξ͕-z͔Κ͕+þ͔Η͕)e01457",
    ///     "+(-J͕þ͔+K͕ø͔-M͕ð͔-W͔s͕+x͔Ó͕+y͔Ο͕-z͔Λ͕+œ͔Η͕)e01465",
    ///     "+(+H͕œ͔-I͕þ͔+O͕z͔-W͔t͕-x͔Ñ͕+y͔Π͕-ð͔Ι͕+ø͔Θ͕)e01367",
    ///     "+(-G͕œ͔+I͕ø͔-N͕z͔-W͔u͕+x͔Ï͕+y͔Ρ͕-ð͔Κ͕+þ͔Θ͕)e01375",
    ///     "+(+G͕þ͔-H͕ø͔+M͕z͔-W͔á͕-x͔Í͕+y͔Σ͕-ð͔Λ͕+œ͔Θ͕)e01356",
    ///     "+(+F͕œ͔-I͕ð͔+L͕z͔-W͔ä͕-x͔Ë͕+y͔Τ͕-ø͔Κ͕+þ͔Ι͕)e01347",
    ///     "+(-F͕þ͔+H͕ð͔-K͕z͔-W͔å͕+x͔É͕+y͔Υ͕-ø͔Λ͕+œ͔Ι͕)e01364",
    ///     "+(+F͕ø͔-G͕ð͔+J͕z͔-W͔æ͕-x͔Ç͕+y͔Φ͕-þ͔Λ͕+œ͔Κ͕)e01345",
    ///     "+(-D͕œ͔+E͕þ͔-O͕y͔-W͔ç͕+x͔Æ͕+z͔Π͕-ð͔Ν͕+ø͔Μ͕)e01276",
    ///     "+(+C͕œ͔-E͕ø͔+N͕y͔-W͔é͕-x͔Å͕+z͔Ρ͕-ð͔Ξ͕+þ͔Μ͕)e01257",
    ///     "+(-C͕þ͔+D͕ø͔-M͕y͔-W͔ë͕+x͔Ä͕+z͔Σ͕-ð͔Ο͕+œ͔Μ͕)e01265",
    ///     "+(-B͕œ͔+E͕ð͔-L͕y͔-W͔í͕+x͔Á͕+z͔Τ͕-ø͔Ξ͕+þ͔Ν͕)e01274",
    ///     "+(+B͕þ͔-D͕ð͔+K͕y͔-U͕x͔-W͔ï͕+z͔Υ͕-ø͔Ο͕+œ͔Ν͕)e01246",
    ///     "+(-B͕ø͔+C͕ð͔-J͕y͔+T͕x͔-W͔ñ͕+z͔Φ͕-þ͔Ο͕+œ͔Ξ͕)e01254",
    ///     "+(+A͕œ͔-E͕z͔+I͕y͔-S͕x͔-W͔ó͕+ð͔Τ͕-ø͔Ρ͕+þ͔Π͕)e01237",
    ///     "+(-A͕þ͔+D͕z͔-H͕y͔+R͕x͔-W͔ö͕+ð͔Υ͕-ø͔Σ͕+œ͔Π͕)e01263",
    ///     "+(+A͕ø͔-C͕z͔+G͕y͔-Q͕x͔-W͔ú͕+ð͔Φ͕-þ͔Σ͕+œ͔Ρ͕)e01235",
    ///     "+(-A͕ð͔+B͕z͔-F͕y͔+P͕x͔-W͔ü͕+ø͔Φ͕-þ͔Υ͕+œ͔Τ͕)e01243",
    ///     "+(+x͔x͕+y͔y͕+z͔z͕+ð͔ð͕+ø͔ø͕+þ͔þ͕+œ͔œ͕)e1234567",
    ///     "+(-W͔x͕+y͔Α͕+z͔Β͕+ð͔Γ͕+ø͔Δ͕+þ͔Ε͕+œ͔Ζ͕)e0234576",
    ///     "+(-W͔y͕-x͔Α͕+z͔Η͕+ð͔Θ͕+ø͔Ι͕+þ͔Κ͕+œ͔Λ͕)e0134567",
    ///     "+(-W͔z͕-x͔Β͕-y͔Η͕+ð͔Μ͕+ø͔Ν͕+þ͔Ξ͕+œ͔Ο͕)e0124576",
    ///     "+(-W͔ð͕-x͔Γ͕-y͔Θ͕-z͔Μ͕+ø͔Π͕+þ͔Ρ͕+œ͔Σ͕)e0123567",
    ///     "+(-W͔ø͕-x͔Δ͕-y͔Ι͕-z͔Ν͕-ð͔Π͕+þ͔Τ͕+œ͔Υ͕)e0123476",
    ///     "+(-W͔þ͕-x͔Ε͕-y͔Κ͕-z͔Ξ͕-ð͔Ρ͕-ø͔Τ͕+œ͔Φ͕)e0123457",
    ///     "+(-W͔œ͕-x͔Ζ͕-y͔Λ͕-z͔Ο͕-ð͔Σ͕-ø͔Υ͕-þ͔Φ͕)e0123465",
    /// ]);
    /// ```
    #[must_use]
    #[inline]
    pub fn simple_triple_flector() -> Self {
        Self::volume6() + Self::volume4() + Self::plane() + Self::point()
    }
}
